/* automatically generated by rust-bindgen 0.63.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub type HAL_Handle = i32;
pub type HAL_PortHandle = HAL_Handle;
pub type HAL_AnalogInputHandle = HAL_Handle;
pub type HAL_AnalogOutputHandle = HAL_Handle;
pub type HAL_AnalogTriggerHandle = HAL_Handle;
pub type HAL_CompressorHandle = HAL_Handle;
pub type HAL_CounterHandle = HAL_Handle;
pub type HAL_DigitalHandle = HAL_Handle;
pub type HAL_DigitalPWMHandle = HAL_Handle;
pub type HAL_EncoderHandle = HAL_Handle;
pub type HAL_FPGAEncoderHandle = HAL_Handle;
pub type HAL_GyroHandle = HAL_Handle;
pub type HAL_InterruptHandle = HAL_Handle;
pub type HAL_NotifierHandle = HAL_Handle;
pub type HAL_RelayHandle = HAL_Handle;
pub type HAL_SolenoidHandle = HAL_Handle;
pub type HAL_SerialPortHandle = HAL_Handle;
pub type HAL_CANHandle = HAL_Handle;
pub type HAL_SimDeviceHandle = HAL_Handle;
pub type HAL_SimValueHandle = HAL_Handle;
pub type HAL_DMAHandle = HAL_Handle;
pub type HAL_DutyCycleHandle = HAL_Handle;
pub type HAL_AddressableLEDHandle = HAL_Handle;
pub type HAL_PDPHandle = HAL_CANHandle;
pub type HAL_PowerDistributionHandle = HAL_Handle;
pub type HAL_CTREPCMHandle = HAL_Handle;
pub type HAL_REVPDHHandle = HAL_Handle;
pub type HAL_REVPHHandle = HAL_Handle;
pub type HAL_Bool = i32;
#[doc = " A move-only C++ wrapper around a HAL handle.\n Does not ensure destruction."]
pub type hal_I2CPort = u32;
#[doc = " A move-only C++ wrapper around a HAL handle.\n Does not ensure destruction."]
pub type hal_SPIPort = u32;
#[doc = " C++ wrapper around a HAL simulator value handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hal_SimValue {
    pub m_handle: HAL_SimValueHandle,
}
#[test]
fn bindgen_test_layout_hal_SimValue() {
    const UNINIT: ::std::mem::MaybeUninit<hal_SimValue> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hal_SimValue>(),
        4usize,
        concat!("Size of: ", stringify!(hal_SimValue))
    );
    assert_eq!(
        ::std::mem::align_of::<hal_SimValue>(),
        4usize,
        concat!("Alignment of ", stringify!(hal_SimValue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hal_SimValue),
            "::",
            stringify!(m_handle)
        )
    );
}
#[doc = " C++ wrapper around a HAL simulator int value handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hal_SimInt {
    pub _base: hal_SimValue,
}
#[test]
fn bindgen_test_layout_hal_SimInt() {
    assert_eq!(
        ::std::mem::size_of::<hal_SimInt>(),
        4usize,
        concat!("Size of: ", stringify!(hal_SimInt))
    );
    assert_eq!(
        ::std::mem::align_of::<hal_SimInt>(),
        4usize,
        concat!("Alignment of ", stringify!(hal_SimInt))
    );
}
#[doc = " C++ wrapper around a HAL simulator long value handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hal_SimLong {
    pub _base: hal_SimValue,
}
#[test]
fn bindgen_test_layout_hal_SimLong() {
    assert_eq!(
        ::std::mem::size_of::<hal_SimLong>(),
        4usize,
        concat!("Size of: ", stringify!(hal_SimLong))
    );
    assert_eq!(
        ::std::mem::align_of::<hal_SimLong>(),
        4usize,
        concat!("Alignment of ", stringify!(hal_SimLong))
    );
}
#[doc = " C++ wrapper around a HAL simulator double value handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hal_SimDouble {
    pub _base: hal_SimValue,
}
#[test]
fn bindgen_test_layout_hal_SimDouble() {
    assert_eq!(
        ::std::mem::size_of::<hal_SimDouble>(),
        4usize,
        concat!("Size of: ", stringify!(hal_SimDouble))
    );
    assert_eq!(
        ::std::mem::align_of::<hal_SimDouble>(),
        4usize,
        concat!("Alignment of ", stringify!(hal_SimDouble))
    );
}
#[doc = " C++ wrapper around a HAL simulator enum value handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hal_SimEnum {
    pub _base: hal_SimValue,
}
#[test]
fn bindgen_test_layout_hal_SimEnum() {
    assert_eq!(
        ::std::mem::size_of::<hal_SimEnum>(),
        4usize,
        concat!("Size of: ", stringify!(hal_SimEnum))
    );
    assert_eq!(
        ::std::mem::align_of::<hal_SimEnum>(),
        4usize,
        concat!("Alignment of ", stringify!(hal_SimEnum))
    );
}
#[doc = " C++ wrapper around a HAL simulator boolean value handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hal_SimBoolean {
    pub _base: hal_SimValue,
}
#[test]
fn bindgen_test_layout_hal_SimBoolean() {
    assert_eq!(
        ::std::mem::size_of::<hal_SimBoolean>(),
        4usize,
        concat!("Size of: ", stringify!(hal_SimBoolean))
    );
    assert_eq!(
        ::std::mem::align_of::<hal_SimBoolean>(),
        4usize,
        concat!("Alignment of ", stringify!(hal_SimBoolean))
    );
}
#[doc = " A move-only C++ wrapper around a HAL simulator device handle."]
#[repr(C)]
#[derive(Debug)]
pub struct hal_SimDevice {
    pub m_handle: HAL_SimDeviceHandle,
}
pub const hal_SimDevice_Direction_kInput: hal_SimDevice_Direction = 0;
pub const hal_SimDevice_Direction_kOutput: hal_SimDevice_Direction = 1;
pub const hal_SimDevice_Direction_kBidir: hal_SimDevice_Direction = 2;
#[doc = " Direction of a simulated value (from the perspective of user code)."]
pub type hal_SimDevice_Direction = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_hal_SimDevice() {
    const UNINIT: ::std::mem::MaybeUninit<hal_SimDevice> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hal_SimDevice>(),
        4usize,
        concat!("Size of: ", stringify!(hal_SimDevice))
    );
    assert_eq!(
        ::std::mem::align_of::<hal_SimDevice>(),
        4usize,
        concat!("Alignment of ", stringify!(hal_SimDevice))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hal_SimDevice),
            "::",
            stringify!(m_handle)
        )
    );
}
extern "C" {
    #[doc = " Creates a simulated device.\n\n The device name must be unique.  Returns null if the device name\n already exists.  This is a convenience method that appends index in\n brackets to the device name, e.g. passing index=1 results in \"device[1]\"\n for the device name.\n\n If not in simulation, results in an \"empty\" object that evaluates to false\n in a boolean context.\n\n @param name device name\n @param index device index number to append to name"]
    #[link_name = "\u{1}_ZN3hal9SimDeviceC1EPKci"]
    pub fn hal_SimDevice_SimDevice(
        this: *mut hal_SimDevice,
        name: *const ::std::os::raw::c_char,
        index: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Creates a simulated device.\n\n The device name must be unique.  Returns null if the device name\n already exists.  This is a convenience method that appends index and\n channel in brackets to the device name, e.g. passing index=1 and channel=2\n results in \"device[1,2]\" for the device name.\n\n If not in simulation, results in an \"empty\" object that evaluates to false\n in a boolean context.\n\n @param name device name\n @param index device index number to append to name\n @param channel device channel number to append to name"]
    #[link_name = "\u{1}_ZN3hal9SimDeviceC1EPKcii"]
    pub fn hal_SimDevice_SimDevice1(
        this: *mut hal_SimDevice,
        name: *const ::std::os::raw::c_char,
        index: ::std::os::raw::c_int,
        channel: ::std::os::raw::c_int,
    );
}
impl hal_SimDevice {
    #[inline]
    pub unsafe fn new(name: *const ::std::os::raw::c_char, index: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        hal_SimDevice_SimDevice(__bindgen_tmp.as_mut_ptr(), name, index);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        name: *const ::std::os::raw::c_char,
        index: ::std::os::raw::c_int,
        channel: ::std::os::raw::c_int,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        hal_SimDevice_SimDevice1(__bindgen_tmp.as_mut_ptr(), name, index, channel);
        __bindgen_tmp.assume_init()
    }
}
#[doc = " A std::chrono compatible wrapper around the FPGA Timer."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hal_fpga_clock {
    pub _address: u8,
}
pub type hal_fpga_clock_rep = rep;
pub type hal_fpga_clock_period = u8;
pub type hal_fpga_clock_duration = std_chrono_microseconds;
pub type hal_fpga_clock_time_point = u64;
pub const hal_fpga_clock_is_steady: bool = true;
extern "C" {
    #[link_name = "\u{1}_ZN3hal10fpga_clock8min_timeE"]
    pub static hal_fpga_clock_min_time: hal_fpga_clock_time_point;
}
#[test]
fn bindgen_test_layout_hal_fpga_clock() {
    assert_eq!(
        ::std::mem::size_of::<hal_fpga_clock>(),
        1usize,
        concat!("Size of: ", stringify!(hal_fpga_clock))
    );
    assert_eq!(
        ::std::mem::align_of::<hal_fpga_clock>(),
        1usize,
        concat!("Alignment of ", stringify!(hal_fpga_clock))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN3hal10fpga_clock3nowEv"]
    pub fn hal_fpga_clock_now() -> hal_fpga_clock_time_point;
}
impl hal_fpga_clock {
    #[inline]
    pub unsafe fn now() -> hal_fpga_clock_time_point {
        hal_fpga_clock_now()
    }
}
pub const HAL_AccelerometerRange_HAL_AccelerometerRange_k2G: HAL_AccelerometerRange = 0;
pub const HAL_AccelerometerRange_HAL_AccelerometerRange_k4G: HAL_AccelerometerRange = 1;
pub const HAL_AccelerometerRange_HAL_AccelerometerRange_k8G: HAL_AccelerometerRange = 2;
#[doc = " The acceptable accelerometer ranges."]
pub type HAL_AccelerometerRange = i32;
extern "C" {
    #[doc = " Sets the accelerometer to active or standby mode.\n\n It must be in standby mode to change any configuration.\n\n @param active true to set to active, false for standby"]
    pub fn HAL_SetAccelerometerActive(active: HAL_Bool);
}
extern "C" {
    #[doc = " Sets the range of values that can be measured (either 2, 4, or 8 g-forces).\n\n The accelerometer should be in standby mode when this is called.\n\n @param range the accelerometer range"]
    pub fn HAL_SetAccelerometerRange(range: HAL_AccelerometerRange);
}
extern "C" {
    #[doc = " Gets the x-axis acceleration.\n\n This is a floating point value in units of 1 g-force.\n\n @return the X acceleration"]
    pub fn HAL_GetAccelerometerX() -> f64;
}
extern "C" {
    #[doc = " Gets the y-axis acceleration.\n\n This is a floating point value in units of 1 g-force.\n\n @return the Y acceleration"]
    pub fn HAL_GetAccelerometerY() -> f64;
}
extern "C" {
    #[doc = " Gets the z-axis acceleration.\n\n This is a floating point value in units of 1 g-force.\n\n @return the Z acceleration"]
    pub fn HAL_GetAccelerometerZ() -> f64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HAL_AddressableLEDData {
    pub b: u8,
    pub g: u8,
    pub r: u8,
    pub padding: u8,
}
#[test]
fn bindgen_test_layout_HAL_AddressableLEDData() {
    const UNINIT: ::std::mem::MaybeUninit<HAL_AddressableLEDData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<HAL_AddressableLEDData>(),
        4usize,
        concat!("Size of: ", stringify!(HAL_AddressableLEDData))
    );
    assert_eq!(
        ::std::mem::align_of::<HAL_AddressableLEDData>(),
        1usize,
        concat!("Alignment of ", stringify!(HAL_AddressableLEDData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_AddressableLEDData),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_AddressableLEDData),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_AddressableLEDData),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_AddressableLEDData),
            "::",
            stringify!(padding)
        )
    );
}
extern "C" {
    pub fn HAL_InitializeAddressableLED(
        outputPort: HAL_DigitalHandle,
        status: *mut i32,
    ) -> HAL_AddressableLEDHandle;
}
extern "C" {
    pub fn HAL_FreeAddressableLED(handle: HAL_AddressableLEDHandle);
}
extern "C" {
    pub fn HAL_SetAddressableLEDOutputPort(
        handle: HAL_AddressableLEDHandle,
        outputPort: HAL_DigitalHandle,
        status: *mut i32,
    );
}
extern "C" {
    pub fn HAL_SetAddressableLEDLength(
        handle: HAL_AddressableLEDHandle,
        length: i32,
        status: *mut i32,
    );
}
extern "C" {
    pub fn HAL_WriteAddressableLEDData(
        handle: HAL_AddressableLEDHandle,
        data: *const HAL_AddressableLEDData,
        length: i32,
        status: *mut i32,
    );
}
extern "C" {
    pub fn HAL_SetAddressableLEDBitTiming(
        handle: HAL_AddressableLEDHandle,
        lowTime0NanoSeconds: i32,
        highTime0NanoSeconds: i32,
        lowTime1NanoSeconds: i32,
        highTime1NanoSeconds: i32,
        status: *mut i32,
    );
}
extern "C" {
    pub fn HAL_SetAddressableLEDSyncTime(
        handle: HAL_AddressableLEDHandle,
        syncTimeMicroSeconds: i32,
        status: *mut i32,
    );
}
extern "C" {
    pub fn HAL_StartAddressableLEDOutput(handle: HAL_AddressableLEDHandle, status: *mut i32);
}
extern "C" {
    pub fn HAL_StopAddressableLEDOutput(handle: HAL_AddressableLEDHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Is the channel attached to an accumulator.\n\n @param[in] analogPortHandle Handle to the analog port.\n @param[out] status Error status variable. 0 on success.\n @return The analog channel is attached to an accumulator."]
    pub fn HAL_IsAccumulatorChannel(
        analogPortHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    #[doc = " Initialize the accumulator.\n\n @param[in] analogPortHandle Handle to the analog port.\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_InitAccumulator(analogPortHandle: HAL_AnalogInputHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Resets the accumulator to the initial value.\n\n @param[in] analogPortHandle Handle to the analog port.\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_ResetAccumulator(analogPortHandle: HAL_AnalogInputHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Set the center value of the accumulator.\n\n The center value is subtracted from each A/D value before it is added to the\n accumulator. This is used for the center value of devices like gyros and\n accelerometers to make integration work and to take the device offset into\n account when integrating.\n\n This center value is based on the output of the oversampled and averaged\n source from channel 1. Because of this, any non-zero oversample bits will\n affect the size of the value for this field.\n\n @param[in] analogPortHandle Handle to the analog port.\n @param[in] center The center value of the accumulator.\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_SetAccumulatorCenter(
        analogPortHandle: HAL_AnalogInputHandle,
        center: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Set the accumulator's deadband.\n\n @param[in] analogPortHandle Handle to the analog port.\n @param[in] deadband The deadband of the accumulator.\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_SetAccumulatorDeadband(
        analogPortHandle: HAL_AnalogInputHandle,
        deadband: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Read the accumulated value.\n\n Read the value that has been accumulating on channel 1.\n The accumulator is attached after the oversample and average engine.\n\n @param[in] analogPortHandle Handle to the analog port.\n @param[out] status Error status variable. 0 on success.\n @return The 64-bit value accumulated since the last Reset()."]
    pub fn HAL_GetAccumulatorValue(
        analogPortHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    ) -> i64;
}
extern "C" {
    #[doc = " Read the number of accumulated values.\n\n Read the count of the accumulated values since the accumulator was last\n Reset().\n\n @param[in] analogPortHandle Handle to the analog port.\n @param[out] status Error status variable. 0 on success.\n @return The number of times samples from the channel were accumulated."]
    pub fn HAL_GetAccumulatorCount(
        analogPortHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    ) -> i64;
}
extern "C" {
    #[doc = " Read the accumulated value and the number of accumulated values atomically.\n\n This function reads the value and count from the FPGA atomically.\n This can be used for averaging.\n\n @param[in] analogPortHandle Handle to the analog port.\n @param[in] value Pointer to the 64-bit accumulated output.\n @param[in] count Pointer to the number of accumulation cycles.\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_GetAccumulatorOutput(
        analogPortHandle: HAL_AnalogInputHandle,
        value: *mut i64,
        count: *mut i64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Initializes an analog gyro.\n\n @param[in] handle handle to the analog port\n @param[in] allocationLocation the location where the allocation is occurring\n                                (can be null)\n @param[out] status the error code, or 0 for success\n @return the initialized gyro handle"]
    pub fn HAL_InitializeAnalogGyro(
        handle: HAL_AnalogInputHandle,
        allocationLocation: *const ::std::os::raw::c_char,
        status: *mut i32,
    ) -> HAL_GyroHandle;
}
extern "C" {
    #[doc = " Sets up an analog gyro with the proper offsets and settings for the KOP\n analog gyro.\n\n @param[in] handle the gyro handle\n @param[out] status the error code, or 0 for success"]
    pub fn HAL_SetupAnalogGyro(handle: HAL_GyroHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Frees an analog gyro.\n\n @param handle the gyro handle"]
    pub fn HAL_FreeAnalogGyro(handle: HAL_GyroHandle);
}
extern "C" {
    #[doc = " Sets the analog gyro parameters to the specified values.\n\n This is meant to be used if you want to reuse the values from a previous\n calibration.\n\n @param[in] handle                  the gyro handle\n @param[in] voltsPerDegreePerSecond the gyro volts scaling\n @param[in] offset                  the gyro offset\n @param[in] center                  the gyro center\n @param[out] status                  the error code, or 0 for success"]
    pub fn HAL_SetAnalogGyroParameters(
        handle: HAL_GyroHandle,
        voltsPerDegreePerSecond: f64,
        offset: f64,
        center: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Sets the analog gyro volts per degrees per second scaling.\n\n @param[in] handle                  the gyro handle\n @param[in] voltsPerDegreePerSecond the gyro volts scaling\n @param[out] status                  the error code, or 0 for success"]
    pub fn HAL_SetAnalogGyroVoltsPerDegreePerSecond(
        handle: HAL_GyroHandle,
        voltsPerDegreePerSecond: f64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Resets the analog gyro value to 0.\n\n @param[in] handle the gyro handle\n @param[out] status the error code, or 0 for success"]
    pub fn HAL_ResetAnalogGyro(handle: HAL_GyroHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Calibrates the analog gyro.\n\n This happens by calculating the average value of the gyro over 5 seconds, and\n setting that as the center. Note that this call blocks for 5 seconds to\n perform this.\n\n @param[in] handle the gyro handle\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_CalibrateAnalogGyro(handle: HAL_GyroHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Sets the deadband of the analog gyro.\n\n @param[in] handle the gyro handle\n @param[in] volts  the voltage deadband\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_SetAnalogGyroDeadband(handle: HAL_GyroHandle, volts: f64, status: *mut i32);
}
extern "C" {
    #[doc = " Gets the gyro angle in degrees.\n\n @param[in] handle the gyro handle\n @param[out] status Error status variable. 0 on success.\n @return the gyro angle in degrees"]
    pub fn HAL_GetAnalogGyroAngle(handle: HAL_GyroHandle, status: *mut i32) -> f64;
}
extern "C" {
    #[doc = " Gets the gyro rate in degrees/second.\n\n @param[in] handle the gyro handle\n @param[out] status Error status variable. 0 on success.\n @return the gyro rate in degrees/second"]
    pub fn HAL_GetAnalogGyroRate(handle: HAL_GyroHandle, status: *mut i32) -> f64;
}
extern "C" {
    #[doc = " Gets the calibrated gyro offset.\n\n Can be used to not repeat a calibration but reconstruct the gyro object.\n\n @param[in] handle the gyro handle\n @param[out] status Error status variable. 0 on success.\n @return the gryo offset"]
    pub fn HAL_GetAnalogGyroOffset(handle: HAL_GyroHandle, status: *mut i32) -> f64;
}
extern "C" {
    #[doc = " Gets the calibrated gyro center.\n\n Can be used to not repeat a calibration but reconstruct the gyro object.\n\n @param[in] handle the gyro handle\n @param[out] status Error status variable. 0 on success.\n @return the gyro center"]
    pub fn HAL_GetAnalogGyroCenter(handle: HAL_GyroHandle, status: *mut i32) -> i32;
}
extern "C" {
    #[doc = " Initializes the analog input port using the given port object.\n\n @param[in] portHandle Handle to the port to initialize.\n @param[in] allocationLocation the location where the allocation is occurring\n                               (can be null)\n @param[out] status the error code, or 0 for success\n @return the created analog input handle"]
    pub fn HAL_InitializeAnalogInputPort(
        portHandle: HAL_PortHandle,
        allocationLocation: *const ::std::os::raw::c_char,
        status: *mut i32,
    ) -> HAL_AnalogInputHandle;
}
extern "C" {
    #[doc = " Frees an analog input port.\n\n @param analogPortHandle Handle to the analog port."]
    pub fn HAL_FreeAnalogInputPort(analogPortHandle: HAL_AnalogInputHandle);
}
extern "C" {
    #[doc = " Checks that the analog module number is valid.\n\n @param module The analog module number.\n @return Analog module is valid and present"]
    pub fn HAL_CheckAnalogModule(module: i32) -> HAL_Bool;
}
extern "C" {
    #[doc = " Checks that the analog output channel number is valid.\n Verifies that the analog channel number is one of the legal channel numbers.\n Channel numbers are 0-based.\n\n @param channel The analog output channel number.\n @return Analog channel is valid"]
    pub fn HAL_CheckAnalogInputChannel(channel: i32) -> HAL_Bool;
}
extern "C" {
    #[doc = " Indicates the analog input is used by a simulated device.\n\n @param handle the analog input handle\n @param device simulated device handle"]
    pub fn HAL_SetAnalogInputSimDevice(handle: HAL_AnalogInputHandle, device: HAL_SimDeviceHandle);
}
extern "C" {
    #[doc = " Sets the sample rate.\n\n This is a global setting for the Athena and effects all channels.\n\n @param[in] samplesPerSecond The number of samples per channel per second.\n @param[out] status          the error code, or 0 for success"]
    pub fn HAL_SetAnalogSampleRate(samplesPerSecond: f64, status: *mut i32);
}
extern "C" {
    #[doc = " Gets the current sample rate.\n\n This assumes one entry in the scan list.\n This is a global setting for the Athena and effects all channels.\n\n @param[out] status the error code, or 0 for success\n @return Sample rate."]
    pub fn HAL_GetAnalogSampleRate(status: *mut i32) -> f64;
}
extern "C" {
    #[doc = " Sets the number of averaging bits.\n\n This sets the number of averaging bits. The actual number of averaged samples\n is 2**bits. Use averaging to improve the stability of your measurement at the\n expense of sampling rate. The averaging is done automatically in the FPGA.\n\n @param[in] analogPortHandle Handle to the analog port to configure.\n @param[in] bits Number of bits to average.\n @param[out] status the error code, or 0 for success"]
    pub fn HAL_SetAnalogAverageBits(
        analogPortHandle: HAL_AnalogInputHandle,
        bits: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Gets the number of averaging bits.\n\n This gets the number of averaging bits from the FPGA. The actual number of\n averaged samples is 2**bits. The averaging is done automatically in the FPGA.\n\n @param[in] analogPortHandle Handle to the analog port to use.\n @param[out] status the error code, or 0 for success\n @return Bits to average."]
    pub fn HAL_GetAnalogAverageBits(
        analogPortHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Sets the number of oversample bits.\n\n This sets the number of oversample bits. The actual number of oversampled\n values is 2**bits. Use oversampling to improve the resolution of your\n measurements at the expense of sampling rate. The oversampling is done\n automatically in the FPGA.\n\n @param[in] analogPortHandle Handle to the analog port to use.\n @param[in] bits Number of bits to oversample.\n @param[out] status the error code, or 0 for success"]
    pub fn HAL_SetAnalogOversampleBits(
        analogPortHandle: HAL_AnalogInputHandle,
        bits: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Gets the number of oversample bits.\n\n This gets the number of oversample bits from the FPGA. The actual number of\n oversampled values is 2**bits. The oversampling is done automatically in the\n FPGA.\n\n @param[in] analogPortHandle Handle to the analog port to use.\n @param[out] status          the error code, or 0 for success\n @return Bits to oversample."]
    pub fn HAL_GetAnalogOversampleBits(
        analogPortHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Gets a sample straight from the channel on this module.\n\n The sample is a 12-bit value representing the 0V to 5V range of the A/D\n converter in the module. The units are in A/D converter codes.  Use\n GetVoltage() to get the analog value in calibrated units.\n\n @param[in] analogPortHandle Handle to the analog port to use.\n @param[out] status the error code, or 0 for success\n @return A sample straight from the channel on this module."]
    pub fn HAL_GetAnalogValue(analogPortHandle: HAL_AnalogInputHandle, status: *mut i32) -> i32;
}
extern "C" {
    #[doc = " Gets a sample from the output of the oversample and average engine for the\n channel.\n\n The sample is 12-bit + the value configured in SetOversampleBits().\n The value configured in SetAverageBits() will cause this value to be averaged\n 2**bits number of samples. This is not a sliding window.  The sample will not\n change until 2**(OversamplBits + AverageBits) samples have been acquired from\n the module on this channel. Use GetAverageVoltage() to get the analog value\n in calibrated units.\n\n @param[in] analogPortHandle Handle to the analog port to use.\n @param[out] status the error code, or 0 for success\n @return A sample from the oversample and average engine for the channel."]
    pub fn HAL_GetAnalogAverageValue(
        analogPortHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Converts a voltage to a raw value for a specified channel.\n\n This process depends on the calibration of each channel, so the channel must\n be specified.\n\n @todo This assumes raw values.  Oversampling not supported as is.\n\n @param[in] analogPortHandle Handle to the analog port to use.\n @param[in] voltage The voltage to convert.\n @param[out] status the error code, or 0 for success\n @return The raw value for the channel."]
    pub fn HAL_GetAnalogVoltsToValue(
        analogPortHandle: HAL_AnalogInputHandle,
        voltage: f64,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Gets a scaled sample straight from the channel on this module.\n\n The value is scaled to units of Volts using the calibrated scaling data from\n GetLSBWeight() and GetOffset().\n\n @param[in] analogPortHandle Handle to the analog port to use.\n @param[out] status the error code, or 0 for success\n @return A scaled sample straight from the channel on this module."]
    pub fn HAL_GetAnalogVoltage(analogPortHandle: HAL_AnalogInputHandle, status: *mut i32) -> f64;
}
extern "C" {
    #[doc = " Gets a scaled sample from the output of the oversample and average engine for\n the channel.\n\n The value is scaled to units of Volts using the calibrated scaling data from\n GetLSBWeight() and GetOffset(). Using oversampling will cause this value to\n be higher resolution, but it will update more slowly. Using averaging will\n cause this value to be more stable, but it will update more slowly.\n\n @param[in] analogPortHandle Handle to the analog port to use.\n @param[out] status the error code, or 0 for success\n @return A scaled sample from the output of the oversample and average engine\n for the channel."]
    pub fn HAL_GetAnalogAverageVoltage(
        analogPortHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    ) -> f64;
}
extern "C" {
    #[doc = " Gets the factory scaling least significant bit weight constant.\n The least significant bit weight constant for the channel that was calibrated\n in manufacturing and stored in an eeprom in the module.\n\n Volts = ((LSB_Weight * 1e-9) * raw) - (Offset * 1e-9)\n\n @param[in] analogPortHandle Handle to the analog port to use.\n @param[out] status the error code, or 0 for success\n @return Least significant bit weight."]
    pub fn HAL_GetAnalogLSBWeight(analogPortHandle: HAL_AnalogInputHandle, status: *mut i32)
        -> i32;
}
extern "C" {
    #[doc = " Gets the factory scaling offset constant.\n The offset constant for the channel that was calibrated in manufacturing and\n stored in an eeprom in the module.\n\n Volts = ((LSB_Weight * 1e-9) * raw) - (Offset * 1e-9)\n\n @param[in] analogPortHandle Handle to the analog port to use.\n @param[out] status Error status variable. 0 on success.\n @return Offset constant."]
    pub fn HAL_GetAnalogOffset(analogPortHandle: HAL_AnalogInputHandle, status: *mut i32) -> i32;
}
extern "C" {
    #[doc = "  Get the analog voltage from a raw value.\n\n @param[in] analogPortHandle  Handle to the analog port the values were read\n                              from.\n @param[in] rawValue          The raw analog value\n @param[out] status           Error status variable. 0 on success.\n @return The voltage relating to the value"]
    pub fn HAL_GetAnalogValueToVolts(
        analogPortHandle: HAL_AnalogInputHandle,
        rawValue: i32,
        status: *mut i32,
    ) -> f64;
}
extern "C" {
    #[doc = " Initializes the analog output port using the given port object.\n\n @param[in] portHandle handle to the port\n @param[in] allocationLocation the location where the allocation is occurring\n                               (can be null)\n @param[out] status Error status variable. 0 on success.\n @return the created analog output handle"]
    pub fn HAL_InitializeAnalogOutputPort(
        portHandle: HAL_PortHandle,
        allocationLocation: *const ::std::os::raw::c_char,
        status: *mut i32,
    ) -> HAL_AnalogOutputHandle;
}
extern "C" {
    #[doc = " Frees an analog output port.\n\n @param analogOutputHandle the analog output handle"]
    pub fn HAL_FreeAnalogOutputPort(analogOutputHandle: HAL_AnalogOutputHandle);
}
extern "C" {
    #[doc = " Sets an analog output value.\n\n @param[in] analogOutputHandle the analog output handle\n @param[in] voltage            the voltage (0-5v) to output\n @param[out] status            Error status variable. 0 on success."]
    pub fn HAL_SetAnalogOutput(
        analogOutputHandle: HAL_AnalogOutputHandle,
        voltage: f64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Gets the current analog output value.\n\n @param[in] analogOutputHandle the analog output handle\n @param[out] status            Error status variable. 0 on success.\n @return the current output voltage (0-5v)"]
    pub fn HAL_GetAnalogOutput(analogOutputHandle: HAL_AnalogOutputHandle, status: *mut i32)
        -> f64;
}
extern "C" {
    #[doc = " Checks that the analog output channel number is valid.\n\n Verifies that the analog channel number is one of the legal channel numbers.\n Channel numbers are 0-based.\n\n @return Analog channel is valid"]
    pub fn HAL_CheckAnalogOutputChannel(channel: i32) -> HAL_Bool;
}
pub const HAL_AnalogTriggerType_HAL_Trigger_kInWindow: HAL_AnalogTriggerType = 0;
pub const HAL_AnalogTriggerType_HAL_Trigger_kState: HAL_AnalogTriggerType = 1;
pub const HAL_AnalogTriggerType_HAL_Trigger_kRisingPulse: HAL_AnalogTriggerType = 2;
pub const HAL_AnalogTriggerType_HAL_Trigger_kFallingPulse: HAL_AnalogTriggerType = 3;
#[doc = " The type of analog trigger to trigger on."]
pub type HAL_AnalogTriggerType = i32;
extern "C" {
    #[doc = " Initializes an analog trigger.\n\n @param[in] portHandle the analog input to use for triggering\n @param[out] status     Error status variable. 0 on success.\n @return the created analog trigger handle"]
    pub fn HAL_InitializeAnalogTrigger(
        portHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    ) -> HAL_AnalogTriggerHandle;
}
extern "C" {
    #[doc = " Initializes an analog trigger with a Duty Cycle input\n\n @param[in] dutyCycleHandle the analog input to use for duty cycle\n @param[out] status          Error status variable. 0 on success."]
    pub fn HAL_InitializeAnalogTriggerDutyCycle(
        dutyCycleHandle: HAL_DutyCycleHandle,
        status: *mut i32,
    ) -> HAL_AnalogTriggerHandle;
}
extern "C" {
    #[doc = " Frees an analog trigger.\n\n @param[in] analogTriggerHandle the trigger handle\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_CleanAnalogTrigger(analogTriggerHandle: HAL_AnalogTriggerHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Sets the raw ADC upper and lower limits of the analog trigger.\n\n HAL_SetAnalogTriggerLimitsVoltage or HAL_SetAnalogTriggerLimitsDutyCycle\n is likely better in most cases.\n\n @param[in] analogTriggerHandle the trigger handle\n @param[in] lower               the lower ADC value\n @param[in] upper               the upper ADC value\n @param[out] status              Error status variable. 0 on success."]
    pub fn HAL_SetAnalogTriggerLimitsRaw(
        analogTriggerHandle: HAL_AnalogTriggerHandle,
        lower: i32,
        upper: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Sets the upper and lower limits of the analog trigger.\n\n The limits are given as floating point voltage values.\n\n @param[in] analogTriggerHandle the trigger handle\n @param[in] lower               the lower voltage value\n @param[in] upper               the upper voltage value\n @param[out] status              Error status variable. 0 on success."]
    pub fn HAL_SetAnalogTriggerLimitsVoltage(
        analogTriggerHandle: HAL_AnalogTriggerHandle,
        lower: f64,
        upper: f64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Sets the upper and lower limits of the analog trigger.\n\n The limits are given as floating point duty cycle values.\n\n @param[in] analogTriggerHandle the trigger handle\n @param[in] lower               the lower duty cycle value\n @param[in] upper               the upper duty cycle value\n @param[out] status              Error status variable. 0 on success."]
    pub fn HAL_SetAnalogTriggerLimitsDutyCycle(
        analogTriggerHandle: HAL_AnalogTriggerHandle,
        lower: f64,
        upper: f64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Configures the analog trigger to use the averaged vs. raw values.\n\n If the value is true, then the averaged value is selected for the analog\n trigger, otherwise the immediate value is used.\n\n This is not allowed to be used if filtered mode is set.\n This is not allowed to be used with Duty Cycle based inputs.\n\n @param[in] analogTriggerHandle the trigger handle\n @param[in] useAveragedValue    true to use averaged values, false for raw\n @param[out] status              Error status variable. 0 on success."]
    pub fn HAL_SetAnalogTriggerAveraged(
        analogTriggerHandle: HAL_AnalogTriggerHandle,
        useAveragedValue: HAL_Bool,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Configures the analog trigger to use a filtered value.\n\n The analog trigger will operate with a 3 point average rejection filter. This\n is designed to help with 360 degree pot applications for the period where the\n pot crosses through zero.\n\n This is not allowed to be used if averaged mode is set.\n\n @param[in] analogTriggerHandle the trigger handle\n @param[in] useFilteredValue    true to use filtered values, false for average\n                                or raw\n @param[out] status             Error status variable. 0 on success."]
    pub fn HAL_SetAnalogTriggerFiltered(
        analogTriggerHandle: HAL_AnalogTriggerHandle,
        useFilteredValue: HAL_Bool,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Returns the InWindow output of the analog trigger.\n\n True if the analog input is between the upper and lower limits.\n\n @param[in] analogTriggerHandle the trigger handle\n @param[out] status Error status variable. 0 on success.\n @return the InWindow output of the analog trigger"]
    pub fn HAL_GetAnalogTriggerInWindow(
        analogTriggerHandle: HAL_AnalogTriggerHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    #[doc = " Returns the TriggerState output of the analog trigger.\n\n True if above upper limit.\n False if below lower limit.\n If in Hysteresis, maintain previous state.\n\n @param[in] analogTriggerHandle the trigger handle\n @param[out] status              Error status variable. 0 on success.\n @return the TriggerState output of the analog trigger"]
    pub fn HAL_GetAnalogTriggerTriggerState(
        analogTriggerHandle: HAL_AnalogTriggerHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    #[doc = " Gets the state of the analog trigger output.\n\n @param[in] analogTriggerHandle the trigger handle\n @param[in] type                the type of trigger to trigger on\n @param[out] status              Error status variable. 0 on success.\n @return the state of the analog trigger output"]
    pub fn HAL_GetAnalogTriggerOutput(
        analogTriggerHandle: HAL_AnalogTriggerHandle,
        type_: HAL_AnalogTriggerType,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    #[doc = " Get the FPGA index for the AnlogTrigger.\n\n @param[in] analogTriggerHandle the trigger handle\n @param[out] status              Error status variable. 0 on success.\n @return the FPGA index"]
    pub fn HAL_GetAnalogTriggerFPGAIndex(
        analogTriggerHandle: HAL_AnalogTriggerHandle,
        status: *mut i32,
    ) -> i32;
}
#[doc = " Storage for CAN Stream Messages."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HAL_CANStreamMessage {
    pub messageID: u32,
    pub timeStamp: u32,
    pub data: [u8; 8usize],
    pub dataSize: u8,
}
#[test]
fn bindgen_test_layout_HAL_CANStreamMessage() {
    const UNINIT: ::std::mem::MaybeUninit<HAL_CANStreamMessage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<HAL_CANStreamMessage>(),
        20usize,
        concat!("Size of: ", stringify!(HAL_CANStreamMessage))
    );
    assert_eq!(
        ::std::mem::align_of::<HAL_CANStreamMessage>(),
        4usize,
        concat!("Alignment of ", stringify!(HAL_CANStreamMessage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).messageID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_CANStreamMessage),
            "::",
            stringify!(messageID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_CANStreamMessage),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_CANStreamMessage),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataSize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_CANStreamMessage),
            "::",
            stringify!(dataSize)
        )
    );
}
extern "C" {
    #[doc = " Sends a CAN message.\n\n @param[in] messageID the CAN ID to send\n @param[in] data      the data to send (0-8 bytes)\n @param[in] dataSize  the size of the data to send (0-8 bytes)\n @param[in] periodMs  the period to repeat the packet at. Use\n                       HAL_CAN_SEND_PERIOD_NO_REPEAT to not repeat.\n @param[out] status    Error status variable. 0 on success."]
    pub fn HAL_CAN_SendMessage(
        messageID: u32,
        data: *const u8,
        dataSize: u8,
        periodMs: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Receives a CAN message.\n\n @param[out] messageID     store for the received message ID\n @param[in] messageIDMask the message ID mask to look for\n @param[out] data          data output (8 bytes)\n @param[out] dataSize      data length (0-8 bytes)\n @param[out] timeStamp     the packet received timestamp (based off of\n                           CLOCK_MONOTONIC)\n @param[out] status        Error status variable. 0 on success."]
    pub fn HAL_CAN_ReceiveMessage(
        messageID: *mut u32,
        messageIDMask: u32,
        data: *mut u8,
        dataSize: *mut u8,
        timeStamp: *mut u32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Opens a CAN stream.\n\n @param[out] sessionHandle output for the session handle\n @param[in] messageID     the message ID to read\n @param[in] messageIDMask the mssage ID mask\n @param[in] maxMessages   the maximum number of messages to stream\n @param[out] status        Error status variable. 0 on success."]
    pub fn HAL_CAN_OpenStreamSession(
        sessionHandle: *mut u32,
        messageID: u32,
        messageIDMask: u32,
        maxMessages: u32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Closes a CAN stream.\n\n @param sessionHandle the session to close"]
    pub fn HAL_CAN_CloseStreamSession(sessionHandle: u32);
}
extern "C" {
    #[doc = " Reads a CAN stream message.\n\n @param[in] sessionHandle  the session handle\n @param[in] messages       array of messages\n @param[in] messagesToRead the max number of messages to read\n @param[out] messagesRead   the number of messages actually read\n @param[out] status         Error status variable. 0 on success."]
    pub fn HAL_CAN_ReadStreamSession(
        sessionHandle: u32,
        messages: *mut HAL_CANStreamMessage,
        messagesToRead: u32,
        messagesRead: *mut u32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Gets CAN status information.\n\n @param[out] percentBusUtilization the bus utilization\n @param[out] busOffCount           the number of bus off errors\n @param[out] txFullCount           the number of tx full errors\n @param[out] receiveErrorCount     the number of receive errors\n @param[out] transmitErrorCount    the number of transmit errors\n @param[out] status                Error status variable. 0 on success."]
    pub fn HAL_CAN_GetCANStatus(
        percentBusUtilization: *mut f32,
        busOffCount: *mut u32,
        txFullCount: *mut u32,
        receiveErrorCount: *mut u32,
        transmitErrorCount: *mut u32,
        status: *mut i32,
    );
}
pub const HAL_CANDeviceType_HAL_CAN_Dev_kBroadcast: HAL_CANDeviceType = 0;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kRobotController: HAL_CANDeviceType = 1;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kMotorController: HAL_CANDeviceType = 2;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kRelayController: HAL_CANDeviceType = 3;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kGyroSensor: HAL_CANDeviceType = 4;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kAccelerometer: HAL_CANDeviceType = 5;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kUltrasonicSensor: HAL_CANDeviceType = 6;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kGearToothSensor: HAL_CANDeviceType = 7;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kPowerDistribution: HAL_CANDeviceType = 8;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kPneumatics: HAL_CANDeviceType = 9;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kMiscellaneous: HAL_CANDeviceType = 10;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kIOBreakout: HAL_CANDeviceType = 11;
pub const HAL_CANDeviceType_HAL_CAN_Dev_kFirmwareUpdate: HAL_CANDeviceType = 31;
#[doc = " The CAN device type.\n\n Teams should use HAL_CAN_Dev_kMiscellaneous"]
pub type HAL_CANDeviceType = i32;
pub const HAL_CANManufacturer_HAL_CAN_Man_kBroadcast: HAL_CANManufacturer = 0;
pub const HAL_CANManufacturer_HAL_CAN_Man_kNI: HAL_CANManufacturer = 1;
pub const HAL_CANManufacturer_HAL_CAN_Man_kLM: HAL_CANManufacturer = 2;
pub const HAL_CANManufacturer_HAL_CAN_Man_kDEKA: HAL_CANManufacturer = 3;
pub const HAL_CANManufacturer_HAL_CAN_Man_kCTRE: HAL_CANManufacturer = 4;
pub const HAL_CANManufacturer_HAL_CAN_Man_kREV: HAL_CANManufacturer = 5;
pub const HAL_CANManufacturer_HAL_CAN_Man_kGrapple: HAL_CANManufacturer = 6;
pub const HAL_CANManufacturer_HAL_CAN_Man_kMS: HAL_CANManufacturer = 7;
pub const HAL_CANManufacturer_HAL_CAN_Man_kTeamUse: HAL_CANManufacturer = 8;
pub const HAL_CANManufacturer_HAL_CAN_Man_kKauaiLabs: HAL_CANManufacturer = 9;
pub const HAL_CANManufacturer_HAL_CAN_Man_kCopperforge: HAL_CANManufacturer = 10;
pub const HAL_CANManufacturer_HAL_CAN_Man_kPWF: HAL_CANManufacturer = 11;
pub const HAL_CANManufacturer_HAL_CAN_Man_kStudica: HAL_CANManufacturer = 12;
pub const HAL_CANManufacturer_HAL_CAN_Man_kTheThriftyBot: HAL_CANManufacturer = 13;
#[doc = " The CAN manufacturer ID.\n\n Teams should use HAL_CAN_Man_kTeamUse."]
pub type HAL_CANManufacturer = i32;
extern "C" {
    #[doc = " Initializes a CAN device.\n\n These follow the FIRST standard CAN layout.\n https://docs.wpilib.org/en/stable/docs/software/can-devices/can-addressing.html\n\n @param[in] manufacturer the can manufacturer\n @param[in] deviceId     the device ID (0-63)\n @param[in] deviceType   the device type\n @param[out] status      Error status variable. 0 on success.\n @return the created CAN handle"]
    pub fn HAL_InitializeCAN(
        manufacturer: HAL_CANManufacturer,
        deviceId: i32,
        deviceType: HAL_CANDeviceType,
        status: *mut i32,
    ) -> HAL_CANHandle;
}
extern "C" {
    #[doc = " Frees a CAN device\n\n @param handle the CAN handle"]
    pub fn HAL_CleanCAN(handle: HAL_CANHandle);
}
extern "C" {
    #[doc = " Writes a packet to the CAN device with a specific ID.\n\n This ID is 10 bits.\n\n @param[in] handle  the CAN handle\n @param[in] data    the data to write (0-8 bytes)\n @param[in] length  the length of data (0-8)\n @param[in] apiId   the ID to write (0-1023 bits)\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_WriteCANPacket(
        handle: HAL_CANHandle,
        data: *const u8,
        length: i32,
        apiId: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Writes a repeating packet to the CAN device with a specific ID.\n\n This ID is 10 bits.\n\n The RoboRIO will automatically repeat the packet at the specified interval\n\n @param[in] handle   the CAN handle\n @param[in] data     the data to write (0-8 bytes)\n @param[in] length   the length of data (0-8)\n @param[in] apiId    the ID to write (0-1023)\n @param[in] repeatMs the period to repeat in ms\n @param[out] status  Error status variable. 0 on success."]
    pub fn HAL_WriteCANPacketRepeating(
        handle: HAL_CANHandle,
        data: *const u8,
        length: i32,
        apiId: i32,
        repeatMs: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Writes an RTR frame of the specified length to the CAN device with the\n specific ID.\n\n By spec, the length must be equal to the length sent by the other device,\n otherwise behavior is unspecified.\n\n @param[in] handle   the CAN handle\n @param[in] length   the length of data to request (0-8)\n @param[in] apiId    the ID to write (0-1023)\n @param[out] status  Error status variable. 0 on success."]
    pub fn HAL_WriteCANRTRFrame(handle: HAL_CANHandle, length: i32, apiId: i32, status: *mut i32);
}
extern "C" {
    #[doc = " Stops a repeating packet with a specific ID.\n\n This ID is 10 bits.\n\n @param[in] handle  the CAN handle\n @param[in] apiId   the ID to stop repeating (0-1023)\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_StopCANPacketRepeating(handle: HAL_CANHandle, apiId: i32, status: *mut i32);
}
extern "C" {
    #[doc = " Reads a new CAN packet.\n\n This will only return properly once per packet received. Multiple calls\n without receiving another packet will return an error code.\n\n @param[in] handle             the CAN handle\n @param[in] apiId              the ID to read (0-1023)\n @param[out] data              the packet data (8 bytes)\n @param[out] length            the received length (0-8 bytes)\n @param[out] receivedTimestamp the packet received timestamp (based off of\n                               CLOCK_MONOTONIC)\n @param[out] status            Error status variable. 0 on success."]
    pub fn HAL_ReadCANPacketNew(
        handle: HAL_CANHandle,
        apiId: i32,
        data: *mut u8,
        length: *mut i32,
        receivedTimestamp: *mut u64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Reads a CAN packet. The will continuously return the last packet received,\n without accounting for packet age.\n\n @param[in] handle             the CAN handle\n @param[in] apiId              the ID to read (0-1023)\n @param[out] data              the packet data (8 bytes)\n @param[out] length            the received length (0-8 bytes)\n @param[out] receivedTimestamp the packet received timestamp (based off of\n                               CLOCK_MONOTONIC)\n @param[out] status            Error status variable. 0 on success."]
    pub fn HAL_ReadCANPacketLatest(
        handle: HAL_CANHandle,
        apiId: i32,
        data: *mut u8,
        length: *mut i32,
        receivedTimestamp: *mut u64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Reads a CAN packet. The will return the last packet received until the\n packet is older then the requested timeout. Then it will return an error\n code.\n\n @param[in] handle             the CAN handle\n @param[in] apiId              the ID to read (0-1023)\n @param[out] data              the packet data (8 bytes)\n @param[out] length            the received length (0-8 bytes)\n @param[out] receivedTimestamp the packet received timestamp (based off of\n                               CLOCK_MONOTONIC)\n @param[out] timeoutMs         the timeout time for the packet\n @param[out] status            Error status variable. 0 on success."]
    pub fn HAL_ReadCANPacketTimeout(
        handle: HAL_CANHandle,
        apiId: i32,
        data: *mut u8,
        length: *mut i32,
        receivedTimestamp: *mut u64,
        timeoutMs: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Gets the number of FPGA system clock ticks per microsecond.\n\n @return the number of clock ticks per microsecond"]
    pub fn HAL_GetSystemClockTicksPerMicrosecond() -> i32;
}
pub const HAL_Counter_Mode_HAL_Counter_kTwoPulse: HAL_Counter_Mode = 0;
pub const HAL_Counter_Mode_HAL_Counter_kSemiperiod: HAL_Counter_Mode = 1;
pub const HAL_Counter_Mode_HAL_Counter_kPulseLength: HAL_Counter_Mode = 2;
pub const HAL_Counter_Mode_HAL_Counter_kExternalDirection: HAL_Counter_Mode = 3;
#[doc = " The counter mode."]
pub type HAL_Counter_Mode = i32;
extern "C" {
    #[doc = " Initializes a counter.\n\n @param[in] mode    the counter mode\n @param[in] index   the compressor index (output)\n @param[out] status Error status variable. 0 on success.\n @return the created handle"]
    pub fn HAL_InitializeCounter(
        mode: HAL_Counter_Mode,
        index: *mut i32,
        status: *mut i32,
    ) -> HAL_CounterHandle;
}
extern "C" {
    #[doc = " Frees a counter.\n\n @param[in] counterHandle the counter handle\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_FreeCounter(counterHandle: HAL_CounterHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Sets the average sample size of a counter.\n\n @param[in] counterHandle  the counter handle\n @param[in] size           the size of samples to average\n @param[out] status        Error status variable. 0 on success."]
    pub fn HAL_SetCounterAverageSize(counterHandle: HAL_CounterHandle, size: i32, status: *mut i32);
}
extern "C" {
    #[doc = " Sets the source object that causes the counter to count up.\n\n @param[in] counterHandle       the counter handle\n @param[in] digitalSourceHandle the digital source handle (either a\n                                HAL_AnalogTriggerHandle or a\n                                HAL_DigitalHandle)\n @param[in] analogTriggerType   the analog trigger type if the source is an\n                                analog trigger\n @param[out] status             Error status variable. 0 on success."]
    pub fn HAL_SetCounterUpSource(
        counterHandle: HAL_CounterHandle,
        digitalSourceHandle: HAL_Handle,
        analogTriggerType: HAL_AnalogTriggerType,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Sets the up source to either detect rising edges or falling edges.\n\n Note that both are allowed to be set true at the same time without issues.\n\n @param[in] counterHandle  the counter handle\n @param[in] risingEdge     true to trigger on rising\n @param[in] fallingEdge    true to trigger on falling\n @param[out] status        Error status variable. 0 on success."]
    pub fn HAL_SetCounterUpSourceEdge(
        counterHandle: HAL_CounterHandle,
        risingEdge: HAL_Bool,
        fallingEdge: HAL_Bool,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Disables the up counting source to the counter.\n\n @param[in] counterHandle the counter handle\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_ClearCounterUpSource(counterHandle: HAL_CounterHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Sets the source object that causes the counter to count down.\n\n @param[in] counterHandle       the counter handle\n @param[in] digitalSourceHandle the digital source handle (either a\n                                HAL_AnalogTriggerHandle or a\n                                HAL_DigitalHandle)\n @param[in] analogTriggerType   the analog trigger type if the source is an\n                                analog trigger\n @param[out] status             Error status variable. 0 on success."]
    pub fn HAL_SetCounterDownSource(
        counterHandle: HAL_CounterHandle,
        digitalSourceHandle: HAL_Handle,
        analogTriggerType: HAL_AnalogTriggerType,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Sets the down source to either detect rising edges or falling edges.\n Note that both are allowed to be set true at the same time without issues.\n\n @param[in] counterHandle  the counter handle\n @param[in] risingEdge     true to trigger on rising\n @param[in] fallingEdge    true to trigger on falling\n @param[out] status        Error status variable. 0 on success."]
    pub fn HAL_SetCounterDownSourceEdge(
        counterHandle: HAL_CounterHandle,
        risingEdge: HAL_Bool,
        fallingEdge: HAL_Bool,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Disables the down counting source to the counter.\n\n @param[in] counterHandle the counter handle\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_ClearCounterDownSource(counterHandle: HAL_CounterHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Sets standard up / down counting mode on this counter.\n\n Up and down counts are sourced independently from two inputs.\n\n @param[in] counterHandle the counter handle\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_SetCounterUpDownMode(counterHandle: HAL_CounterHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Sets directional counting mode on this counter.\n\n The direction is determined by the B input, with counting happening with the\n A input.\n\n @param[in] counterHandle the counter handle\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_SetCounterExternalDirectionMode(counterHandle: HAL_CounterHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Sets Semi-period mode on this counter.\n\n The counter counts up based on the time the input is triggered. High or Low\n depends on the highSemiPeriod parameter.\n\n @param[in] counterHandle  the counter handle\n @param[in] highSemiPeriod true for counting when the input is high, false for\n                           low\n @param[out] status        Error status variable. 0 on success."]
    pub fn HAL_SetCounterSemiPeriodMode(
        counterHandle: HAL_CounterHandle,
        highSemiPeriod: HAL_Bool,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Configures the counter to count in up or down based on the length of the\n input pulse.\n\n This mode is most useful for direction sensitive gear tooth sensors.\n\n @param[in] counterHandle the counter handle\n @param[in] threshold     The pulse length beyond which the counter counts the\n                          opposite direction (seconds)\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_SetCounterPulseLengthMode(
        counterHandle: HAL_CounterHandle,
        threshold: f64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Gets the Samples to Average which specifies the number of samples of the\n timer to average when calculating the period. Perform averaging to account\n for mechanical imperfections or as oversampling to increase resolution.\n\n @param[in] counterHandle the counter handle\n @param[out] status       Error status variable. 0 on success.\n @return SamplesToAverage The number of samples being averaged (from 1 to 127)"]
    pub fn HAL_GetCounterSamplesToAverage(
        counterHandle: HAL_CounterHandle,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Sets the Samples to Average which specifies the number of samples of the\n timer to average when calculating the period. Perform averaging to account\n for mechanical imperfections or as oversampling to increase resolution.\n\n @param[in] counterHandle    the counter handle\n @param[in] samplesToAverage The number of samples to average from 1 to 127\n @param[out] status          Error status variable. 0 on success."]
    pub fn HAL_SetCounterSamplesToAverage(
        counterHandle: HAL_CounterHandle,
        samplesToAverage: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Resets the Counter to zero.\n\n Sets the counter value to zero. This does not effect the running state of the\n counter, just sets the current value to zero.\n\n @param[in] counterHandle the counter handle\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_ResetCounter(counterHandle: HAL_CounterHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Reads the current counter value.\n\n Reads the value at this instant. It may still be running, so it reflects the\n current value. Next time it is read, it might have a different value.\n\n @param[in] counterHandle the counter handle\n @param[out] status       Error status variable. 0 on success.\n @return the current counter value"]
    pub fn HAL_GetCounter(counterHandle: HAL_CounterHandle, status: *mut i32) -> i32;
}
extern "C" {
    pub fn HAL_GetCounterPeriod(counterHandle: HAL_CounterHandle, status: *mut i32) -> f64;
}
extern "C" {
    #[doc = " Sets the maximum period where the device is still considered \"moving\".\n\n Sets the maximum period where the device is considered moving. This value is\n used to determine the \"stopped\" state of the counter using the\n HAL_GetCounterStopped method.\n\n @param[in] counterHandle the counter handle\n @param[in] maxPeriod     the maximum period where the counted device is\n                          considered moving in seconds\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_SetCounterMaxPeriod(
        counterHandle: HAL_CounterHandle,
        maxPeriod: f64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Selects whether you want to continue updating the event timer output when\n there are no samples captured.\n\n The output of the event timer has a buffer of periods that are averaged and\n posted to a register on the FPGA.  When the timer detects that the event\n source has stopped (based on the MaxPeriod) the buffer of samples to be\n averaged is emptied.\n\n If you enable the update when empty, you will be\n notified of the stopped source and the event time will report 0 samples.\n\n If you disable update when empty, the most recent average will remain on the\n output until a new sample is acquired.\n\n You will never see 0 samples output (except when there have been no events\n since an FPGA reset) and you will likely not see the stopped bit become true\n (since it is updated at the end of an average and there are no samples to\n average).\n\n @param[in] counterHandle the counter handle\n @param[in] enabled       true to enable counter updating with no samples\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_SetCounterUpdateWhenEmpty(
        counterHandle: HAL_CounterHandle,
        enabled: HAL_Bool,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Determines if the clock is stopped.\n\n Determine if the clocked input is stopped based on the MaxPeriod value set\n using the SetMaxPeriod method. If the clock exceeds the MaxPeriod, then the\n device (and counter) are assumed to be stopped and it returns true.\n\n @param[in] counterHandle the counter handle\n @param[out] status       Error status variable. 0 on success.\n @return true if the most recent counter period exceeds the MaxPeriod value\n         set by SetMaxPeriod"]
    pub fn HAL_GetCounterStopped(counterHandle: HAL_CounterHandle, status: *mut i32) -> HAL_Bool;
}
extern "C" {
    #[doc = " Gets the last direction the counter value changed.\n\n @param[in] counterHandle the counter handle\n @param[out] status       Error status variable. 0 on success.\n @return the last direction the counter value changed"]
    pub fn HAL_GetCounterDirection(counterHandle: HAL_CounterHandle, status: *mut i32) -> HAL_Bool;
}
extern "C" {
    #[doc = " Sets the Counter to return reversed sensing on the direction.\n\n This allows counters to change the direction they are counting in the case of\n 1X and 2X quadrature encoding only. Any other counter mode isn't supported.\n\n @param[in] counterHandle    the counter handle\n @param[in] reverseDirection true if the value counted should be negated.\n @param[out] status          Error status variable. 0 on success."]
    pub fn HAL_SetCounterReverseDirection(
        counterHandle: HAL_CounterHandle,
        reverseDirection: HAL_Bool,
        status: *mut i32,
    );
}
extern "C" {
    pub fn HAL_InitializeCTREPCM(
        module: i32,
        allocationLocation: *const ::std::os::raw::c_char,
        status: *mut i32,
    ) -> HAL_CTREPCMHandle;
}
extern "C" {
    pub fn HAL_FreeCTREPCM(handle: HAL_CTREPCMHandle);
}
extern "C" {
    pub fn HAL_CheckCTREPCMSolenoidChannel(channel: i32) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCTREPCMCompressor(handle: HAL_CTREPCMHandle, status: *mut i32) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_SetCTREPCMClosedLoopControl(
        handle: HAL_CTREPCMHandle,
        enabled: HAL_Bool,
        status: *mut i32,
    );
}
extern "C" {
    pub fn HAL_GetCTREPCMClosedLoopControl(handle: HAL_CTREPCMHandle, status: *mut i32)
        -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCTREPCMPressureSwitch(handle: HAL_CTREPCMHandle, status: *mut i32) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCTREPCMCompressorCurrent(handle: HAL_CTREPCMHandle, status: *mut i32) -> f64;
}
extern "C" {
    pub fn HAL_GetCTREPCMCompressorCurrentTooHighFault(
        handle: HAL_CTREPCMHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCTREPCMCompressorCurrentTooHighStickyFault(
        handle: HAL_CTREPCMHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCTREPCMCompressorShortedStickyFault(
        handle: HAL_CTREPCMHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCTREPCMCompressorShortedFault(
        handle: HAL_CTREPCMHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCTREPCMCompressorNotConnectedStickyFault(
        handle: HAL_CTREPCMHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCTREPCMCompressorNotConnectedFault(
        handle: HAL_CTREPCMHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCTREPCMSolenoids(handle: HAL_CTREPCMHandle, status: *mut i32) -> i32;
}
extern "C" {
    pub fn HAL_SetCTREPCMSolenoids(
        handle: HAL_CTREPCMHandle,
        mask: i32,
        values: i32,
        status: *mut i32,
    );
}
extern "C" {
    pub fn HAL_GetCTREPCMSolenoidDisabledList(handle: HAL_CTREPCMHandle, status: *mut i32) -> i32;
}
extern "C" {
    pub fn HAL_GetCTREPCMSolenoidVoltageStickyFault(
        handle: HAL_CTREPCMHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_GetCTREPCMSolenoidVoltageFault(
        handle: HAL_CTREPCMHandle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    pub fn HAL_ClearAllCTREPCMStickyFaults(handle: HAL_CTREPCMHandle, status: *mut i32);
}
extern "C" {
    pub fn HAL_FireCTREPCMOneShot(handle: HAL_CTREPCMHandle, index: i32, status: *mut i32);
}
extern "C" {
    pub fn HAL_SetCTREPCMOneShotDuration(
        handle: HAL_CTREPCMHandle,
        index: i32,
        durMs: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Creates a new instance of a digital port.\n\n @param[in] portHandle         the port handle to create from\n @param[in] input              true for input, false for output\n @param[in] allocationLocation the location where the allocation is occurring\n                               (can be null)\n @param[out] status            Error status variable. 0 on success.\n @return the created digital handle"]
    pub fn HAL_InitializeDIOPort(
        portHandle: HAL_PortHandle,
        input: HAL_Bool,
        allocationLocation: *const ::std::os::raw::c_char,
        status: *mut i32,
    ) -> HAL_DigitalHandle;
}
extern "C" {
    #[doc = " Checks if a DIO channel is valid.\n\n @param channel the channel number to check\n @return true if the channel is correct, otherwise false"]
    pub fn HAL_CheckDIOChannel(channel: i32) -> HAL_Bool;
}
extern "C" {
    #[doc = " Frees a DIO port.\n\n @param dioPortHandle the DIO channel handle"]
    pub fn HAL_FreeDIOPort(dioPortHandle: HAL_DigitalHandle);
}
extern "C" {
    #[doc = " Indicates the DIO channel is used by a simulated device.\n\n @param handle the DIO channel handle\n @param device simulated device handle"]
    pub fn HAL_SetDIOSimDevice(handle: HAL_DigitalHandle, device: HAL_SimDeviceHandle);
}
extern "C" {
    #[doc = " Allocates a DO PWM Generator.\n\n @param[out] status Error status variable. 0 on success.\n @return the allocated digital PWM handle"]
    pub fn HAL_AllocateDigitalPWM(status: *mut i32) -> HAL_DigitalPWMHandle;
}
extern "C" {
    #[doc = " Frees the resource associated with a DO PWM generator.\n\n @param[in] pwmGenerator the digital PWM handle\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_FreeDigitalPWM(pwmGenerator: HAL_DigitalPWMHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Changes the frequency of the DO PWM generator.\n\n The valid range is from 0.6 Hz to 19 kHz.\n\n  The frequency resolution is logarithmic.\n\n @param[in] rate the frequency to output all digital output PWM signals\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_SetDigitalPWMRate(rate: f64, status: *mut i32);
}
extern "C" {
    #[doc = " Configures the duty-cycle of the PWM generator.\n\n @param[in] pwmGenerator the digital PWM handle\n @param[in] dutyCycle    the percent duty cycle to output [0..1]\n @param[out] status      Error status variable. 0 on success."]
    pub fn HAL_SetDigitalPWMDutyCycle(
        pwmGenerator: HAL_DigitalPWMHandle,
        dutyCycle: f64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Configures the digital PWM to be a PPS signal with specified duty cycle.\n\n @param[in] pwmGenerator the digital PWM handle\n @param[in] dutyCycle    the percent duty cycle to output [0..1]\n @param[out] status      Error status variable. 0 on success."]
    pub fn HAL_SetDigitalPWMPPS(
        pwmGenerator: HAL_DigitalPWMHandle,
        dutyCycle: f64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Configures which DO channel the PWM signal is output on.\n\n @param[in] pwmGenerator the digital PWM handle\n @param[in] channel      the channel to output on\n @param[out] status      Error status variable. 0 on success."]
    pub fn HAL_SetDigitalPWMOutputChannel(
        pwmGenerator: HAL_DigitalPWMHandle,
        channel: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Writes a digital value to a DIO channel.\n\n @param[in] dioPortHandle the digital port handle\n @param[in] value         the state to set the digital channel (if it is\n                          configured as an output)\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_SetDIO(dioPortHandle: HAL_DigitalHandle, value: HAL_Bool, status: *mut i32);
}
extern "C" {
    #[doc = " Sets the direction of a DIO channel.\n\n @param[in] dioPortHandle the digital port handle\n @param[in] input         true to set input, false for output\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_SetDIODirection(dioPortHandle: HAL_DigitalHandle, input: HAL_Bool, status: *mut i32);
}
extern "C" {
    #[doc = " Reads a digital value from a DIO channel.\n\n @param[in] dioPortHandle the digital port handle\n @param[out] status       Error status variable. 0 on success.\n @return the state of the specified channel"]
    pub fn HAL_GetDIO(dioPortHandle: HAL_DigitalHandle, status: *mut i32) -> HAL_Bool;
}
extern "C" {
    #[doc = " Reads the direction of a DIO channel.\n\n @param[in] dioPortHandle the digital port handle\n @param[out] status       Error status variable. 0 on success.\n @return true for input, false for output"]
    pub fn HAL_GetDIODirection(dioPortHandle: HAL_DigitalHandle, status: *mut i32) -> HAL_Bool;
}
extern "C" {
    #[doc = " Generates a single digital pulse.\n\n Write a pulse to the specified digital output channel. There can only be a\n single pulse going at any time.\n\n @param[in] dioPortHandle the digital port handle\n @param[in] pulseLengthSeconds   the active length of the pulse (in seconds)\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_Pulse(dioPortHandle: HAL_DigitalHandle, pulseLengthSeconds: f64, status: *mut i32);
}
extern "C" {
    #[doc = " Generates a single digital pulse on multiple channels.\n\n Write a pulse to the channels enabled by the mask. There can only be a\n single pulse going at any time.\n\n @param[in] channelMask the channel mask\n @param[in] pulseLengthSeconds   the active length of the pulse (in seconds)\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_PulseMultiple(channelMask: u32, pulseLengthSeconds: f64, status: *mut i32);
}
extern "C" {
    #[doc = " Checks a DIO line to see if it is currently generating a pulse.\n\n @param[in] dioPortHandle the digital port handle\n @param[out] status Error status variable. 0 on success.\n @return true if a pulse is in progress, otherwise false"]
    pub fn HAL_IsPulsing(dioPortHandle: HAL_DigitalHandle, status: *mut i32) -> HAL_Bool;
}
extern "C" {
    #[doc = " Checks if any DIO line is currently generating a pulse.\n\n @param[out] status Error status variable. 0 on success.\n @return true if a pulse on some line is in progress"]
    pub fn HAL_IsAnyPulsing(status: *mut i32) -> HAL_Bool;
}
extern "C" {
    #[doc = " Writes the filter index from the FPGA.\n\n Set the filter index used to filter out short pulses.\n\n @param[in] dioPortHandle the digital port handle\n @param[in] filterIndex   the filter index (Must be in the range 0 - 3, where\n                          0 means \"none\" and 1 - 3 means filter # filterIndex\n                          - 1)\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_SetFilterSelect(
        dioPortHandle: HAL_DigitalHandle,
        filterIndex: i32,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Reads the filter index from the FPGA.\n\n Gets the filter index used to filter out short pulses.\n\n @param[in] dioPortHandle the digital port handle\n @param[out] status       Error status variable. 0 on success.\n @return filterIndex  the filter index (Must be in the range 0 - 3, where 0\n                      means \"none\" and 1 - 3 means filter # filterIndex - 1)"]
    pub fn HAL_GetFilterSelect(dioPortHandle: HAL_DigitalHandle, status: *mut i32) -> i32;
}
extern "C" {
    #[doc = " Sets the filter period for the specified filter index.\n\n Sets the filter period in FPGA cycles.  Even though there are 2 different\n filter index domains (MXP vs HDR), ignore that distinction for now since it\n compilicates the interface.  That can be changed later.\n\n @param[in] filterIndex the filter index, 0 - 2\n @param[in] value       the number of cycles that the signal must not\n                        transition to be counted as a transition.\n @param[out] status     Error status variable. 0 on success."]
    pub fn HAL_SetFilterPeriod(filterIndex: i32, value: i64, status: *mut i32);
}
extern "C" {
    #[doc = " Gets the filter period for the specified filter index.\n\n Gets the filter period in FPGA cycles.  Even though there are 2 different\n filter index domains (MXP vs HDR), ignore that distinction for now since it\n compilicates the interface.  Set status to NiFpga_Status_SoftwareFault if the\n filter values miss-match.\n\n @param[in] filterIndex the filter index, 0 - 2\n @param[out] status     Error status variable. 0 on success."]
    pub fn HAL_GetFilterPeriod(filterIndex: i32, status: *mut i32) -> i64;
}
pub const HAL_DMAReadStatus_HAL_DMA_OK: HAL_DMAReadStatus = 1;
pub const HAL_DMAReadStatus_HAL_DMA_TIMEOUT: HAL_DMAReadStatus = 2;
pub const HAL_DMAReadStatus_HAL_DMA_ERROR: HAL_DMAReadStatus = 3;
#[doc = " The DMA Read Status."]
pub type HAL_DMAReadStatus = i32;
#[doc = " Buffer for containing all DMA data for a specific sample."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HAL_DMASample {
    pub readBuffer: [u32; 74usize],
    pub channelOffsets: [i32; 22usize],
    pub timeStamp: u64,
    pub captureSize: u32,
    pub triggerChannels: u8,
}
#[test]
fn bindgen_test_layout_HAL_DMASample() {
    const UNINIT: ::std::mem::MaybeUninit<HAL_DMASample> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<HAL_DMASample>(),
        400usize,
        concat!("Size of: ", stringify!(HAL_DMASample))
    );
    assert_eq!(
        ::std::mem::align_of::<HAL_DMASample>(),
        8usize,
        concat!("Alignment of ", stringify!(HAL_DMASample))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readBuffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMASample),
            "::",
            stringify!(readBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channelOffsets) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMASample),
            "::",
            stringify!(channelOffsets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeStamp) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMASample),
            "::",
            stringify!(timeStamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).captureSize) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMASample),
            "::",
            stringify!(captureSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).triggerChannels) as usize - ptr as usize },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(HAL_DMASample),
            "::",
            stringify!(triggerChannels)
        )
    );
}
extern "C" {
    #[doc = " Initializes an object for peforming DMA transfers.\n\n @param[out] status Error status variable. 0 on success.\n @return the created dma handle"]
    pub fn HAL_InitializeDMA(status: *mut i32) -> HAL_DMAHandle;
}
extern "C" {
    #[doc = " Frees a DMA object.\n\n @param handle the dma handle"]
    pub fn HAL_FreeDMA(handle: HAL_DMAHandle);
}
extern "C" {
    #[doc = " Pauses or unpauses a DMA transfer.\n\n This can only be called while DMA is running.\n\n @param[in] handle  the dma handle\n @param[in] pause   true to pause transfers, false to resume.\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_SetDMAPause(handle: HAL_DMAHandle, pause: HAL_Bool, status: *mut i32);
}
extern "C" {
    #[doc = " Sets DMA transfers to occur at a specific timed interval.\n\n This will remove any external triggers. Only timed or external is supported.\n\n Only 1 timed period is supported.\n\n This can only be called if DMA is not started.\n\n @param[in] handle        the dma handle\n @param[in] periodSeconds the period to trigger in seconds\n @param[out] status       Error status variable. 0 on success."]
    pub fn HAL_SetDMATimedTrigger(handle: HAL_DMAHandle, periodSeconds: f64, status: *mut i32);
}
extern "C" {
    #[doc = " Sets DMA transfers to occur at a specific timed interval in FPGA cycles.\n\n This will remove any external triggers. Only timed or external is supported.\n\n Only 1 timed period is supported\n\n The FPGA currently runs at 40 MHz, but this can change.\n HAL_GetSystemClockTicksPerMicrosecond can be used to get a computable value\n for this.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[in] cycles the period to trigger in FPGA cycles\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_SetDMATimedTriggerCycles(handle: HAL_DMAHandle, cycles: u32, status: *mut i32);
}
extern "C" {
    #[doc = " Adds position data for an encoder to be collected by DMA.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[in] encoderHandle the encoder to add\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_AddDMAEncoder(
        handle: HAL_DMAHandle,
        encoderHandle: HAL_EncoderHandle,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Adds timer data for an encoder to be collected by DMA.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[in] encoderHandle the encoder to add\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_AddDMAEncoderPeriod(
        handle: HAL_DMAHandle,
        encoderHandle: HAL_EncoderHandle,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Adds position data for an counter to be collected by DMA.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[in] counterHandle the counter to add\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_AddDMACounter(
        handle: HAL_DMAHandle,
        counterHandle: HAL_CounterHandle,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Adds timer data for an counter to be collected by DMA.\n\n @param[in] handle the dma handle\n @param[in] counterHandle the counter to add\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_AddDMACounterPeriod(
        handle: HAL_DMAHandle,
        counterHandle: HAL_CounterHandle,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Adds a digital source to be collected by DMA.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[in] digitalSourceHandle the digital source to add\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_AddDMADigitalSource(
        handle: HAL_DMAHandle,
        digitalSourceHandle: HAL_Handle,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Adds an analog input to be collected by DMA.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[in] aInHandle the analog input to add\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_AddDMAAnalogInput(
        handle: HAL_DMAHandle,
        aInHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Adds averaged data of an analog input to be collected by DMA.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[in] aInHandle the analog input to add\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_AddDMAAveragedAnalogInput(
        handle: HAL_DMAHandle,
        aInHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Adds acuumulator data of an analog input to be collected by DMA.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[in] aInHandle the analog input to add\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_AddDMAAnalogAccumulator(
        handle: HAL_DMAHandle,
        aInHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Adds a duty cycle input to be collected by DMA.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[in] dutyCycleHandle the duty cycle input to add\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_AddDMADutyCycle(
        handle: HAL_DMAHandle,
        dutyCycleHandle: HAL_DutyCycleHandle,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Sets DMA transfers to occur on an external trigger.\n\n This will remove any timed trigger set. Only timed or external is supported.\n\n Up to 8 external triggers are currently supported.\n\n This can only be called if DMA is not started.\n\n @param[in] handle              the dma handle\n @param[in] digitalSourceHandle the digital source handle (either a\n                                HAL_AnalogTriggerHandle or a\n                                HAL_DigitalHandle)\n @param[in] analogTriggerType   the analog trigger type if the source is an\n                                analog trigger\n @param[in] rising              true to trigger on rising edge\n @param[in] falling             true to trigger on falling edge\n @param[out] status             Error status variable. 0 on success.\n @return the index of the trigger"]
    pub fn HAL_SetDMAExternalTrigger(
        handle: HAL_DMAHandle,
        digitalSourceHandle: HAL_Handle,
        analogTriggerType: HAL_AnalogTriggerType,
        rising: HAL_Bool,
        falling: HAL_Bool,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Clear all sensors from the DMA collection list.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_ClearDMASensors(handle: HAL_DMAHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Clear all external triggers from the DMA trigger list.\n\n This can only be called if DMA is not started.\n\n @param[in] handle the dma handle\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_ClearDMAExternalTriggers(handle: HAL_DMAHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Starts DMA Collection.\n\n @param[in] handle the dma handle\n @param[in] queueDepth the number of objects to be able to queue\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_StartDMA(handle: HAL_DMAHandle, queueDepth: i32, status: *mut i32);
}
extern "C" {
    #[doc = " Stops DMA Collection.\n\n @param[in] handle the dma handle\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_StopDMA(handle: HAL_DMAHandle, status: *mut i32);
}
extern "C" {
    #[doc = " Gets the direct pointer to the DMA object.\n\n This is only to be used if absolute maximum performance is required. This\n will only be valid until the handle is freed.\n\n @param handle the dma handle"]
    pub fn HAL_GetDMADirectPointer(handle: HAL_DMAHandle) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Reads a DMA sample using a direct DMA pointer.\n\n See HAL_ReadDMA for full documentation.\n\n @param[in] dmaPointer     direct DMA pointer\n @param[in] dmaSample      the sample object to place data into\n @param[in] timeoutSeconds the time to wait for data to be queued before\n                           timing out\n @param[in] remainingOut   the number of samples remaining in the queue\n @param[out] status        Error status variable. 0 on success."]
    pub fn HAL_ReadDMADirect(
        dmaPointer: *mut ::std::os::raw::c_void,
        dmaSample: *mut HAL_DMASample,
        timeoutSeconds: f64,
        remainingOut: *mut i32,
        status: *mut i32,
    ) -> HAL_DMAReadStatus;
}
extern "C" {
    #[doc = " Reads a DMA sample from the queue.\n\n\n @param[in] handle         the dma handle\n @param[in] dmaSample      the sample object to place data into\n @param[in] timeoutSeconds the time to wait for data to be queued before\n                           timing out\n @param[in] remainingOut   the number of samples remaining in the queue\n @param[out] status        Error status variable. 0 on success.\n @return the succes result of the sample read"]
    pub fn HAL_ReadDMA(
        handle: HAL_DMAHandle,
        dmaSample: *mut HAL_DMASample,
        timeoutSeconds: f64,
        remainingOut: *mut i32,
        status: *mut i32,
    ) -> HAL_DMAReadStatus;
}
extern "C" {
    #[doc = " Returns the timestamp of the sample.\n This is in the same time domain as HAL_GetFPGATime().\n\n @param[in] dmaSample the sample to read from\n @param[out] status Error status variable. 0 on success.\n @return timestamp in microseconds since FPGA Initialization"]
    pub fn HAL_GetDMASampleTime(dmaSample: *const HAL_DMASample, status: *mut i32) -> u64;
}
extern "C" {
    #[doc = " Returns the raw distance data for an encoder from the sample.\n\n This can be scaled with DistancePerPulse and DecodingScaleFactor to match the\n result of GetDistance()\n\n @param[in] dmaSample the sample to read from\n @param[in] encoderHandle the encoder handle\n @param[out] status Error status variable. 0 on success.\n @return raw encoder ticks"]
    pub fn HAL_GetDMASampleEncoderRaw(
        dmaSample: *const HAL_DMASample,
        encoderHandle: HAL_EncoderHandle,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Returns the distance data for an counter from the sample.\n\n @param[in] dmaSample the sample to read from\n @param[in] counterHandle the counter handle\n @param[out] status Error status variable. 0 on success.\n @return counter ticks"]
    pub fn HAL_GetDMASampleCounter(
        dmaSample: *const HAL_DMASample,
        counterHandle: HAL_CounterHandle,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Returns the raw period data for an encoder from the sample.\n\n This can be scaled with DistancePerPulse and DecodingScaleFactor to match the\n result of GetRate()\n\n @param[in] dmaSample the sample to read from\n @param[in] encoderHandle the encoder handle\n @param[out] status Error status variable. 0 on success.\n @return raw encoder period"]
    pub fn HAL_GetDMASampleEncoderPeriodRaw(
        dmaSample: *const HAL_DMASample,
        encoderHandle: HAL_EncoderHandle,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Returns the period data for an counter from the sample.\n\n @param[in] dmaSample the sample to read from\n @param[in] counterHandle the counter handle\n @param[out] status Error status variable. 0 on success.\n @return counter period"]
    pub fn HAL_GetDMASampleCounterPeriod(
        dmaSample: *const HAL_DMASample,
        counterHandle: HAL_CounterHandle,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Returns the state of a digital source from the sample.\n\n @param[in] dmaSample the sample to read from\n @param[in] dSourceHandle the digital source handle\n @param[out] status Error status variable. 0 on success.\n @return digital source state"]
    pub fn HAL_GetDMASampleDigitalSource(
        dmaSample: *const HAL_DMASample,
        dSourceHandle: HAL_Handle,
        status: *mut i32,
    ) -> HAL_Bool;
}
extern "C" {
    #[doc = " Returns the raw analog data for an analog input from the sample.\n\n This can be scaled with HAL_GetAnalogValueToVolts to match GetVoltage().\n\n @param[in] dmaSample the sample to read from\n @param[in] aInHandle the analog input handle\n @param[out] status Error status variable. 0 on success.\n @return raw analog data"]
    pub fn HAL_GetDMASampleAnalogInputRaw(
        dmaSample: *const HAL_DMASample,
        aInHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Returns the raw averaged analog data for an analog input from the sample.\n\n This can be scaled with HAL_GetAnalogValueToVolts to match\n GetAveragedVoltage().\n\n @param[in] dmaSample the sample to read from\n @param[in] aInHandle the analog input handle\n @param[out] status Error status variable. 0 on success.\n @return raw averaged analog data"]
    pub fn HAL_GetDMASampleAveragedAnalogInputRaw(
        dmaSample: *const HAL_DMASample,
        aInHandle: HAL_AnalogInputHandle,
        status: *mut i32,
    ) -> i32;
}
extern "C" {
    #[doc = " Returns the analog accumulator data for an analog input from the sample.\n\n @param[in] dmaSample the sample to read from\n @param[in] aInHandle the analog input handle\n @param[in] count the accumulator count\n @param[in] value the accumulator value\n @param[out] status Error status variable. 0 on success."]
    pub fn HAL_GetDMASampleAnalogAccumulator(
        dmaSample: *const HAL_DMASample,
        aInHandle: HAL_AnalogInputHandle,
        count: *mut i64,
        value: *mut i64,
        status: *mut i32,
    );
}
extern "C" {
    #[doc = " Returns the raw duty cycle input ratio data from the sample.\n\n Use HAL_GetDutyCycleOutputScaleFactor to scale this to a percentage.\n\n @param[in] dmaSample the sample to read from\n @param[in] dutyCycleHandle the duty cycle handle\n @param[out] status Error status variable. 0 on success.\n @return raw duty cycle input data"]
    pub fn HAL_GetDMASampleDutyCycleOutputRaw(
        dmaSample: *const HAL_DMASample,
        dutyCycleHandle: HAL_DutyCycleHandle,
        status: *mut i32,
    ) -> i32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string {
    pub _address: u8,
}
pub type std_basic_string__Char_alloc_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string__Alloc_traits_impl {
    pub _address: u8,
}
pub type std_basic_string__Alloc_traits_impl__Base = u8;
pub type std_basic_string__Alloc_traits = u8;
pub type std_basic_string_traits_type = u8;
pub type std_basic_string_value_type = u8;
pub type std_basic_string_allocator_type = u8;
pub type std_basic_string_size_type = u8;
pub type std_basic_string_difference_type = u8;
pub type std_basic_string_reference = u8;
pub type std_basic_string_const_reference = u8;
pub type std_basic_string_pointer = u8;
pub type std_basic_string_const_pointer = u8;
pub type std_basic_string_iterator = u8;
pub type std_basic_string_const_iterator = u8;
pub type std_basic_string_const_reverse_iterator = u8;
pub type std_basic_string_reverse_iterator = u8;
pub type std_basic_string___const_iterator = u8;
pub type std_basic_string___sv_type = u8;
pub type std_basic_string__If_sv = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___sv_wrapper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string__Alloc_hider {
    pub _address: u8,
}
pub const std_basic_string__S_local_capacity: std_basic_string__bindgen_ty_1 = 0;
pub type std_basic_string__bindgen_ty_1 = i32;
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub union std_basic_string__bindgen_ty_2 {
    pub _bindgen_opaque_blob: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_initializer_list {
    pub _address: u8,
}
pub type std_initializer_list_value_type = u8;
pub type std_initializer_list_reference = u8;
pub type std_initializer_list_const_reference = u8;
pub type std_initializer_list_size_type = u32;
pub type std_initializer_list_iterator = u8;
pub type std_initializer_list_const_iterator = u8;
pub type std_false_type = u8;
extern "C" {
    #[link_name = "\u{1}_ZNSt45__do_is_implicitly_default_constructible_impl6__testEz"]
    pub fn std___do_is_implicitly_default_constructible_impl___test() -> std_false_type;
}
pub type std_conditional_type = u8;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std___detail__Prime_rehash_policy {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
pub type std___detail__Prime_rehash_policy___has_load_factor = u8;
pub type std___detail__Prime_rehash_policy__State = u32;
#[test]
fn bindgen_test_layout_std___detail__Prime_rehash_policy() {
    assert_eq!(
        ::std::mem::size_of::<std___detail__Prime_rehash_policy>(),
        8usize,
        concat!("Size of: ", stringify!(std___detail__Prime_rehash_policy))
    );
    assert_eq!(
        ::std::mem::align_of::<std___detail__Prime_rehash_policy>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(std___detail__Prime_rehash_policy)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt8__detail20_Prime_rehash_policy11_M_next_bktEj"]
    pub fn std___detail__Prime_rehash_policy__M_next_bkt(
        this: *const std___detail__Prime_rehash_policy,
        __n: usize,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt8__detail20_Prime_rehash_policy14_M_need_rehashEjjj"]
    pub fn std___detail__Prime_rehash_policy__M_need_rehash(
        this: *const std___detail__Prime_rehash_policy,
        __n_bkt: usize,
        __n_elt: usize,
        __n_ins: usize,
    ) -> [u32; 2usize];
}
impl std___detail__Prime_rehash_policy {
    #[inline]
    pub unsafe fn _M_next_bkt(&self, __n: usize) -> usize {
        std___detail__Prime_rehash_policy__M_next_bkt(self, __n)
    }
    #[inline]
    pub unsafe fn _M_need_rehash(
        &self,
        __n_bkt: usize,
        __n_elt: usize,
        __n_ins: usize,
    ) -> [u32; 2usize] {
        std___detail__Prime_rehash_policy__M_need_rehash(self, __n_bkt, __n_elt, __n_ins)
    }
}
pub const std___detail__Prime_rehash_policy__S_growth_factor: usize = 2;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std___detail__List_node_base {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std___detail__List_node_base() {
    assert_eq!(
        ::std::mem::size_of::<std___detail__List_node_base>(),
        8usize,
        concat!("Size of: ", stringify!(std___detail__List_node_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std___detail__List_node_base>(),
        4usize,
        concat!("Alignment of ", stringify!(std___detail__List_node_base))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8__detail15_List_node_base4swapERS0_S1_"]
    pub fn std___detail__List_node_base_swap(
        __x: *mut std___detail__List_node_base,
        __y: *mut std___detail__List_node_base,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8__detail15_List_node_base11_M_transferEPS0_S1_"]
    pub fn std___detail__List_node_base__M_transfer(
        this: *mut std___detail__List_node_base,
        __first: *mut std___detail__List_node_base,
        __last: *mut std___detail__List_node_base,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8__detail15_List_node_base10_M_reverseEv"]
    pub fn std___detail__List_node_base__M_reverse(this: *mut std___detail__List_node_base);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8__detail15_List_node_base7_M_hookEPS0_"]
    pub fn std___detail__List_node_base__M_hook(
        this: *mut std___detail__List_node_base,
        __position: *mut std___detail__List_node_base,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8__detail15_List_node_base9_M_unhookEv"]
    pub fn std___detail__List_node_base__M_unhook(this: *mut std___detail__List_node_base);
}
impl std___detail__List_node_base {
    #[inline]
    pub unsafe fn swap(
        __x: *mut std___detail__List_node_base,
        __y: *mut std___detail__List_node_base,
    ) {
        std___detail__List_node_base_swap(__x, __y)
    }
    #[inline]
    pub unsafe fn _M_transfer(
        &mut self,
        __first: *mut std___detail__List_node_base,
        __last: *mut std___detail__List_node_base,
    ) {
        std___detail__List_node_base__M_transfer(self, __first, __last)
    }
    #[inline]
    pub unsafe fn _M_reverse(&mut self) {
        std___detail__List_node_base__M_reverse(self)
    }
    #[inline]
    pub unsafe fn _M_hook(&mut self, __position: *mut std___detail__List_node_base) {
        std___detail__List_node_base__M_hook(self, __position)
    }
    #[inline]
    pub unsafe fn _M_unhook(&mut self) {
        std___detail__List_node_base__M_unhook(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6ranges12__cust_imove9iter_moveEv"]
    pub fn std_ranges___cust_imove_iter_move();
}
extern "C" {
    #[link_name = "\u{1}_ZSt21__throw_bad_exceptionv"]
    pub fn std___throw_bad_exception() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt17__throw_bad_allocv"]
    pub fn std___throw_bad_alloc() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt28__throw_bad_array_new_lengthv"]
    pub fn std___throw_bad_array_new_length() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt16__throw_bad_castv"]
    pub fn std___throw_bad_cast() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt18__throw_bad_typeidv"]
    pub fn std___throw_bad_typeid() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt19__throw_logic_errorPKc"]
    pub fn std___throw_logic_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20__throw_domain_errorPKc"]
    pub fn std___throw_domain_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt24__throw_invalid_argumentPKc"]
    pub fn std___throw_invalid_argument(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20__throw_length_errorPKc"]
    pub fn std___throw_length_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20__throw_out_of_rangePKc"]
    pub fn std___throw_out_of_range(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt24__throw_out_of_range_fmtPKcz"]
    pub fn std___throw_out_of_range_fmt(arg1: *const ::std::os::raw::c_char, ...) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt21__throw_runtime_errorPKc"]
    pub fn std___throw_runtime_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt19__throw_range_errorPKc"]
    pub fn std___throw_range_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt22__throw_overflow_errorPKc"]
    pub fn std___throw_overflow_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt23__throw_underflow_errorPKc"]
    pub fn std___throw_underflow_error(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt19__throw_ios_failurePKc"]
    pub fn std___throw_ios_failure(arg1: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt19__throw_ios_failurePKci"]
    pub fn std___throw_ios_failure1(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20__throw_system_errori"]
    pub fn std___throw_system_error(arg1: ::std::os::raw::c_int) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20__throw_future_errori"]
    pub fn std___throw_future_error(arg1: ::std::os::raw::c_int) -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt25__throw_bad_function_callv"]
    pub fn std___throw_bad_function_call() -> !;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair {
    pub _address: u8,
}
pub type std_pair_first_type = u8;
pub type std_pair_second_type = u8;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_forward_iterator_tag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_forward_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_forward_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_forward_iterator_tag))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_bidirectional_iterator_tag {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_bidirectional_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_bidirectional_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_bidirectional_iterator_tag))
    );
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_exception {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_exception>(),
        4usize,
        concat!("Size of: ", stringify!(std_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_exception>(),
        4usize,
        concat!("Alignment of ", stringify!(std_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt9exceptionD1Ev"]
    pub fn std_exception_exception_destructor(this: *mut std_exception);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9exception4whatEv"]
    pub fn std_exception_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_alloc {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_bad_alloc() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_alloc>(),
        4usize,
        concat!("Size of: ", stringify!(std_bad_alloc))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_alloc>(),
        4usize,
        concat!("Alignment of ", stringify!(std_bad_alloc))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt9bad_allocD1Ev"]
    pub fn std_bad_alloc_bad_alloc_destructor(this: *mut std_bad_alloc);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9bad_alloc4whatEv"]
    pub fn std_bad_alloc_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_array_new_length {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_bad_array_new_length() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_array_new_length>(),
        4usize,
        concat!("Size of: ", stringify!(std_bad_array_new_length))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_array_new_length>(),
        4usize,
        concat!("Alignment of ", stringify!(std_bad_array_new_length))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt20bad_array_new_lengthD1Ev"]
    pub fn std_bad_array_new_length_bad_array_new_length_destructor(
        this: *mut std_bad_array_new_length,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt20bad_array_new_length4whatEv"]
    pub fn std_bad_array_new_length_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
pub type std_new_handler = u32;
extern "C" {
    #[link_name = "\u{1}_ZSt15set_new_handlerPFvvE"]
    pub fn std_set_new_handler(arg1: std_new_handler) -> std_new_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt15get_new_handlerv"]
    pub fn std_get_new_handler() -> std_new_handler;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reverse_iterator {
    pub _address: u8,
}
pub type std_reverse_iterator___traits_type = u8;
pub type std_reverse_iterator_iterator_type = u8;
pub type std_reverse_iterator_pointer = u8;
pub type std_reverse_iterator_iterator_concept = u8;
pub type std_reverse_iterator_iterator_category = u8;
pub type std_reverse_iterator_value_type = u8;
pub type std_reverse_iterator_difference_type = u8;
pub type std_reverse_iterator_reference = u8;
pub type std_array_value_type = u8;
pub type std_array_pointer = u8;
pub type std_array_const_pointer = u8;
pub type std_array_reference = u8;
pub type std_array_const_reference = u8;
pub type std_array_iterator = u8;
pub type std_array_const_iterator = u8;
pub type std_array_size_type = u32;
pub type std_array_difference_type = u32;
pub type std_array_reverse_iterator = u8;
pub type std_array_const_reverse_iterator = u8;
pub type std_array__AT_Type = u8;
pub type std_span___is_compatible_array = u8;
pub type std_span___is_compatible_ref = u8;
pub type std_span_element_type = u8;
pub type std_span_value_type = u8;
pub type std_span_size_type = u32;
pub type std_span_difference_type = u32;
pub type std_span_pointer = u8;
pub type std_span_const_pointer = u8;
pub type std_span_reference = u8;
pub type std_span_const_reference = u8;
pub type std_span_iterator = u8;
pub type std_span_reverse_iterator = u8;
pub type std_string = [u32; 6usize];
pub type std_streamsize = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_char_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator {
    pub _address: u8,
}
pub type std_allocator_value_type = u8;
pub type std_allocator_size_type = u32;
pub type std_allocator_difference_type = u32;
pub type std_allocator_propagate_on_container_move_assignment = u8;
pub type std_allocator_is_always_equal = u8;
pub type std___c_locale = u32;
pub type std_istream = [u32; 36usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZSt11_Hash_bytesPKvjj"]
    pub fn std__Hash_bytes(
        __ptr: *const ::std::os::raw::c_void,
        __len: usize,
        __seed: usize,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}_ZSt15_Fnv_hash_bytesPKvjj"]
    pub fn std__Fnv_hash_bytes(
        __ptr: *const ::std::os::raw::c_void,
        __len: usize,
        __seed: usize,
    ) -> usize;
}
pub type std_string_view = [u32; 2usize];
extern "C" {
    #[link_name = "\u{1}_ZSt7getlineIcSt11char_traitsIcESaIcEERSt13basic_istreamIT_T0_ES7_RNSt7__cxx1112basic_stringIS4_S5_T1_EES4_"]
    pub fn std_getline(
        __in: *mut [u32; 36usize],
        __str: *mut [u32; 6usize],
        __delim: ::std::os::raw::c_char,
    ) -> *mut [u32; 36usize];
}
extern "C" {
    #[link_name = "\u{1}_ZSt7getlineIwSt11char_traitsIwESaIwEERSt13basic_istreamIT_T0_ES7_RNSt7__cxx1112basic_stringIS4_S5_T1_EES4_"]
    pub fn std_getline1(
        __in: *mut [u32; 37usize],
        __str: *mut [u32; 6usize],
        __delim: u32,
    ) -> *mut [u32; 37usize];
}
extern "C" {
    #[link_name = "\u{1}num"]
    pub static std_ratio_num: ::std::os::raw::c_longlong;
}
extern "C" {
    #[link_name = "\u{1}den"]
    pub static std_ratio_den: ::std::os::raw::c_longlong;
}
pub type std_ratio_multiply = u8;
pub type std_ratio_add = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_duration {
    pub _address: u8,
}
pub type std_chrono_duration___is_float = u8;
pub type std_chrono_duration___divide = u8;
pub type std_chrono_duration___is_harmonic = u8;
pub type std_chrono_duration_rep = u8;
pub type std_chrono_duration_period = u8;
pub type std_chrono_nanoseconds = u64;
pub type std_chrono_microseconds = u64;
pub type std_chrono_milliseconds = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chrono_time_point {
    pub _address: u8,
}
pub type std_chrono_time_point_clock = u8;
pub type std_chrono_time_point_duration = u8;
pub type std_chrono_time_point_rep = u8;
pub type std_chrono_time_point_period = u8;
pub type std_chrono_system_clock_time_point = u64;
extern "C" {
    #[link_name = "\u{1}_ZNSt6chrono3_V212system_clock3nowEv"]
    pub fn std_chrono_system_clock_now() -> std_chrono_system_clock_time_point;
}
pub type std_chrono_steady_clock_time_point = u64;
extern "C" {
    #[link_name = "\u{1}_ZNSt6chrono3_V212steady_clock3nowEv"]
    pub fn std_chrono_steady_clock_now() -> std_chrono_steady_clock_time_point;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_exception {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_bad_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_exception>(),
        4usize,
        concat!("Size of: ", stringify!(std_bad_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_exception>(),
        4usize,
        concat!("Alignment of ", stringify!(std_bad_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13bad_exceptionD1Ev"]
    pub fn std_bad_exception_bad_exception_destructor(this: *mut std_bad_exception);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt13bad_exception4whatEv"]
    pub fn std_bad_exception_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
pub type std_terminate_handler = u32;
extern "C" {
    #[link_name = "\u{1}_ZSt13set_terminatePFvvE"]
    pub fn std_set_terminate(arg1: std_terminate_handler) -> std_terminate_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt13get_terminatev"]
    pub fn std_get_terminate() -> std_terminate_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt9terminatev"]
    pub fn std_terminate() -> !;
}
pub type std_unexpected_handler = u32;
extern "C" {
    #[link_name = "\u{1}_ZSt14set_unexpectedPFvvE"]
    pub fn std_set_unexpected(arg1: std_unexpected_handler) -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt14get_unexpectedv"]
    pub fn std_get_unexpected() -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt10unexpectedv"]
    pub fn std_unexpected() -> !;
}
extern "C" {
    #[link_name = "\u{1}_ZSt18uncaught_exceptionv"]
    pub fn std_uncaught_exception() -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZSt19uncaught_exceptionsv"]
    pub fn std_uncaught_exceptions() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_type_info {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_type_info() {
    assert_eq!(
        ::std::mem::size_of::<std_type_info>(),
        8usize,
        concat!("Size of: ", stringify!(std_type_info))
    );
    assert_eq!(
        ::std::mem::align_of::<std_type_info>(),
        4usize,
        concat!("Alignment of ", stringify!(std_type_info))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt9type_infoD1Ev"]
    pub fn std_type_info_type_info_destructor(this: *mut std_type_info);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9type_info14__is_pointer_pEv"]
    pub fn std_type_info___is_pointer_p(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9type_info15__is_function_pEv"]
    pub fn std_type_info___is_function_p(this: *mut ::std::os::raw::c_void) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9type_info10__do_catchEPKS_PPvj"]
    pub fn std_type_info___do_catch(
        this: *mut ::std::os::raw::c_void,
        __thr_type: *const std_type_info,
        __thr_obj: *mut *mut ::std::os::raw::c_void,
        __outer: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9type_info11__do_upcastEPKN10__cxxabiv117__class_type_infoEPPv"]
    pub fn std_type_info___do_upcast(
        this: *mut ::std::os::raw::c_void,
        __target: *const __cxxabiv1___class_type_info,
        __obj_ptr: *mut *mut ::std::os::raw::c_void,
    ) -> bool;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_cast {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_bad_cast() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_cast>(),
        4usize,
        concat!("Size of: ", stringify!(std_bad_cast))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_cast>(),
        4usize,
        concat!("Alignment of ", stringify!(std_bad_cast))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8bad_castD1Ev"]
    pub fn std_bad_cast_bad_cast_destructor(this: *mut std_bad_cast);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt8bad_cast4whatEv"]
    pub fn std_bad_cast_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_typeid {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_bad_typeid() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_typeid>(),
        4usize,
        concat!("Size of: ", stringify!(std_bad_typeid))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_typeid>(),
        4usize,
        concat!("Alignment of ", stringify!(std_bad_typeid))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt10bad_typeidD1Ev"]
    pub fn std_bad_typeid_bad_typeid_destructor(this: *mut std_bad_typeid);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt10bad_typeid4whatEv"]
    pub fn std_bad_typeid_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std___exception_ptr_exception_ptr {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std___exception_ptr_exception_ptr() {
    assert_eq!(
        ::std::mem::size_of::<std___exception_ptr_exception_ptr>(),
        4usize,
        concat!("Size of: ", stringify!(std___exception_ptr_exception_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<std___exception_ptr_exception_ptr>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(std___exception_ptr_exception_ptr)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv"]
    pub fn std___exception_ptr_exception_ptr___cxa_exception_type(
        this: *const std___exception_ptr_exception_ptr,
    ) -> *const std_type_info;
}
impl std___exception_ptr_exception_ptr {
    #[inline]
    pub unsafe fn __cxa_exception_type(&self) -> *const std_type_info {
        std___exception_ptr_exception_ptr___cxa_exception_type(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZSt17current_exceptionv"]
    pub fn std_current_exception() -> std___exception_ptr_exception_ptr;
}
extern "C" {
    #[link_name = "\u{1}_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE"]
    pub fn std_rethrow_exception(arg1: std___exception_ptr_exception_ptr) -> !;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_nested_exception {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_nested_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_nested_exception>(),
        8usize,
        concat!("Size of: ", stringify!(std_nested_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_nested_exception>(),
        4usize,
        concat!("Alignment of ", stringify!(std_nested_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt16nested_exceptionD1Ev"]
    pub fn std_nested_exception_nested_exception_destructor(this: *mut std_nested_exception);
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_locale {
    pub _bindgen_opaque_blob: u32,
}
pub type std_locale_category = u32;
pub const std_locale__S_categories_size: std_locale__bindgen_ty_1 = 12;
pub type std_locale__bindgen_ty_1 = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_std_locale() {
    assert_eq!(
        ::std::mem::size_of::<std_locale>(),
        4usize,
        concat!("Size of: ", stringify!(std_locale))
    );
    assert_eq!(
        ::std::mem::align_of::<std_locale>(),
        4usize,
        concat!("Alignment of ", stringify!(std_locale))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt6locale4nameB5cxx11Ev"]
    pub fn std_locale_name(this: *const std_locale) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale6globalERKS_"]
    pub fn std_locale_global(__loc: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale7classicEv"]
    pub fn std_locale_classic() -> *const std_locale;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6localeC1Ev"]
    pub fn std_locale_locale(this: *mut std_locale);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6localeC1ERKS_"]
    pub fn std_locale_locale1(this: *mut std_locale, __other: *const std_locale);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6localeC1EPKc"]
    pub fn std_locale_locale2(this: *mut std_locale, __s: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6localeC1ERKS_PKci"]
    pub fn std_locale_locale3(
        this: *mut std_locale,
        __base: *const std_locale,
        __s: *const ::std::os::raw::c_char,
        __cat: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6localeC1ERKS_S1_i"]
    pub fn std_locale_locale4(
        this: *mut std_locale,
        __base: *const std_locale,
        __add: *const std_locale,
        __cat: std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6localeD1Ev"]
    pub fn std_locale_locale_destructor(this: *mut std_locale);
}
impl std_locale {
    #[inline]
    pub unsafe fn name(&self) -> std_string {
        std_locale_name(self)
    }
    #[inline]
    pub unsafe fn global(__loc: *const std_locale) -> std_locale {
        std_locale_global(__loc)
    }
    #[inline]
    pub unsafe fn classic() -> *const std_locale {
        std_locale_classic()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(__other: *const std_locale) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale1(__bindgen_tmp.as_mut_ptr(), __other);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(__s: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale2(__bindgen_tmp.as_mut_ptr(), __s);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(
        __base: *const std_locale,
        __s: *const ::std::os::raw::c_char,
        __cat: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale3(__bindgen_tmp.as_mut_ptr(), __base, __s, __cat);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(
        __base: *const std_locale,
        __add: *const std_locale,
        __cat: std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_locale_locale4(__bindgen_tmp.as_mut_ptr(), __base, __add, __cat);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_locale_locale_destructor(self)
    }
}
pub const std_locale_none: std_locale_category = 0;
pub const std_locale_ctype: std_locale_category = 1;
pub const std_locale_numeric: std_locale_category = 2;
pub const std_locale_collate: std_locale_category = 4;
pub const std_locale_time: std_locale_category = 8;
pub const std_locale_monetary: std_locale_category = 16;
pub const std_locale_messages: std_locale_category = 32;
pub const std_locale_all: std_locale_category = 63;
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale10_S_classicE"]
    pub static mut std_locale__S_classic: *mut std_locale__Impl;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale9_S_globalE"]
    pub static mut std_locale__S_global: *mut std_locale__Impl;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale13_S_categoriesE"]
    pub static std_locale__S_categories: *const *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale7_S_onceE"]
    pub static mut std_locale__S_once: __gthread_once_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale17_S_twinned_facetsE"]
    pub static std_locale__S_twinned_facets: [*const std_locale_id; 0usize];
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_locale_facet {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_locale_facet___shim {
    _unused: [u8; 0],
}
#[test]
fn bindgen_test_layout_std_locale_facet() {
    assert_eq!(
        ::std::mem::size_of::<std_locale_facet>(),
        8usize,
        concat!("Size of: ", stringify!(std_locale_facet))
    );
    assert_eq!(
        ::std::mem::align_of::<std_locale_facet>(),
        4usize,
        concat!("Alignment of ", stringify!(std_locale_facet))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5facet18_S_create_c_localeERP15__locale_structPKcS2_"]
    pub fn std_locale_facet__S_create_c_locale(
        __cloc: *mut std___c_locale,
        __s: *const ::std::os::raw::c_char,
        __old: std___c_locale,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5facet17_S_clone_c_localeERP15__locale_struct"]
    pub fn std_locale_facet__S_clone_c_locale(__cloc: *mut std___c_locale) -> std___c_locale;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5facet19_S_destroy_c_localeERP15__locale_struct"]
    pub fn std_locale_facet__S_destroy_c_locale(__cloc: *mut std___c_locale);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5facet20_S_lc_ctype_c_localeEP15__locale_structPKc"]
    pub fn std_locale_facet__S_lc_ctype_c_locale(
        __cloc: std___c_locale,
        __s: *const ::std::os::raw::c_char,
    ) -> std___c_locale;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5facet15_S_get_c_localeEv"]
    pub fn std_locale_facet__S_get_c_locale() -> std___c_locale;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5facet13_S_get_c_nameEv"]
    pub fn std_locale_facet__S_get_c_name() -> *const ::std::os::raw::c_char;
}
impl std_locale_facet {
    #[inline]
    pub unsafe fn _S_create_c_locale(
        __cloc: *mut std___c_locale,
        __s: *const ::std::os::raw::c_char,
        __old: std___c_locale,
    ) {
        std_locale_facet__S_create_c_locale(__cloc, __s, __old)
    }
    #[inline]
    pub unsafe fn _S_clone_c_locale(__cloc: *mut std___c_locale) -> std___c_locale {
        std_locale_facet__S_clone_c_locale(__cloc)
    }
    #[inline]
    pub unsafe fn _S_destroy_c_locale(__cloc: *mut std___c_locale) {
        std_locale_facet__S_destroy_c_locale(__cloc)
    }
    #[inline]
    pub unsafe fn _S_lc_ctype_c_locale(
        __cloc: std___c_locale,
        __s: *const ::std::os::raw::c_char,
    ) -> std___c_locale {
        std_locale_facet__S_lc_ctype_c_locale(__cloc, __s)
    }
    #[inline]
    pub unsafe fn _S_get_c_locale() -> std___c_locale {
        std_locale_facet__S_get_c_locale()
    }
    #[inline]
    pub unsafe fn _S_get_c_name() -> *const ::std::os::raw::c_char {
        std_locale_facet__S_get_c_name()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5facet11_S_c_localeE"]
    pub static mut std_locale_facet__S_c_locale: std___c_locale;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5facet9_S_c_nameE"]
    pub static std_locale_facet__S_c_name: [::std::os::raw::c_char; 2usize];
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5facet7_S_onceE"]
    pub static mut std_locale_facet__S_once: __gthread_once_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5facetD1Ev"]
    pub fn std_locale_facet_facet_destructor(this: *mut std_locale_facet);
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_locale_id {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_locale_id() {
    assert_eq!(
        ::std::mem::size_of::<std_locale_id>(),
        4usize,
        concat!("Size of: ", stringify!(std_locale_id))
    );
    assert_eq!(
        ::std::mem::align_of::<std_locale_id>(),
        4usize,
        concat!("Alignment of ", stringify!(std_locale_id))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt6locale2id5_M_idEv"]
    pub fn std_locale_id__M_id(this: *const std_locale_id) -> usize;
}
impl std_locale_id {
    #[inline]
    pub unsafe fn _M_id(&self) -> usize {
        std_locale_id__M_id(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale2id11_S_refcountE"]
    pub static mut std_locale_id__S_refcount: _Atomic_word;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_locale__Impl {
    pub _bindgen_opaque_blob: [u32; 5usize],
}
#[test]
fn bindgen_test_layout_std_locale__Impl() {
    assert_eq!(
        ::std::mem::size_of::<std_locale__Impl>(),
        20usize,
        concat!("Size of: ", stringify!(std_locale__Impl))
    );
    assert_eq!(
        ::std::mem::align_of::<std_locale__Impl>(),
        4usize,
        concat!("Alignment of ", stringify!(std_locale__Impl))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5_Impl11_S_id_ctypeE"]
    pub static std_locale__Impl__S_id_ctype: [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5_Impl13_S_id_numericE"]
    pub static std_locale__Impl__S_id_numeric: [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5_Impl13_S_id_collateE"]
    pub static std_locale__Impl__S_id_collate: [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5_Impl10_S_id_timeE"]
    pub static std_locale__Impl__S_id_time: [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5_Impl14_S_id_monetaryE"]
    pub static std_locale__Impl__S_id_monetary: [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5_Impl14_S_id_messagesE"]
    pub static std_locale__Impl__S_id_messages: [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6locale5_Impl19_S_facet_categoriesE"]
    pub static std_locale__Impl__S_facet_categories: [*const *const std_locale_id; 0usize];
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std___cow_string {
    pub _bindgen_opaque_blob: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub union std___cow_string__bindgen_ty_1 {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std___cow_string__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<std___cow_string__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(std___cow_string__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<std___cow_string__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(std___cow_string__bindgen_ty_1))
    );
}
#[test]
fn bindgen_test_layout_std___cow_string() {
    assert_eq!(
        ::std::mem::size_of::<std___cow_string>(),
        4usize,
        concat!("Size of: ", stringify!(std___cow_string))
    );
    assert_eq!(
        ::std::mem::align_of::<std___cow_string>(),
        4usize,
        concat!("Alignment of ", stringify!(std___cow_string))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringC1Ev"]
    pub fn std___cow_string___cow_string(this: *mut std___cow_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std___cow_string___cow_string1(this: *mut std___cow_string, arg1: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringC1EPKcj"]
    pub fn std___cow_string___cow_string2(
        this: *mut std___cow_string,
        arg1: *const ::std::os::raw::c_char,
        arg2: usize,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringC1ERKS_"]
    pub fn std___cow_string___cow_string3(
        this: *mut std___cow_string,
        arg1: *const std___cow_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringC1EOS_"]
    pub fn std___cow_string___cow_string4(this: *mut std___cow_string, arg1: *mut std___cow_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12__cow_stringD1Ev"]
    pub fn std___cow_string___cow_string_destructor(this: *mut std___cow_string);
}
impl std___cow_string {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___cow_string___cow_string(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___cow_string___cow_string1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *const ::std::os::raw::c_char, arg2: usize) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___cow_string___cow_string2(__bindgen_tmp.as_mut_ptr(), arg1, arg2);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(arg1: *const std___cow_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___cow_string___cow_string3(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(arg1: *mut std___cow_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std___cow_string___cow_string4(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std___cow_string___cow_string_destructor(self)
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_logic_error {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_logic_error() {
    assert_eq!(
        ::std::mem::size_of::<std_logic_error>(),
        8usize,
        concat!("Size of: ", stringify!(std_logic_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_logic_error>(),
        4usize,
        concat!("Alignment of ", stringify!(std_logic_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11logic_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_logic_error_logic_error(this: *mut std_logic_error, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11logic_errorC1EPKc"]
    pub fn std_logic_error_logic_error1(
        this: *mut std_logic_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11logic_errorC1EOS_"]
    pub fn std_logic_error_logic_error2(this: *mut std_logic_error, arg1: *mut std_logic_error);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11logic_errorC1ERKS_"]
    pub fn std_logic_error_logic_error3(this: *mut std_logic_error, arg1: *const std_logic_error);
}
impl std_logic_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *mut std_logic_error) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error2(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(arg1: *const std_logic_error) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_logic_error_logic_error3(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11logic_errorD1Ev"]
    pub fn std_logic_error_logic_error_destructor(this: *mut std_logic_error);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt11logic_error4whatEv"]
    pub fn std_logic_error_what(this: *mut ::std::os::raw::c_void)
        -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_domain_error {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_domain_error() {
    assert_eq!(
        ::std::mem::size_of::<std_domain_error>(),
        8usize,
        concat!("Size of: ", stringify!(std_domain_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_domain_error>(),
        4usize,
        concat!("Alignment of ", stringify!(std_domain_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12domain_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_domain_error_domain_error(this: *mut std_domain_error, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12domain_errorC1EPKc"]
    pub fn std_domain_error_domain_error1(
        this: *mut std_domain_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_domain_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_domain_error_domain_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_domain_error_domain_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12domain_errorD1Ev"]
    pub fn std_domain_error_domain_error_destructor(this: *mut std_domain_error);
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_invalid_argument {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_invalid_argument() {
    assert_eq!(
        ::std::mem::size_of::<std_invalid_argument>(),
        8usize,
        concat!("Size of: ", stringify!(std_invalid_argument))
    );
    assert_eq!(
        ::std::mem::align_of::<std_invalid_argument>(),
        4usize,
        concat!("Alignment of ", stringify!(std_invalid_argument))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt16invalid_argumentC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_invalid_argument_invalid_argument(
        this: *mut std_invalid_argument,
        __arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt16invalid_argumentC1EPKc"]
    pub fn std_invalid_argument_invalid_argument1(
        this: *mut std_invalid_argument,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_invalid_argument {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_invalid_argument_invalid_argument(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_invalid_argument_invalid_argument1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt16invalid_argumentD1Ev"]
    pub fn std_invalid_argument_invalid_argument_destructor(this: *mut std_invalid_argument);
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_length_error {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_length_error() {
    assert_eq!(
        ::std::mem::size_of::<std_length_error>(),
        8usize,
        concat!("Size of: ", stringify!(std_length_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_length_error>(),
        4usize,
        concat!("Alignment of ", stringify!(std_length_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12length_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_length_error_length_error(this: *mut std_length_error, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12length_errorC1EPKc"]
    pub fn std_length_error_length_error1(
        this: *mut std_length_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_length_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_length_error_length_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_length_error_length_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12length_errorD1Ev"]
    pub fn std_length_error_length_error_destructor(this: *mut std_length_error);
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_out_of_range {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_out_of_range() {
    assert_eq!(
        ::std::mem::size_of::<std_out_of_range>(),
        8usize,
        concat!("Size of: ", stringify!(std_out_of_range))
    );
    assert_eq!(
        ::std::mem::align_of::<std_out_of_range>(),
        4usize,
        concat!("Alignment of ", stringify!(std_out_of_range))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12out_of_rangeC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_out_of_range_out_of_range(this: *mut std_out_of_range, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12out_of_rangeC1EPKc"]
    pub fn std_out_of_range_out_of_range1(
        this: *mut std_out_of_range,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_out_of_range {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_out_of_range_out_of_range(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_out_of_range_out_of_range1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12out_of_rangeD1Ev"]
    pub fn std_out_of_range_out_of_range_destructor(this: *mut std_out_of_range);
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_runtime_error {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_runtime_error() {
    assert_eq!(
        ::std::mem::size_of::<std_runtime_error>(),
        8usize,
        concat!("Size of: ", stringify!(std_runtime_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_runtime_error>(),
        4usize,
        concat!("Alignment of ", stringify!(std_runtime_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13runtime_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_runtime_error_runtime_error(this: *mut std_runtime_error, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13runtime_errorC1EPKc"]
    pub fn std_runtime_error_runtime_error1(
        this: *mut std_runtime_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13runtime_errorC1EOS_"]
    pub fn std_runtime_error_runtime_error2(
        this: *mut std_runtime_error,
        arg1: *mut std_runtime_error,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13runtime_errorC1ERKS_"]
    pub fn std_runtime_error_runtime_error3(
        this: *mut std_runtime_error,
        arg1: *const std_runtime_error,
    );
}
impl std_runtime_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_runtime_error_runtime_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_runtime_error_runtime_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *mut std_runtime_error) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_runtime_error_runtime_error2(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(arg1: *const std_runtime_error) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_runtime_error_runtime_error3(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13runtime_errorD1Ev"]
    pub fn std_runtime_error_runtime_error_destructor(this: *mut std_runtime_error);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt13runtime_error4whatEv"]
    pub fn std_runtime_error_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_range_error {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_range_error() {
    assert_eq!(
        ::std::mem::size_of::<std_range_error>(),
        8usize,
        concat!("Size of: ", stringify!(std_range_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_range_error>(),
        4usize,
        concat!("Alignment of ", stringify!(std_range_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11range_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_range_error_range_error(this: *mut std_range_error, __arg: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11range_errorC1EPKc"]
    pub fn std_range_error_range_error1(
        this: *mut std_range_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_range_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_range_error_range_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_range_error_range_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt11range_errorD1Ev"]
    pub fn std_range_error_range_error_destructor(this: *mut std_range_error);
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_overflow_error {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_overflow_error() {
    assert_eq!(
        ::std::mem::size_of::<std_overflow_error>(),
        8usize,
        concat!("Size of: ", stringify!(std_overflow_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_overflow_error>(),
        4usize,
        concat!("Alignment of ", stringify!(std_overflow_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt14overflow_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_overflow_error_overflow_error(
        this: *mut std_overflow_error,
        __arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt14overflow_errorC1EPKc"]
    pub fn std_overflow_error_overflow_error1(
        this: *mut std_overflow_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_overflow_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_overflow_error_overflow_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_overflow_error_overflow_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt14overflow_errorD1Ev"]
    pub fn std_overflow_error_overflow_error_destructor(this: *mut std_overflow_error);
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_underflow_error {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_underflow_error() {
    assert_eq!(
        ::std::mem::size_of::<std_underflow_error>(),
        8usize,
        concat!("Size of: ", stringify!(std_underflow_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_underflow_error>(),
        4usize,
        concat!("Alignment of ", stringify!(std_underflow_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt15underflow_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_underflow_error_underflow_error(
        this: *mut std_underflow_error,
        __arg: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt15underflow_errorC1EPKc"]
    pub fn std_underflow_error_underflow_error1(
        this: *mut std_underflow_error,
        arg1: *const ::std::os::raw::c_char,
    );
}
impl std_underflow_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_underflow_error_underflow_error(__bindgen_tmp.as_mut_ptr(), __arg);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_underflow_error_underflow_error1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt15underflow_errorD1Ev"]
    pub fn std_underflow_error_underflow_error_destructor(this: *mut std_underflow_error);
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_error_category {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_error_category() {
    assert_eq!(
        ::std::mem::size_of::<std_error_category>(),
        4usize,
        concat!("Size of: ", stringify!(std_error_category))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_category>(),
        4usize,
        concat!("Alignment of ", stringify!(std_error_category))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt3_V214error_categoryD1Ev"]
    pub fn std_error_category_error_category_destructor(this: *mut std_error_category);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt3_V214error_category23default_error_conditionEi"]
    pub fn std_error_category_default_error_condition(
        this: *mut ::std::os::raw::c_void,
        __i: ::std::os::raw::c_int,
    ) -> std_error_condition;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt3_V214error_category10equivalentEiRKSt15error_condition"]
    pub fn std_error_category_equivalent(
        this: *mut ::std::os::raw::c_void,
        __i: ::std::os::raw::c_int,
        __cond: *const std_error_condition,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt3_V214error_category10equivalentERKSt10error_codei"]
    pub fn std_error_category_equivalent1(
        this: *mut ::std::os::raw::c_void,
        __code: *const std_error_code,
        __i: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt3_V216generic_categoryEv"]
    pub fn std_generic_category() -> *const std_error_category;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt3_V215system_categoryEv"]
    pub fn std_system_category() -> *const std_error_category;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_error_code {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_error_code() {
    assert_eq!(
        ::std::mem::size_of::<std_error_code>(),
        8usize,
        concat!("Size of: ", stringify!(std_error_code))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_code>(),
        4usize,
        concat!("Alignment of ", stringify!(std_error_code))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt10error_code23default_error_conditionEv"]
    pub fn std_error_code_default_error_condition(
        this: *const std_error_code,
    ) -> std_error_condition;
}
impl std_error_code {
    #[inline]
    pub unsafe fn default_error_condition(&self) -> std_error_condition {
        std_error_code_default_error_condition(self)
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_error_condition {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_error_condition() {
    assert_eq!(
        ::std::mem::size_of::<std_error_condition>(),
        8usize,
        concat!("Size of: ", stringify!(std_error_condition))
    );
    assert_eq!(
        ::std::mem::align_of::<std_error_condition>(),
        4usize,
        concat!("Alignment of ", stringify!(std_error_condition))
    );
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_system_error {
    pub _bindgen_opaque_blob: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_std_system_error() {
    assert_eq!(
        ::std::mem::size_of::<std_system_error>(),
        16usize,
        concat!("Size of: ", stringify!(std_system_error))
    );
    assert_eq!(
        ::std::mem::align_of::<std_system_error>(),
        4usize,
        concat!("Alignment of ", stringify!(std_system_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12system_errorD1Ev"]
    pub fn std_system_error_system_error_destructor(this: *mut std_system_error);
}
extern "C" {
    #[link_name = "\u{1}_ZSt17iostream_categoryv"]
    pub fn std_iostream_category() -> *const std_error_category;
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_ios_base {
    pub _bindgen_opaque_blob: [u32; 28usize],
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_ios_base_failure {
    pub _bindgen_opaque_blob: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_std_ios_base_failure() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base_failure>(),
        16usize,
        concat!("Size of: ", stringify!(std_ios_base_failure))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base_failure>(),
        4usize,
        concat!("Alignment of ", stringify!(std_ios_base_failure))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7failureB5cxx11C1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std_ios_base_failure_failure(this: *mut std_ios_base_failure, __str: *const std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7failureB5cxx11C1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERKSt10error_code"]
    pub fn std_ios_base_failure_failure1(
        this: *mut std_ios_base_failure,
        arg1: *const std_string,
        arg2: *const std_error_code,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7failureB5cxx11C1EPKcRKSt10error_code"]
    pub fn std_ios_base_failure_failure2(
        this: *mut std_ios_base_failure,
        arg1: *const ::std::os::raw::c_char,
        arg2: *const std_error_code,
    );
}
impl std_ios_base_failure {
    #[inline]
    pub unsafe fn new(__str: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_failure_failure(__bindgen_tmp.as_mut_ptr(), __str);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const std_string, arg2: *const std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_failure_failure1(__bindgen_tmp.as_mut_ptr(), arg1, arg2);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *const ::std::os::raw::c_char, arg2: *const std_error_code) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_failure_failure2(__bindgen_tmp.as_mut_ptr(), arg1, arg2);
        __bindgen_tmp.assume_init()
    }
}
pub type std_ios_base_fmtflags = u32;
pub type std_ios_base_iostate = u32;
pub type std_ios_base_openmode = u32;
pub type std_ios_base_seekdir = u32;
pub const std_ios_base_event_erase_event: std_ios_base_event = 0;
pub const std_ios_base_event_imbue_event: std_ios_base_event = 1;
pub const std_ios_base_event_copyfmt_event: std_ios_base_event = 2;
pub type std_ios_base_event = ::std::os::raw::c_uint;
pub type std_ios_base_event_callback = u32;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_ios_base__Callback_list {
    pub _bindgen_opaque_blob: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_std_ios_base__Callback_list() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base__Callback_list>(),
        16usize,
        concat!("Size of: ", stringify!(std_ios_base__Callback_list))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base__Callback_list>(),
        4usize,
        concat!("Alignment of ", stringify!(std_ios_base__Callback_list))
    );
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_ios_base__Words {
    pub _bindgen_opaque_blob: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_std_ios_base__Words() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base__Words>(),
        8usize,
        concat!("Size of: ", stringify!(std_ios_base__Words))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base__Words>(),
        4usize,
        concat!("Alignment of ", stringify!(std_ios_base__Words))
    );
}
pub const std_ios_base__S_local_word_size: std_ios_base__bindgen_ty_1 = 8;
pub type std_ios_base__bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_ios_base_Init {
    pub _bindgen_opaque_blob: u8,
}
#[test]
fn bindgen_test_layout_std_ios_base_Init() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base_Init>(),
        1usize,
        concat!("Size of: ", stringify!(std_ios_base_Init))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base_Init>(),
        1usize,
        concat!("Alignment of ", stringify!(std_ios_base_Init))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base4InitC1Ev"]
    pub fn std_ios_base_Init_Init(this: *mut std_ios_base_Init);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base4InitD1Ev"]
    pub fn std_ios_base_Init_Init_destructor(this: *mut std_ios_base_Init);
}
impl std_ios_base_Init {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_Init_Init(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_ios_base_Init_Init_destructor(self)
    }
}
#[test]
fn bindgen_test_layout_std_ios_base() {
    assert_eq!(
        ::std::mem::size_of::<std_ios_base>(),
        112usize,
        concat!("Size of: ", stringify!(std_ios_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std_ios_base>(),
        4usize,
        concat!("Alignment of ", stringify!(std_ios_base))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base17register_callbackEPFvNS_5eventERS_iEi"]
    pub fn std_ios_base_register_callback(
        this: *mut std_ios_base,
        __fn: std_ios_base_event_callback,
        __index: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base17_M_call_callbacksENS_5eventE"]
    pub fn std_ios_base__M_call_callbacks(this: *mut std_ios_base, __ev: std_ios_base_event);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base20_M_dispose_callbacksEv"]
    pub fn std_ios_base__M_dispose_callbacks(this: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base13_M_grow_wordsEib"]
    pub fn std_ios_base__M_grow_words(
        this: *mut std_ios_base,
        __index: ::std::os::raw::c_int,
        __iword: bool,
    ) -> *mut std_ios_base__Words;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7_M_initEv"]
    pub fn std_ios_base__M_init(this: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base15sync_with_stdioEb"]
    pub fn std_ios_base_sync_with_stdio(__sync: bool) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base5imbueERKSt6locale"]
    pub fn std_ios_base_imbue(this: *mut std_ios_base, __loc: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base6xallocEv"]
    pub fn std_ios_base_xalloc() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7_M_moveERS_"]
    pub fn std_ios_base__M_move(this: *mut std_ios_base, arg1: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7_M_swapERS_"]
    pub fn std_ios_base__M_swap(this: *mut std_ios_base, __rhs: *mut std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_baseC1Ev"]
    pub fn std_ios_base_ios_base(this: *mut std_ios_base);
}
impl std_ios_base {
    #[inline]
    pub unsafe fn register_callback(
        &mut self,
        __fn: std_ios_base_event_callback,
        __index: ::std::os::raw::c_int,
    ) {
        std_ios_base_register_callback(self, __fn, __index)
    }
    #[inline]
    pub unsafe fn _M_call_callbacks(&mut self, __ev: std_ios_base_event) {
        std_ios_base__M_call_callbacks(self, __ev)
    }
    #[inline]
    pub unsafe fn _M_dispose_callbacks(&mut self) {
        std_ios_base__M_dispose_callbacks(self)
    }
    #[inline]
    pub unsafe fn _M_grow_words(
        &mut self,
        __index: ::std::os::raw::c_int,
        __iword: bool,
    ) -> *mut std_ios_base__Words {
        std_ios_base__M_grow_words(self, __index, __iword)
    }
    #[inline]
    pub unsafe fn _M_init(&mut self) {
        std_ios_base__M_init(self)
    }
    #[inline]
    pub unsafe fn sync_with_stdio(__sync: bool) -> bool {
        std_ios_base_sync_with_stdio(__sync)
    }
    #[inline]
    pub unsafe fn imbue(&mut self, __loc: *const std_locale) -> std_locale {
        std_ios_base_imbue(self, __loc)
    }
    #[inline]
    pub unsafe fn xalloc() -> ::std::os::raw::c_int {
        std_ios_base_xalloc()
    }
    #[inline]
    pub unsafe fn _M_move(&mut self, arg1: *mut std_ios_base) {
        std_ios_base__M_move(self, arg1)
    }
    #[inline]
    pub unsafe fn _M_swap(&mut self, __rhs: *mut std_ios_base) {
        std_ios_base__M_swap(self, __rhs)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_ios_base_ios_base(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7failureB5cxx11D1Ev"]
    pub fn std_ios_base_failure_failure_destructor(this: *mut std_ios_base_failure);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt8ios_base7failureB5cxx114whatEv"]
    pub fn std_ios_base_failure_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base9boolalphaE"]
    pub static std_ios_base_boolalpha: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base3decE"]
    pub static std_ios_base_dec: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base5fixedE"]
    pub static std_ios_base_fixed: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base3hexE"]
    pub static std_ios_base_hex: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base8internalE"]
    pub static std_ios_base_internal: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base4leftE"]
    pub static std_ios_base_left: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base3octE"]
    pub static std_ios_base_oct: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base5rightE"]
    pub static std_ios_base_right: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base10scientificE"]
    pub static std_ios_base_scientific: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base8showbaseE"]
    pub static std_ios_base_showbase: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base9showpointE"]
    pub static std_ios_base_showpoint: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7showposE"]
    pub static std_ios_base_showpos: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base6skipwsE"]
    pub static std_ios_base_skipws: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7unitbufE"]
    pub static std_ios_base_unitbuf: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base9uppercaseE"]
    pub static std_ios_base_uppercase: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base11adjustfieldE"]
    pub static std_ios_base_adjustfield: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base9basefieldE"]
    pub static std_ios_base_basefield: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base10floatfieldE"]
    pub static std_ios_base_floatfield: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base6badbitE"]
    pub static std_ios_base_badbit: std_ios_base_iostate;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base6eofbitE"]
    pub static std_ios_base_eofbit: std_ios_base_iostate;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7failbitE"]
    pub static std_ios_base_failbit: std_ios_base_iostate;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base7goodbitE"]
    pub static std_ios_base_goodbit: std_ios_base_iostate;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base3appE"]
    pub static std_ios_base_app: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base3ateE"]
    pub static std_ios_base_ate: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base6binaryE"]
    pub static std_ios_base_binary: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base2inE"]
    pub static std_ios_base_in: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base3outE"]
    pub static std_ios_base_out: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base5truncE"]
    pub static std_ios_base_trunc: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base11__noreplaceE"]
    pub static std_ios_base___noreplace: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base3begE"]
    pub static std_ios_base_beg: std_ios_base_seekdir;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base3curE"]
    pub static std_ios_base_cur: std_ios_base_seekdir;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base3endE"]
    pub static std_ios_base_end: std_ios_base_seekdir;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base4Init11_S_refcountE"]
    pub static mut std_ios_base_Init__S_refcount: _Atomic_word;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_base4Init20_S_synced_with_stdioE"]
    pub static mut std_ios_base_Init__S_synced_with_stdio: bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt8ios_baseD1Ev"]
    pub fn std_ios_base_ios_base_destructor(this: *mut std_ios_base);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_streambuf {}
pub type std_basic_streambuf_char_type = u8;
pub type std_basic_streambuf_traits_type = u8;
pub type std_basic_streambuf_int_type = u8;
pub type std_basic_streambuf_pos_type = u8;
pub type std_basic_streambuf_off_type = u8;
pub type std_basic_streambuf___streambuf_type = u8;
extern "C" {
    #[link_name = "\u{1}_ZSt21__copy_streambufs_eofIcSt11char_traitsIcEEiPSt15basic_streambufIT_T0_ES6_Rb"]
    pub fn std___copy_streambufs_eof(
        __sbin: *mut [u32; 8usize],
        __sbout: *mut [u32; 8usize],
        __ineof: *mut bool,
    ) -> std_streamsize;
}
extern "C" {
    #[link_name = "\u{1}_ZSt21__copy_streambufs_eofIwSt11char_traitsIwEEiPSt15basic_streambufIT_T0_ES6_Rb"]
    pub fn std___copy_streambufs_eof1(
        __sbin: *mut [u32; 8usize],
        __sbout: *mut [u32; 8usize],
        __ineof: *mut bool,
    ) -> std_streamsize;
}
extern "C" {
    #[link_name = "\u{1}_ZSt14__convert_to_vIfEvPKcRT_RSt12_Ios_IostateRKP15__locale_struct"]
    pub fn std___convert_to_v(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut f32,
        arg3: *mut std_ios_base_iostate,
        arg4: *const std___c_locale,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZSt14__convert_to_vIdEvPKcRT_RSt12_Ios_IostateRKP15__locale_struct"]
    pub fn std___convert_to_v1(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut f64,
        arg3: *mut std_ios_base_iostate,
        arg4: *const std___c_locale,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZSt14__convert_to_vIeEvPKcRT_RSt12_Ios_IostateRKP15__locale_struct"]
    pub fn std___convert_to_v2(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut f64,
        arg3: *mut std_ios_base_iostate,
        arg4: *const std___c_locale,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt10__num_base15_S_format_floatERKSt8ios_basePcc"]
    pub fn std___num_base__S_format_float(
        __io: *const std_ios_base,
        __fptr: *mut ::std::os::raw::c_char,
        __mod: ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZSt17__verify_groupingPKcjRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn std___verify_grouping(
        __grouping: *const ::std::os::raw::c_char,
        __grouping_size: usize,
        __grouping_tmp: *const std_string,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ostream {}
pub type std_basic_ostream_char_type = u8;
pub type std_basic_ostream_int_type = u8;
pub type std_basic_ostream_pos_type = u8;
pub type std_basic_ostream_off_type = u8;
pub type std_basic_ostream_traits_type = u8;
pub type std_basic_ostream___streambuf_type = u8;
pub type std_basic_ostream___ios_type = u8;
pub type std_basic_ostream___ostream_type = u8;
pub type std_basic_ostream___num_put_type = u8;
pub type std_basic_ostream___ctype_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ostream_sentry {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istream {}
pub type std_basic_istream_char_type = u8;
pub type std_basic_istream_int_type = u8;
pub type std_basic_istream_pos_type = u8;
pub type std_basic_istream_off_type = u8;
pub type std_basic_istream_traits_type = u8;
pub type std_basic_istream___streambuf_type = u8;
pub type std_basic_istream___ios_type = u8;
pub type std_basic_istream___istream_type = u8;
pub type std_basic_istream___num_get_type = u8;
pub type std_basic_istream___ctype_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istream_sentry {
    pub _address: u8,
}
pub type std_basic_istream_sentry_traits_type = u8;
pub type std_basic_istream_sentry___streambuf_type = u8;
pub type std_basic_istream_sentry___istream_type = u8;
pub type std_basic_istream_sentry___ctype_type = u8;
pub type std_basic_istream_sentry___int_type = u8;
extern "C" {
    #[link_name = "\u{1}_ZSt17__istream_extractRSiPci"]
    pub fn std___istream_extract(
        arg1: *mut std_istream,
        arg2: *mut ::std::os::raw::c_char,
        arg3: std_streamsize,
    );
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std___time_get_state {
    pub _bindgen_opaque_blob: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_std___time_get_state() {
    assert_eq!(
        ::std::mem::size_of::<std___time_get_state>(),
        12usize,
        concat!("Size of: ", stringify!(std___time_get_state))
    );
    assert_eq!(
        ::std::mem::align_of::<std___time_get_state>(),
        4usize,
        concat!("Alignment of ", stringify!(std___time_get_state))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt16__time_get_state17_M_finalize_stateEP2tm"]
    pub fn std___time_get_state__M_finalize_state(this: *mut std___time_get_state, __tm: *mut tm);
}
impl std___time_get_state {
    #[inline]
    pub unsafe fn _M_finalize_state(&mut self, __tm: *mut tm) {
        std___time_get_state__M_finalize_state(self, __tm)
    }
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_money_base_pattern {
    pub _bindgen_opaque_blob: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_std_money_base_pattern() {
    assert_eq!(
        ::std::mem::size_of::<std_money_base_pattern>(),
        4usize,
        concat!("Size of: ", stringify!(std_money_base_pattern))
    );
    assert_eq!(
        ::std::mem::align_of::<std_money_base_pattern>(),
        1usize,
        concat!("Alignment of ", stringify!(std_money_base_pattern))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt10money_base20_S_construct_patternEccc"]
    pub fn std_money_base__S_construct_pattern(
        __precedes: ::std::os::raw::c_char,
        __space: ::std::os::raw::c_char,
        __posn: ::std::os::raw::c_char,
    ) -> std_money_base_pattern;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_default_delete {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unique_ptr {
    pub _address: u8,
}
pub type std_unique_ptr__DeleterConstraint = u8;
pub type std_unique_ptr_pointer = u8;
pub type std_unique_ptr_element_type = u8;
pub type std_unique_ptr_deleter_type = u8;
pub type std_unique_ptr___safe_conversion_up = u8;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_weak_ptr {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_bad_weak_ptr() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_weak_ptr>(),
        4usize,
        concat!("Size of: ", stringify!(std_bad_weak_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_weak_ptr>(),
        4usize,
        concat!("Alignment of ", stringify!(std_bad_weak_ptr))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt12bad_weak_ptr4whatEv"]
    pub fn std_bad_weak_ptr_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZNSt12bad_weak_ptrD1Ev"]
    pub fn std_bad_weak_ptr_bad_weak_ptr_destructor(this: *mut std_bad_weak_ptr);
}
extern "C" {
    #[link_name = "\u{1}_M_add_ref_lock_nothrow"]
    pub fn std__Sp_counted_base__M_add_ref_lock_nothrow(this: *mut u8) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_M_release"]
    pub fn std__Sp_counted_base__M_release(this: *mut u8);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_shared_ptr {
    pub _address: u8,
}
pub type std_shared_ptr__Constructible = u8;
pub type std_shared_ptr__Assignable = u8;
pub type std_shared_ptr_element_type = u8;
pub type std_shared_ptr_weak_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_weak_ptr {
    pub _address: u8,
}
pub type std_weak_ptr__Constructible = u8;
pub type std_weak_ptr__Assignable = u8;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_mutex {
    pub _bindgen_opaque_blob: [u32; 6usize],
}
pub type std_mutex_native_handle_type = u32;
#[test]
fn bindgen_test_layout_std_mutex() {
    assert_eq!(
        ::std::mem::size_of::<std_mutex>(),
        24usize,
        concat!("Size of: ", stringify!(std_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<std_mutex>(),
        4usize,
        concat!("Alignment of ", stringify!(std_mutex))
    );
}
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std__Sp_locker {
    pub _bindgen_opaque_blob: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_std__Sp_locker() {
    assert_eq!(
        ::std::mem::size_of::<std__Sp_locker>(),
        2usize,
        concat!("Size of: ", stringify!(std__Sp_locker))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Sp_locker>(),
        1usize,
        concat!("Alignment of ", stringify!(std__Sp_locker))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt10_Sp_lockerC1EPKv"]
    pub fn std__Sp_locker__Sp_locker(
        this: *mut std__Sp_locker,
        arg1: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt10_Sp_lockerC1EPKvS1_"]
    pub fn std__Sp_locker__Sp_locker1(
        this: *mut std__Sp_locker,
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt10_Sp_lockerD1Ev"]
    pub fn std__Sp_locker__Sp_locker_destructor(this: *mut std__Sp_locker);
}
impl std__Sp_locker {
    #[inline]
    pub unsafe fn new(arg1: *const ::std::os::raw::c_void) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std__Sp_locker__Sp_locker(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std__Sp_locker__Sp_locker1(__bindgen_tmp.as_mut_ptr(), arg1, arg2);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std__Sp_locker__Sp_locker_destructor(self)
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_bad_function_call {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_bad_function_call() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_function_call>(),
        4usize,
        concat!("Size of: ", stringify!(std_bad_function_call))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_function_call>(),
        4usize,
        concat!("Alignment of ", stringify!(std_bad_function_call))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt17bad_function_callD1Ev"]
    pub fn std_bad_function_call_bad_function_call_destructor(this: *mut std_bad_function_call);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt17bad_function_call4whatEv"]
    pub fn std_bad_function_call_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_vector {
    pub _address: u8,
}
pub type std_vector__Base = u8;
pub type std_vector__Tp_alloc_type = u8;
pub type std_vector__Alloc_traits = u8;
pub type std_vector_value_type = u8;
pub type std_vector_pointer = u8;
pub type std_vector_const_pointer = u8;
pub type std_vector_reference = u8;
pub type std_vector_const_reference = u8;
pub type std_vector_iterator = u8;
pub type std_vector_const_iterator = u8;
pub type std_vector_const_reverse_iterator = u8;
pub type std_vector_reverse_iterator = u8;
pub type std_vector_size_type = u32;
pub type std_vector_difference_type = u32;
pub type std_vector_allocator_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_vector__Temporary_value {
    pub _address: u8,
}
#[repr(C)]
#[repr(align(1))]
#[derive(Copy, Clone)]
pub union std_vector__Temporary_value__Storage {
    pub _bindgen_opaque_blob: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_atomic {
    pub _address: u8,
}
pub type std_atomic_value_type = u8;
pub type std_atomic_bool = u8;
pub type std_atomic_int = u32;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_thread {
    pub _bindgen_opaque_blob: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_thread__State {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_thread__State() {
    assert_eq!(
        ::std::mem::size_of::<std_thread__State>(),
        4usize,
        concat!("Size of: ", stringify!(std_thread__State))
    );
    assert_eq!(
        ::std::mem::align_of::<std_thread__State>(),
        4usize,
        concat!("Alignment of ", stringify!(std_thread__State))
    );
}
pub type std_thread__State_ptr = u32;
pub type std_thread_native_handle_type = u32;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std_thread_id {
    pub _bindgen_opaque_blob: u32,
}
#[test]
fn bindgen_test_layout_std_thread_id() {
    assert_eq!(
        ::std::mem::size_of::<std_thread_id>(),
        4usize,
        concat!("Size of: ", stringify!(std_thread_id))
    );
    assert_eq!(
        ::std::mem::align_of::<std_thread_id>(),
        4usize,
        concat!("Alignment of ", stringify!(std_thread_id))
    );
}
pub type std_thread___not_same = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_thread__State_impl {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_thread__Invoker {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_thread__Invoker___result {
    pub _address: u8,
}
pub type std_thread__Call_wrapper = u8;
#[test]
fn bindgen_test_layout_std_thread() {
    assert_eq!(
        ::std::mem::size_of::<std_thread>(),
        4usize,
        concat!("Size of: ", stringify!(std_thread))
    );
    assert_eq!(
        ::std::mem::align_of::<std_thread>(),
        4usize,
        concat!("Alignment of ", stringify!(std_thread))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6thread4joinEv"]
    pub fn std_thread_join(this: *mut std_thread);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6thread6detachEv"]
    pub fn std_thread_detach(this: *mut std_thread);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6thread20hardware_concurrencyEv"]
    pub fn std_thread_hardware_concurrency() -> ::std::os::raw::c_uint;
}
impl std_thread {
    #[inline]
    pub unsafe fn join(&mut self) {
        std_thread_join(self)
    }
    #[inline]
    pub unsafe fn detach(&mut self) {
        std_thread_detach(self)
    }
    #[inline]
    pub unsafe fn hardware_concurrency() -> ::std::os::raw::c_uint {
        std_thread_hardware_concurrency()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNSt6thread6_StateD1Ev"]
    pub fn std_thread__State__State_destructor(this: *mut std_thread__State);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unique_lock {
    pub _address: u8,
}
pub type std_unique_lock_mutex_type = u8;
extern "C" {
    #[link_name = "\u{1}__once_proxy"]
    pub fn std___once_proxy();
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct std_condition_variable {
    pub _bindgen_opaque_blob: [u64; 6usize],
}
pub type std_condition_variable_steady_clock = u8;
pub type std_condition_variable_system_clock = u8;
pub type std_condition_variable___clock_t = u8;
pub type std_condition_variable_native_handle_type = u32;
#[test]
fn bindgen_test_layout_std_condition_variable() {
    assert_eq!(
        ::std::mem::size_of::<std_condition_variable>(),
        48usize,
        concat!("Size of: ", stringify!(std_condition_variable))
    );
    assert_eq!(
        ::std::mem::align_of::<std_condition_variable>(),
        8usize,
        concat!("Alignment of ", stringify!(std_condition_variable))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt18condition_variable10notify_oneEv"]
    pub fn std_condition_variable_notify_one(this: *mut std_condition_variable);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt18condition_variable10notify_allEv"]
    pub fn std_condition_variable_notify_all(this: *mut std_condition_variable);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt18condition_variable4waitERSt11unique_lockISt5mutexE"]
    pub fn std_condition_variable_wait(
        this: *mut std_condition_variable,
        __lock: *mut [u32; 2usize],
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt18condition_variableC1Ev"]
    pub fn std_condition_variable_condition_variable(this: *mut std_condition_variable);
}
extern "C" {
    #[link_name = "\u{1}_ZNSt18condition_variableD1Ev"]
    pub fn std_condition_variable_condition_variable_destructor(this: *mut std_condition_variable);
}
impl std_condition_variable {
    #[inline]
    pub unsafe fn notify_one(&mut self) {
        std_condition_variable_notify_one(self)
    }
    #[inline]
    pub unsafe fn notify_all(&mut self) {
        std_condition_variable_notify_all(self)
    }
    #[inline]
    pub unsafe fn wait(&mut self, __lock: *mut [u32; 2usize]) {
        std_condition_variable_wait(self, __lock)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std_condition_variable_condition_variable(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_condition_variable_condition_variable_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZSt25notify_all_at_thread_exitRSt18condition_variableSt11unique_lockISt5mutexE"]
    pub fn std_notify_all_at_thread_exit(arg1: *mut std_condition_variable, arg2: [u32; 2usize]);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_optional {
    pub _address: u8,
}
pub type std_optional__Base = u8;
pub type std_optional___not_self = u8;
pub type std_optional___not_tag = u8;
pub type std_optional__Requires = u8;
pub type std_optional_value_type = u8;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct std__Rb_tree_node_base {
    pub _bindgen_opaque_blob: [u32; 4usize],
}
pub type std__Rb_tree_node_base__Base_ptr = u32;
pub type std__Rb_tree_node_base__Const_Base_ptr = u32;
#[test]
fn bindgen_test_layout_std__Rb_tree_node_base() {
    assert_eq!(
        ::std::mem::size_of::<std__Rb_tree_node_base>(),
        16usize,
        concat!("Size of: ", stringify!(std__Rb_tree_node_base))
    );
    assert_eq!(
        ::std::mem::align_of::<std__Rb_tree_node_base>(),
        4usize,
        concat!("Alignment of ", stringify!(std__Rb_tree_node_base))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZSt18_Rb_tree_incrementPSt18_Rb_tree_node_base"]
    pub fn std__Rb_tree_increment(__x: *mut std__Rb_tree_node_base) -> *mut std__Rb_tree_node_base;
}
extern "C" {
    #[link_name = "\u{1}_ZSt18_Rb_tree_incrementPKSt18_Rb_tree_node_base"]
    pub fn std__Rb_tree_increment1(
        __x: *const std__Rb_tree_node_base,
    ) -> *const std__Rb_tree_node_base;
}
extern "C" {
    #[link_name = "\u{1}_ZSt18_Rb_tree_decrementPSt18_Rb_tree_node_base"]
    pub fn std__Rb_tree_decrement(__x: *mut std__Rb_tree_node_base) -> *mut std__Rb_tree_node_base;
}
extern "C" {
    #[link_name = "\u{1}_ZSt18_Rb_tree_decrementPKSt18_Rb_tree_node_base"]
    pub fn std__Rb_tree_decrement1(
        __x: *const std__Rb_tree_node_base,
    ) -> *const std__Rb_tree_node_base;
}
extern "C" {
    #[link_name = "\u{1}_ZSt29_Rb_tree_insert_and_rebalancebPSt18_Rb_tree_node_baseS0_RS_"]
    pub fn std__Rb_tree_insert_and_rebalance(
        __insert_left: bool,
        __x: *mut std__Rb_tree_node_base,
        __p: *mut std__Rb_tree_node_base,
        __header: *mut std__Rb_tree_node_base,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZSt28_Rb_tree_rebalance_for_erasePSt18_Rb_tree_node_baseRS_"]
    pub fn std__Rb_tree_rebalance_for_erase(
        __z: *mut std__Rb_tree_node_base,
        __header: *mut std__Rb_tree_node_base,
    ) -> *mut std__Rb_tree_node_base;
}
extern "C" {
    #[link_name = "\u{1}_ZSt20_Rb_tree_black_countPKSt18_Rb_tree_node_baseS1_"]
    pub fn std__Rb_tree_black_count(
        __node: *const std__Rb_tree_node_base,
        __root: *const std__Rb_tree_node_base,
    ) -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_variant {
    pub _address: u8,
}
pub type std_variant__Base = u8;
pub type std_variant__Default_ctor_enabler = u8;
pub type std_variant___to_type = u8;
pub type std_variant___accepted_type = u8;
pub type std_variant__Traits = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_variant___is_in_place_tag {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_set {
    pub _address: u8,
}
pub type std_set_key_type = u8;
pub type std_set_value_type = u8;
pub type std_set_key_compare = u8;
pub type std_set_value_compare = u8;
pub type std_set_allocator_type = u8;
pub type std_set__Key_alloc_type = u8;
pub type std_set__Rep_type = u8;
pub type std_set__Alloc_traits = u8;
pub type std_set_pointer = u8;
pub type std_set_const_pointer = u8;
pub type std_set_reference = u8;
pub type std_set_const_reference = u8;
pub type std_set_iterator = u8;
pub type std_set_const_iterator = u8;
pub type std_set_reverse_iterator = u8;
pub type std_set_const_reverse_iterator = u8;
pub type std_set_size_type = u8;
pub type std_set_difference_type = u8;
pub type std_set_node_type = u8;
pub type std_set_insert_return_type = u8;
#[doc = " Generic handle for all WPI handle-based interfaces.\n\n Handle data layout:\n - Bits 0-23:  Type-specific\n - Bits 24-30: Type\n - Bit 31:     Error"]
pub type WPI_Handle = ::std::os::raw::c_uint;
#[doc = " An event handle."]
pub type WPI_EventHandle = WPI_Handle;
#[repr(C)]
pub struct wpi_Sendable__bindgen_vtable {
    pub wpi_Sendable_InitSendable:
        unsafe extern "C" fn(this: *mut wpi_Sendable, builder: *mut wpi_SendableBuilder),
}
#[doc = " Interface for Sendable objects."]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_Sendable {
    pub vtable_: *const wpi_Sendable__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_wpi_Sendable() {
    assert_eq!(
        ::std::mem::size_of::<wpi_Sendable>(),
        4usize,
        concat!("Size of: ", stringify!(wpi_Sendable))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_Sendable>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_Sendable))
    );
}
#[doc = " A helper class for use with objects that add themselves to SendableRegistry.\n It takes care of properly calling Move() and Remove() on move and\n destruction.  No action is taken if the object is copied.\n Use public inheritance with CRTP when using this class.\n @tparam CRTP derived class"]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_SendableHelper {
    pub _address: u8,
}
pub type wpi_mutex = std_mutex;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_log_DataLog {
    _unused: [u8; 0],
}
#[doc = " StringMapEntryBase - Shared base class of StringMapEntry instances."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_StringMapEntryBase {
    pub keyLength: usize,
}
#[test]
fn bindgen_test_layout_wpi_StringMapEntryBase() {
    const UNINIT: ::std::mem::MaybeUninit<wpi_StringMapEntryBase> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpi_StringMapEntryBase>(),
        4usize,
        concat!("Size of: ", stringify!(wpi_StringMapEntryBase))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_StringMapEntryBase>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_StringMapEntryBase))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keyLength) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_StringMapEntryBase),
            "::",
            stringify!(keyLength)
        )
    );
}
#[doc = " StringMapEntryStorage - Holds the value in a StringMapEntry.\n\n Factored out into a separate base class to make it easier to specialize.\n This is primarily intended to support StringSet, which doesn't need a value\n stored at all."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_StringMapEntryStorage<ValueTy> {
    pub _base: wpi_StringMapEntryBase,
    pub second: ValueTy,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<ValueTy>>,
}
#[doc = " StringMapEntry - This is used to represent one value that is inserted into\n a StringMap.  It contains the Value itself and the key: the string length\n and data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_StringMapEntry<ValueTy> {
    pub _base: wpi_StringMapEntryStorage<ValueTy>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<ValueTy>>,
}
#[doc = " CRTP base class which implements the entire standard iterator facade\n in terms of a minimal subset of the interface.\n\n Use this when it is reasonable to implement most of the iterator\n functionality in terms of a core subset. If you need special behavior or\n there are performance implications for this, you may want to override the\n relevant members instead.\n\n Note, one abstraction that this does *not* provide is implementing\n subtraction in terms of addition by negating the difference. Negation isn't\n always information preserving, and I can see very reasonable iterator\n designs where this doesn't work well. It doesn't really force much added\n boilerplate anyways.\n\n Another abstraction that this doesn't provide is implementing increment in\n terms of addition of one. These aren't equivalent for all iterator\n categories, and respecting that adds a lot of complexity for little gain.\n\n Iterators are expected to have const rules analogous to pointers, with a\n single, const-qualified operator*() that returns ReferenceT. This matches\n the second and third pointers in the following example:\n \\code\n   int Value;\n   { int *I = &Value; }             // ReferenceT 'int&'\n   { int *const I = &Value; }       // ReferenceT 'int&'; const\n   { const int *I = &Value; }       // ReferenceT 'const int&'\n   { const int *const I = &Value; } // ReferenceT 'const int&'; const\n \\endcode\n If an iterator facade returns a handle to its own state, then T (and\n PointerT and ReferenceT) should usually be const-qualified. Otherwise, if\n clients are expected to modify the handle itself, the field can be declared\n mutable or use const_cast.\n\n Classes wishing to use `iterator_facade_base` should implement the following\n methods:\n\n Forward Iterators:\n   (All of the following methods)\n   - DerivedT &operator=(const DerivedT &R);\n   - bool operator==(const DerivedT &R) const;\n   - T &operator*() const;\n   - DerivedT &operator++();\n\n Bidirectional Iterators:\n   (All methods of forward iterators, plus the following)\n   - DerivedT &operator--();\n\n Random-access Iterators:\n   (All methods of bidirectional iterators excluding the following)\n   - DerivedT &operator++();\n   - DerivedT &operator--();\n   (and plus the following)\n   - bool operator<(const DerivedT &RHS) const;\n   - DifferenceTypeT operator-(const DerivedT &R) const;\n   - DerivedT &operator+=(DifferenceTypeT N);\n   - DerivedT &operator-=(DifferenceTypeT N);\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_iterator_facade_base {
    pub _address: u8,
}
pub type wpi_iterator_facade_base_iterator_category<IteratorCategoryT> = IteratorCategoryT;
pub type wpi_iterator_facade_base_value_type<T> = T;
pub type wpi_iterator_facade_base_difference_type<DifferenceTypeT> = DifferenceTypeT;
pub type wpi_iterator_facade_base_pointer<PointerT> = PointerT;
pub type wpi_iterator_facade_base_reference<ReferenceT> = ReferenceT;
pub const wpi_iterator_facade_base_IsRandomAccess: wpi_iterator_facade_base__bindgen_ty_1 = 0;
pub const wpi_iterator_facade_base_IsBidirectional: wpi_iterator_facade_base__bindgen_ty_1 = 0;
pub type wpi_iterator_facade_base__bindgen_ty_1 = i32;
#[doc = " A proxy object for computing a reference via indirecting a copy of an\n iterator. This is used in APIs which need to produce a reference via\n indirection but for which the iterator object might be a temporary. The\n proxy preserves the iterator internally and exposes the indirected\n reference via a conversion operator."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_iterator_facade_base_ReferenceProxy<DerivedT> {
    pub I: DerivedT,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<DerivedT>>,
}
#[doc = " A proxy object for computing a pointer via indirecting a copy of a\n reference. This is used in APIs which need to produce a pointer but for\n which the reference might be a temporary. The proxy preserves the\n reference internally and exposes the pointer via a arrow operator."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_iterator_facade_base_PointerProxy<ReferenceT> {
    pub R: ReferenceT,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<ReferenceT>>,
}
#[doc = " CRTP base class providing obvious overloads for the core \\c\n Allocate() methods of LLVM-style allocators.\n\n This base class both documents the full public interface exposed by all\n LLVM-style allocators, and redirects all of the overloads to a single core\n set of methods which the derived class must define."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_AllocatorBase {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_MallocAllocator {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_wpi_MallocAllocator() {
    assert_eq!(
        ::std::mem::size_of::<wpi_MallocAllocator>(),
        1usize,
        concat!("Size of: ", stringify!(wpi_MallocAllocator))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_MallocAllocator>(),
        1usize,
        concat!("Alignment of ", stringify!(wpi_MallocAllocator))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_const_pointer_or_const_ref {
    pub _address: u8,
}
pub type wpi_const_pointer_or_const_ref_type<T> = *const T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_detail_DenseMapPair {
    pub _address: u8,
}
#[doc = "@brief general exception of the @ref json class\n\nThis class is an extension of `std::exception` objects with a member @a id for\nexception ids. It is used as the base class for all exceptions thrown by the\n@ref json class. This class can hence be used as \"wildcard\" to catch\nexceptions.\n\nSubclasses:\n- @ref parse_error for exceptions indicating a parse error\n- @ref invalid_iterator for exceptions indicating errors with iterators\n- @ref type_error for exceptions indicating executing a member function with\na wrong type\n- @ref out_of_range for exceptions indicating access out of the defined range\n- @ref other_error for exceptions indicating other library errors\n\n@internal\n@note To have nothrow-copy-constructible exceptions, we internally use\n`std::runtime_error` which can cope with arbitrary-length error messages.\nIntermediate strings are built with static functions and then passed to\nthe actual constructor.\n@endinternal\n\n@liveexample{The following code shows how arbitrary library exceptions can be\ncaught.,exception}\n\n@since version 3.0.0"]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_detail_exception {
    pub _base: std_exception,
    #[doc = " the id of the exception"]
    pub id: ::std::os::raw::c_int,
    #[doc = " an exception object as storage for error messages"]
    pub m: std_runtime_error,
}
#[test]
fn bindgen_test_layout_wpi_detail_exception() {
    const UNINIT: ::std::mem::MaybeUninit<wpi_detail_exception> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpi_detail_exception>(),
        16usize,
        concat!("Size of: ", stringify!(wpi_detail_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_detail_exception>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_detail_exception))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_detail_exception),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_detail_exception),
            "::",
            stringify!(m)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN3wpi6detail9exceptionC1EiSt17basic_string_viewIcSt11char_traitsIcEE"]
    pub fn wpi_detail_exception_exception(
        this: *mut wpi_detail_exception,
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
    );
}
impl wpi_detail_exception {
    #[inline]
    pub unsafe fn new(id_: ::std::os::raw::c_int, what_arg: std_string_view) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        wpi_detail_exception_exception(__bindgen_tmp.as_mut_ptr(), id_, what_arg);
        __bindgen_tmp.assume_init()
    }
}
#[doc = "@brief exception indicating a parse error\n\nThis exception is thrown by the library when a parse error occurs. Parse errors\ncan occur during the deserialization of JSON text, CBOR, MessagePack, as well\nas when using JSON Patch.\n\nMember @a byte holds the byte index of the last read character in the input\nfile.\n\nExceptions have ids 1xx.\n\nname / id                      | example message | description\n------------------------------ | --------------- | -------------------------\njson.exception.parse_error.101 | parse error at 2: unexpected end of input; expected string literal | This error indicates a syntax error while deserializing a JSON text. The error message describes that an unexpected token (character) was encountered, and the member @a byte indicates the error position.\njson.exception.parse_error.102 | parse error at 14: missing or wrong low surrogate | JSON uses the `\\uxxxx` format to describe Unicode characters. Code points above above 0xFFFF are split into two `\\uxxxx` entries (\"surrogate pairs\"). This error indicates that the surrogate pair is incomplete or contains an invalid code point.\njson.exception.parse_error.103 | parse error: code points above 0x10FFFF are invalid | Unicode supports code points up to 0x10FFFF. Code points above 0x10FFFF are invalid.\njson.exception.parse_error.104 | parse error: JSON patch must be an array of objects | [RFC 6902](https://tools.ietf.org/html/rfc6902) requires a JSON Patch document to be a JSON document that represents an array of objects.\njson.exception.parse_error.105 | parse error: operation must have string member 'op' | An operation of a JSON Patch document must contain exactly one \"op\" member, whose value indicates the operation to perform. Its value must be one of \"add\", \"remove\", \"replace\", \"move\", \"copy\", or \"test\"; other values are errors.\njson.exception.parse_error.106 | parse error: array index '01' must not begin with '0' | An array index in a JSON Pointer ([RFC 6901](https://tools.ietf.org/html/rfc6901)) may be `0` or any number without a leading `0`.\njson.exception.parse_error.107 | parse error: JSON pointer must be empty or begin with '/' - was: 'foo' | A JSON Pointer must be a Unicode string containing a sequence of zero or more reference tokens, each prefixed by a `/` character.\njson.exception.parse_error.108 | parse error: escape character '~' must be followed with '0' or '1' | In a JSON Pointer, only `~0` and `~1` are valid escape sequences.\njson.exception.parse_error.109 | parse error: array index 'one' is not a number | A JSON Pointer array index must be a number.\njson.exception.parse_error.110 | parse error at 1: cannot read 2 bytes from vector | When parsing CBOR or MessagePack, the byte vector ends before the complete value has been read.\njson.exception.parse_error.112 | parse error at 1: error reading CBOR; last byte: 0xF8 | Not all types of CBOR or MessagePack are supported. This exception occurs if an unsupported byte was read.\njson.exception.parse_error.113 | parse error at 2: expected a CBOR string; last byte: 0x98 | While parsing a map key, a value that is not a string has been read.\n\n@note For an input with n bytes, 1 is the index of the first character and n+1\nis the index of the terminating null byte or the end of file. This also\nholds true when reading a byte vector (CBOR or MessagePack).\n\n@liveexample{The following code shows how a `parse_error` exception can be\ncaught.,parse_error}\n\n@sa @ref exception for the base class of the library exceptions\n@sa @ref invalid_iterator for exceptions indicating errors with iterators\n@sa @ref type_error for exceptions indicating executing a member function with\na wrong type\n@sa @ref out_of_range for exceptions indicating access out of the defined range\n@sa @ref other_error for exceptions indicating other library errors\n\n@since version 3.0.0"]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_detail_parse_error {
    pub _base: wpi_detail_exception,
    #[doc = "@brief byte index of the parse error\n\nThe byte index of the last read character in the input file.\n\n@note For an input with n bytes, 1 is the index of the first character and\nn+1 is the index of the terminating null byte or the end of file.\nThis also holds true when reading a byte vector (CBOR or MessagePack)."]
    pub byte: usize,
}
#[test]
fn bindgen_test_layout_wpi_detail_parse_error() {
    const UNINIT: ::std::mem::MaybeUninit<wpi_detail_parse_error> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpi_detail_parse_error>(),
        20usize,
        concat!("Size of: ", stringify!(wpi_detail_parse_error))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_detail_parse_error>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_detail_parse_error))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).byte) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_detail_parse_error),
            "::",
            stringify!(byte)
        )
    );
}
extern "C" {
    #[doc = "@brief create a parse error exception\n@param[in] id_       the id of the exception\n@param[in] byte_     the byte index where the error occurred (or 0 if the\nposition cannot be determined)\n@param[in] what_arg  the explanatory string\n@return parse_error object"]
    #[link_name = "\u{1}_ZN3wpi6detail11parse_error6createEijSt17basic_string_viewIcSt11char_traitsIcEE"]
    pub fn wpi_detail_parse_error_create(
        id_: ::std::os::raw::c_int,
        byte_: usize,
        what_arg: std_string_view,
    ) -> wpi_detail_parse_error;
}
impl wpi_detail_parse_error {
    #[inline]
    pub unsafe fn create(
        id_: ::std::os::raw::c_int,
        byte_: usize,
        what_arg: std_string_view,
    ) -> wpi_detail_parse_error {
        wpi_detail_parse_error_create(id_, byte_, what_arg)
    }
}
#[doc = "@brief exception indicating errors with iterators\n\nThis exception is thrown if iterators passed to a library function do not match\nthe expected semantics.\n\nExceptions have ids 2xx.\n\nname / id                           | example message | description\n----------------------------------- | --------------- | -------------------------\njson.exception.invalid_iterator.201 | iterators are not compatible | The iterators passed to constructor @ref json(InputIT first, InputIT last) are not compatible, meaning they do not belong to the same container. Therefore, the range (@a first, @a last) is invalid.\njson.exception.invalid_iterator.202 | iterator does not fit current value | In an erase or insert function, the passed iterator @a pos does not belong to the JSON value for which the function was called. It hence does not define a valid position for the deletion/insertion.\njson.exception.invalid_iterator.203 | iterators do not fit current value | Either iterator passed to function @ref erase(IteratorType first, IteratorType last) does not belong to the JSON value from which values shall be erased. It hence does not define a valid range to delete values from.\njson.exception.invalid_iterator.204 | iterators out of range | When an iterator range for a primitive type (number, boolean, or string) is passed to a constructor or an erase function, this range has to be exactly (@ref begin(), @ref end()), because this is the only way the single stored value is expressed. All other ranges are invalid.\njson.exception.invalid_iterator.205 | iterator out of range | When an iterator for a primitive type (number, boolean, or string) is passed to an erase function, the iterator has to be the @ref begin() iterator, because it is the only way to address the stored value. All other iterators are invalid.\njson.exception.invalid_iterator.206 | cannot construct with iterators from null | The iterators passed to constructor @ref json(InputIT first, InputIT last) belong to a JSON null value and hence to not define a valid range.\njson.exception.invalid_iterator.207 | cannot use key() for non-object iterators | The key() member function can only be used on iterators belonging to a JSON object, because other types do not have a concept of a key.\njson.exception.invalid_iterator.208 | cannot use operator[] for object iterators | The operator[] to specify a concrete offset cannot be used on iterators belonging to a JSON object, because JSON objects are unordered.\njson.exception.invalid_iterator.209 | cannot use offsets with object iterators | The offset operators (+, -, +=, -=) cannot be used on iterators belonging to a JSON object, because JSON objects are unordered.\njson.exception.invalid_iterator.210 | iterators do not fit | The iterator range passed to the insert function are not compatible, meaning they do not belong to the same container. Therefore, the range (@a first, @a last) is invalid.\njson.exception.invalid_iterator.211 | passed iterators may not belong to container | The iterator range passed to the insert function must not be a subrange of the container to insert to.\njson.exception.invalid_iterator.212 | cannot compare iterators of different containers | When two iterators are compared, they must belong to the same container.\njson.exception.invalid_iterator.213 | cannot compare order of object iterators | The order of object iterators cannot be compared, because JSON objects are unordered.\njson.exception.invalid_iterator.214 | cannot get value | Cannot get value for iterator: Either the iterator belongs to a null value or it is an iterator to a primitive type (number, boolean, or string), but the iterator is different to @ref begin().\n\n@liveexample{The following code shows how an `invalid_iterator` exception can be\ncaught.,invalid_iterator}\n\n@sa @ref exception for the base class of the library exceptions\n@sa @ref parse_error for exceptions indicating a parse error\n@sa @ref type_error for exceptions indicating executing a member function with\na wrong type\n@sa @ref out_of_range for exceptions indicating access out of the defined range\n@sa @ref other_error for exceptions indicating other library errors\n\n@since version 3.0.0"]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_detail_invalid_iterator {
    pub _base: wpi_detail_exception,
}
#[test]
fn bindgen_test_layout_wpi_detail_invalid_iterator() {
    assert_eq!(
        ::std::mem::size_of::<wpi_detail_invalid_iterator>(),
        16usize,
        concat!("Size of: ", stringify!(wpi_detail_invalid_iterator))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_detail_invalid_iterator>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_detail_invalid_iterator))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN3wpi6detail16invalid_iterator6createEiSt17basic_string_viewIcSt11char_traitsIcEE"]
    pub fn wpi_detail_invalid_iterator_create(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
    ) -> wpi_detail_invalid_iterator;
}
extern "C" {
    #[link_name = "\u{1}_ZN3wpi6detail16invalid_iterator6createEiSt17basic_string_viewIcSt11char_traitsIcEES5_"]
    pub fn wpi_detail_invalid_iterator_create1(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
        type_info: std_string_view,
    ) -> wpi_detail_invalid_iterator;
}
impl wpi_detail_invalid_iterator {
    #[inline]
    pub unsafe fn create(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
    ) -> wpi_detail_invalid_iterator {
        wpi_detail_invalid_iterator_create(id_, what_arg)
    }
    #[inline]
    pub unsafe fn create1(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
        type_info: std_string_view,
    ) -> wpi_detail_invalid_iterator {
        wpi_detail_invalid_iterator_create1(id_, what_arg, type_info)
    }
}
#[doc = "@brief exception indicating executing a member function with a wrong type\n\nThis exception is thrown in case of a type error; that is, a library function is\nexecuted on a JSON value whose type does not match the expected semantics.\n\nExceptions have ids 3xx.\n\nname / id                     | example message | description\n----------------------------- | --------------- | -------------------------\njson.exception.type_error.301 | cannot create object from initializer list | To create an object from an initializer list, the initializer list must consist only of a list of pairs whose first element is a string. When this constraint is violated, an array is created instead.\njson.exception.type_error.302 | type must be object, but is array | During implicit or explicit value conversion, the JSON type must be compatible to the target type. For instance, a JSON string can only be converted into string types, but not into numbers or boolean types.\njson.exception.type_error.303 | incompatible ReferenceType for get_ref, actual type is object | To retrieve a reference to a value stored in a @ref json object with @ref get_ref, the type of the reference must match the value type. For instance, for a JSON array, the @a ReferenceType must be @ref array_t&.\njson.exception.type_error.304 | cannot use at() with string | The @ref at() member functions can only be executed for certain JSON types.\njson.exception.type_error.305 | cannot use operator[] with string | The @ref operator[] member functions can only be executed for certain JSON types.\njson.exception.type_error.306 | cannot use value() with string | The @ref value() member functions can only be executed for certain JSON types.\njson.exception.type_error.307 | cannot use erase() with string | The @ref erase() member functions can only be executed for certain JSON types.\njson.exception.type_error.308 | cannot use push_back() with string | The @ref push_back() and @ref operator+= member functions can only be executed for certain JSON types.\njson.exception.type_error.309 | cannot use insert() with | The @ref insert() member functions can only be executed for certain JSON types.\njson.exception.type_error.310 | cannot use swap() with number | The @ref swap() member functions can only be executed for certain JSON types.\njson.exception.type_error.311 | cannot use emplace_back() with string | The @ref emplace_back() member function can only be executed for certain JSON types.\njson.exception.type_error.312 | cannot use update() with string | The @ref update() member functions can only be executed for certain JSON types.\njson.exception.type_error.313 | invalid value to unflatten | The @ref unflatten function converts an object whose keys are JSON Pointers back into an arbitrary nested JSON value. The JSON Pointers must not overlap, because then the resulting value would not be well defined.\njson.exception.type_error.314 | only objects can be unflattened | The @ref unflatten function only works for an object whose keys are JSON Pointers.\njson.exception.type_error.315 | values in object must be primitive | The @ref unflatten function only works for an object whose keys are JSON Pointers and whose values are primitive.\njson.exception.type_error.316 | invalid UTF-8 byte at index 10: 0x7E | The @ref dump function only works with UTF-8 encoded strings; that is, if you assign a `std::string` to a JSON value, make sure it is UTF-8 encoded. |\n\n@liveexample{The following code shows how a `type_error` exception can be\ncaught.,type_error}\n\n@sa @ref exception for the base class of the library exceptions\n@sa @ref parse_error for exceptions indicating a parse error\n@sa @ref invalid_iterator for exceptions indicating errors with iterators\n@sa @ref out_of_range for exceptions indicating access out of the defined range\n@sa @ref other_error for exceptions indicating other library errors\n\n@since version 3.0.0"]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_detail_type_error {
    pub _base: wpi_detail_exception,
}
#[test]
fn bindgen_test_layout_wpi_detail_type_error() {
    assert_eq!(
        ::std::mem::size_of::<wpi_detail_type_error>(),
        16usize,
        concat!("Size of: ", stringify!(wpi_detail_type_error))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_detail_type_error>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_detail_type_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN3wpi6detail10type_error6createEiSt17basic_string_viewIcSt11char_traitsIcEE"]
    pub fn wpi_detail_type_error_create(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
    ) -> wpi_detail_type_error;
}
extern "C" {
    #[link_name = "\u{1}_ZN3wpi6detail10type_error6createEiSt17basic_string_viewIcSt11char_traitsIcEES5_"]
    pub fn wpi_detail_type_error_create1(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
        type_info: std_string_view,
    ) -> wpi_detail_type_error;
}
impl wpi_detail_type_error {
    #[inline]
    pub unsafe fn create(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
    ) -> wpi_detail_type_error {
        wpi_detail_type_error_create(id_, what_arg)
    }
    #[inline]
    pub unsafe fn create1(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
        type_info: std_string_view,
    ) -> wpi_detail_type_error {
        wpi_detail_type_error_create1(id_, what_arg, type_info)
    }
}
#[doc = "@brief exception indicating access out of the defined range\n\nThis exception is thrown in case a library function is called on an input\nparameter that exceeds the expected range, for instance in case of array\nindices or nonexisting object keys.\n\nExceptions have ids 4xx.\n\nname / id                       | example message | description\n------------------------------- | --------------- | -------------------------\njson.exception.out_of_range.401 | array index 3 is out of range | The provided array index @a i is larger than @a size-1.\njson.exception.out_of_range.402 | array index '-' (3) is out of range | The special array index `-` in a JSON Pointer never describes a valid element of the array, but the index past the end. That is, it can only be used to add elements at this position, but not to read it.\njson.exception.out_of_range.403 | key 'foo' not found | The provided key was not found in the JSON object.\njson.exception.out_of_range.404 | unresolved reference token 'foo' | A reference token in a JSON Pointer could not be resolved.\njson.exception.out_of_range.405 | JSON pointer has no parent | The JSON Patch operations 'remove' and 'add' can not be applied to the root element of the JSON value.\njson.exception.out_of_range.406 | number overflow parsing '10E1000' | A parsed number could not be stored as without changing it to NaN or INF.\njson.exception.out_of_range.407 | number overflow serializing '9223372036854775808' | UBJSON only supports integers numbers up to 9223372036854775807. |\njson.exception.out_of_range.408 | excessive array size: 8658170730974374167 | The size (following `#`) of an UBJSON array or object exceeds the maximal capacity. |\n\n@liveexample{The following code shows how an `out_of_range` exception can be\ncaught.,out_of_range}\n\n@sa @ref exception for the base class of the library exceptions\n@sa @ref parse_error for exceptions indicating a parse error\n@sa @ref invalid_iterator for exceptions indicating errors with iterators\n@sa @ref type_error for exceptions indicating executing a member function with\na wrong type\n@sa @ref other_error for exceptions indicating other library errors\n\n@since version 3.0.0"]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_detail_out_of_range {
    pub _base: wpi_detail_exception,
}
#[test]
fn bindgen_test_layout_wpi_detail_out_of_range() {
    assert_eq!(
        ::std::mem::size_of::<wpi_detail_out_of_range>(),
        16usize,
        concat!("Size of: ", stringify!(wpi_detail_out_of_range))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_detail_out_of_range>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_detail_out_of_range))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN3wpi6detail12out_of_range6createEiSt17basic_string_viewIcSt11char_traitsIcEE"]
    pub fn wpi_detail_out_of_range_create(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
    ) -> wpi_detail_out_of_range;
}
impl wpi_detail_out_of_range {
    #[inline]
    pub unsafe fn create(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
    ) -> wpi_detail_out_of_range {
        wpi_detail_out_of_range_create(id_, what_arg)
    }
}
#[doc = "@brief exception indicating other library errors\n\nThis exception is thrown in case of errors that cannot be classified with the\nother exception types.\n\nExceptions have ids 5xx.\n\nname / id                      | example message | description\n------------------------------ | --------------- | -------------------------\njson.exception.other_error.501 | unsuccessful: {\"op\":\"test\",\"path\":\"/baz\", \"value\":\"bar\"} | A JSON Patch operation 'test' failed. The unsuccessful operation is also printed.\n\n@sa @ref exception for the base class of the library exceptions\n@sa @ref parse_error for exceptions indicating a parse error\n@sa @ref invalid_iterator for exceptions indicating errors with iterators\n@sa @ref type_error for exceptions indicating executing a member function with\na wrong type\n@sa @ref out_of_range for exceptions indicating access out of the defined range\n\n@liveexample{The following code shows how an `other_error` exception can be\ncaught.,other_error}\n\n@since version 3.0.0"]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_detail_other_error {
    pub _base: wpi_detail_exception,
}
#[test]
fn bindgen_test_layout_wpi_detail_other_error() {
    assert_eq!(
        ::std::mem::size_of::<wpi_detail_other_error>(),
        16usize,
        concat!("Size of: ", stringify!(wpi_detail_other_error))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_detail_other_error>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_detail_other_error))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN3wpi6detail11other_error6createEiSt17basic_string_viewIcSt11char_traitsIcEE"]
    pub fn wpi_detail_other_error_create(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
    ) -> wpi_detail_other_error;
}
impl wpi_detail_other_error {
    #[inline]
    pub unsafe fn create(
        id_: ::std::os::raw::c_int,
        what_arg: std_string_view,
    ) -> wpi_detail_other_error {
        wpi_detail_other_error_create(id_, what_arg)
    }
}
#[doc = "< null value"]
pub const wpi_detail_value_t_null: wpi_detail_value_t = 0;
#[doc = "< object (unordered set of name/value pairs)"]
pub const wpi_detail_value_t_object: wpi_detail_value_t = 1;
#[doc = "< array (ordered collection of values)"]
pub const wpi_detail_value_t_array: wpi_detail_value_t = 2;
#[doc = "< string value"]
pub const wpi_detail_value_t_string: wpi_detail_value_t = 3;
#[doc = "< boolean value"]
pub const wpi_detail_value_t_boolean: wpi_detail_value_t = 4;
#[doc = "< number value (signed integer)"]
pub const wpi_detail_value_t_number_integer: wpi_detail_value_t = 5;
#[doc = "< number value (unsigned integer)"]
pub const wpi_detail_value_t_number_unsigned: wpi_detail_value_t = 6;
#[doc = "< number value (floating-point)"]
pub const wpi_detail_value_t_number_float: wpi_detail_value_t = 7;
#[doc = "< discarded by the the parser callback function"]
pub const wpi_detail_value_t_discarded: wpi_detail_value_t = 8;
#[doc = "@brief the JSON type enumeration\n\nThis enumeration collects the different JSON types. It is internally used to\ndistinguish the stored values, and the functions @ref json::is_null(),\n@ref json::is_object(), @ref json::is_array(),\n@ref json::is_string(), @ref json::is_boolean(),\n@ref json::is_number() (with @ref json::is_number_integer(),\n@ref json::is_number_unsigned(), and @ref json::is_number_float()),\n@ref json::is_discarded(), @ref json::is_primitive(), and\n@ref json::is_structured() rely on it.\n\n@note There are three enumeration entries (number_integer, number_unsigned, and\nnumber_float), because the library distinguishes these three types for numbers:\nuint64_t is used for unsigned integers,\nint64_t is used for signed integers, and\ndouble is used for floating-point numbers or to\napproximate integers which do not fit in the limits of their respective type.\n\n@sa @ref json::json(const value_t value_type) -- create a JSON\nvalue with the default value for a given type\n\n@since version 1.0.0"]
pub type wpi_detail_value_t = ::std::os::raw::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_detail_primitive_iterator_t {
    #[doc = " iterator as signed integer type"]
    pub m_it: wpi_detail_primitive_iterator_t_difference_type,
}
pub type wpi_detail_primitive_iterator_t_difference_type = isize;
pub const wpi_detail_primitive_iterator_t_begin_value:
    wpi_detail_primitive_iterator_t_difference_type = 0;
pub const wpi_detail_primitive_iterator_t_end_value:
    wpi_detail_primitive_iterator_t_difference_type = 1;
#[test]
fn bindgen_test_layout_wpi_detail_primitive_iterator_t() {
    const UNINIT: ::std::mem::MaybeUninit<wpi_detail_primitive_iterator_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpi_detail_primitive_iterator_t>(),
        4usize,
        concat!("Size of: ", stringify!(wpi_detail_primitive_iterator_t))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_detail_primitive_iterator_t>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_detail_primitive_iterator_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_it) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_detail_primitive_iterator_t),
            "::",
            stringify!(m_it)
        )
    );
}
#[doc = "@brief an iterator value\n\n@note This structure could easily be a union, but MSVC currently does not allow\nunions members with complex constructors, see https://github.com/nlohmann/json/pull/105."]
#[repr(C)]
pub struct wpi_detail_internal_iterator {
    #[doc = " iterator for JSON objects"]
    pub object_iterator: [u8; 0usize],
    #[doc = " iterator for JSON arrays"]
    pub array_iterator: [u8; 0usize],
    #[doc = " generic iterator for all other types"]
    pub primitive_iterator: wpi_detail_primitive_iterator_t,
}
#[doc = "@brief a template for a bidirectional iterator for the @ref json class\n\nThis class implements a both iterators (iterator and const_iterator) for the\n@ref json class.\n\n@note An iterator is called *initialized* when a pointer to a JSON value has\nbeen set (e.g., by a constructor or a copy assignment). If the iterator is\ndefault-constructed, it is *uninitialized* and most methods are undefined.\nThe library uses assertions to detect calls on uninitialized iterators.**\n\n@requirement The class satisfies the following concept requirements:\n-\n[BidirectionalIterator](http://en.cppreference.com/w/cpp/concept/BidirectionalIterator):\nThe iterator that can be moved can be moved in both directions (i.e.\nincremented and decremented).\n\n@since version 1.0.0, simplified in version 2.0.9, change to bidirectional\niterators in version 3.0.0 (see https://github.com/nlohmann/json/issues/593)"]
#[repr(C)]
pub struct wpi_detail_iter_impl {
    #[doc = " associated JSON instance"]
    pub m_object: wpi_detail_iter_impl_pointer,
    #[doc = " the actual iterator of the associated instance"]
    pub m_it: wpi_detail_internal_iterator,
}
pub type wpi_detail_iter_impl_object_t = [u8; 0usize];
pub type wpi_detail_iter_impl_array_t = [u8; 0usize];
#[doc = " The std::iterator class template (used as a base class to provide typedefs) is deprecated in C++17.\n The C++ Standard has never required user-defined iterators to derive from std::iterator.\n A user-defined iterator should provide publicly accessible typedefs named\n iterator_category, value_type, difference_type, pointer, and reference.\n Note that value_type is required to be non-const, even for constant iterators."]
pub type wpi_detail_iter_impl_iterator_category = std_bidirectional_iterator_tag;
#[doc = " the type of the values when the iterator is dereferenced"]
pub type wpi_detail_iter_impl_value_type = [u8; 0usize];
#[doc = " a type to represent differences between iterators"]
pub type wpi_detail_iter_impl_difference_type = [u8; 0usize];
#[doc = " defines a pointer to the type iterated over (value_type)"]
pub type wpi_detail_iter_impl_pointer = [u8; 0usize];
#[doc = " defines a reference to the type iterated over (value_type)"]
pub type wpi_detail_iter_impl_reference = [u8; 0usize];
#[doc = " proxy class for the items() function"]
#[repr(C)]
pub struct wpi_detail_iteration_proxy {
    #[doc = " the container to iterate"]
    pub container: [u8; 0usize],
}
#[doc = " helper class for iteration"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_detail_iteration_proxy_iteration_proxy_internal<IteratorType> {
    #[doc = " the iterator"]
    pub anchor: IteratorType,
    #[doc = " an index for arrays (used to create key names)"]
    pub array_index: usize,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<IteratorType>>,
}
#[doc = "@brief a template for a reverse iterator class\n\n@tparam Base the base iterator type to reverse. Valid types are @ref\niterator (to create @ref reverse_iterator) and @ref const_iterator (to\ncreate @ref const_reverse_iterator).\n\n@requirement The class satisfies the following concept requirements:\n-\n[BidirectionalIterator](http://en.cppreference.com/w/cpp/concept/BidirectionalIterator):\nThe iterator that can be moved can be moved in both directions (i.e.\nincremented and decremented).\n- [OutputIterator](http://en.cppreference.com/w/cpp/concept/OutputIterator):\nIt is possible to write to the pointed-to element (only if @a Base is\n@ref iterator).\n\n@since version 1.0.0"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_detail_json_reverse_iterator {
    pub _address: u8,
}
pub type wpi_detail_json_reverse_iterator_difference_type = isize;
#[doc = " shortcut to the reverse iterator adapter"]
pub type wpi_detail_json_reverse_iterator_base_iterator = u8;
#[doc = " the reference type for the pointed-to element"]
pub type wpi_detail_json_reverse_iterator_reference = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_detail_json_ref<BasicJsonType> {
    pub owned_value: wpi_detail_json_ref_value_type<BasicJsonType>,
    pub value_ref: *mut wpi_detail_json_ref_value_type<BasicJsonType>,
    pub is_rvalue: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<BasicJsonType>>,
}
pub type wpi_detail_json_ref_value_type<BasicJsonType> = BasicJsonType;
pub type wpi_SmallVectorTemplateBase_ValueParamT<T> = *const T;
#[doc = " This class consists of common code factored out of the SmallVector class to\n reduce code duplication based on the SmallVector 'N' template parameter."]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_SmallVectorImpl {
    pub _address: u8,
}
#[doc = " SmallVectorTemplateBase<TriviallyCopyable = false> - This is where we put\n method implementations that are designed to work with non-trivial T's.\n\n We approximate is_trivially_copyable with trivial move/copy construction and\n trivial destruction. While the standard doesn't specify that you're allowed\n copy these types with memcpy, there is no way for the type to observe this.\n This catches the important case of std::pair<POD, POD>, which is not\n trivially assignable."]
pub type wpi_SmallVectorImpl_SuperClass = u8;
pub type wpi_SmallVectorImpl_iterator = wpi_SmallVectorImpl_SuperClass;
pub type wpi_SmallVectorImpl_const_iterator = wpi_SmallVectorImpl_SuperClass;
pub type wpi_SmallVectorImpl_reference = wpi_SmallVectorImpl_SuperClass;
pub type wpi_SmallVectorImpl_size_type = wpi_SmallVectorImpl_SuperClass;
pub type wpi_SmallVectorImpl_ValueParamT = wpi_SmallVectorImpl_SuperClass;
#[doc = " StringMapImpl - This is the base class of StringMap that is shared among\n all of its instantiations."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_StringMapImpl {
    pub TheTable: *mut *mut wpi_StringMapEntryBase,
    pub NumBuckets: ::std::os::raw::c_uint,
    pub NumItems: ::std::os::raw::c_uint,
    pub NumTombstones: ::std::os::raw::c_uint,
    pub ItemSize: ::std::os::raw::c_uint,
}
pub const wpi_StringMapImpl_TombstoneIntVal: usize = 4294967292;
#[test]
fn bindgen_test_layout_wpi_StringMapImpl() {
    const UNINIT: ::std::mem::MaybeUninit<wpi_StringMapImpl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpi_StringMapImpl>(),
        20usize,
        concat!("Size of: ", stringify!(wpi_StringMapImpl))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_StringMapImpl>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_StringMapImpl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TheTable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_StringMapImpl),
            "::",
            stringify!(TheTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NumBuckets) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_StringMapImpl),
            "::",
            stringify!(NumBuckets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NumItems) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_StringMapImpl),
            "::",
            stringify!(NumItems)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NumTombstones) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_StringMapImpl),
            "::",
            stringify!(NumTombstones)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ItemSize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_StringMapImpl),
            "::",
            stringify!(ItemSize)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN3wpi13StringMapImpl11RehashTableEj"]
    pub fn wpi_StringMapImpl_RehashTable(
        this: *mut wpi_StringMapImpl,
        BucketNo: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " LookupBucketFor - Look up the bucket that the specified string should end\n up in.  If it already exists as a key in the map, the Item pointer for the\n specified bucket will be non-null.  Otherwise, it will be null.  In either\n case, the FullHashValue field of the bucket will be set to the hash value\n of the string."]
    #[link_name = "\u{1}_ZN3wpi13StringMapImpl15LookupBucketForESt17basic_string_viewIcSt11char_traitsIcEE"]
    pub fn wpi_StringMapImpl_LookupBucketFor(
        this: *mut wpi_StringMapImpl,
        Key: std_string_view,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[doc = " FindKey - Look up the bucket that contains the specified key. If it exists\n in the map, return the bucket number of the key.  Otherwise return -1.\n This does not modify the map."]
    #[link_name = "\u{1}_ZNK3wpi13StringMapImpl7FindKeyESt17basic_string_viewIcSt11char_traitsIcEE"]
    pub fn wpi_StringMapImpl_FindKey(
        this: *const wpi_StringMapImpl,
        Key: std_string_view,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " RemoveKey - Remove the specified StringMapEntry from the table, but do not\n delete it.  This aborts if the value isn't in the table."]
    #[link_name = "\u{1}_ZN3wpi13StringMapImpl9RemoveKeyEPNS_18StringMapEntryBaseE"]
    pub fn wpi_StringMapImpl_RemoveKey(
        this: *mut wpi_StringMapImpl,
        V: *mut wpi_StringMapEntryBase,
    );
}
extern "C" {
    #[doc = " RemoveKey - Remove the StringMapEntry for the specified key from the\n table, returning it.  If the key is not in the table, this returns null."]
    #[link_name = "\u{1}_ZN3wpi13StringMapImpl9RemoveKeyESt17basic_string_viewIcSt11char_traitsIcEE"]
    pub fn wpi_StringMapImpl_RemoveKey1(
        this: *mut wpi_StringMapImpl,
        Key: std_string_view,
    ) -> *mut wpi_StringMapEntryBase;
}
extern "C" {
    #[doc = " Allocate the table with the specified number of buckets and otherwise\n setup the map as empty."]
    #[link_name = "\u{1}_ZN3wpi13StringMapImpl4initEj"]
    pub fn wpi_StringMapImpl_init(this: *mut wpi_StringMapImpl, Size: ::std::os::raw::c_uint);
}
extern "C" {
    #[link_name = "\u{1}_ZN3wpi13StringMapImplC1Ejj"]
    pub fn wpi_StringMapImpl_StringMapImpl(
        this: *mut wpi_StringMapImpl,
        InitSize: ::std::os::raw::c_uint,
        ItemSize: ::std::os::raw::c_uint,
    );
}
impl wpi_StringMapImpl {
    #[inline]
    pub unsafe fn RehashTable(
        &mut self,
        BucketNo: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint {
        wpi_StringMapImpl_RehashTable(self, BucketNo)
    }
    #[inline]
    pub unsafe fn LookupBucketFor(&mut self, Key: std_string_view) -> ::std::os::raw::c_uint {
        wpi_StringMapImpl_LookupBucketFor(self, Key)
    }
    #[inline]
    pub unsafe fn FindKey(&self, Key: std_string_view) -> ::std::os::raw::c_int {
        wpi_StringMapImpl_FindKey(self, Key)
    }
    #[inline]
    pub unsafe fn RemoveKey(&mut self, V: *mut wpi_StringMapEntryBase) {
        wpi_StringMapImpl_RemoveKey(self, V)
    }
    #[inline]
    pub unsafe fn RemoveKey1(&mut self, Key: std_string_view) -> *mut wpi_StringMapEntryBase {
        wpi_StringMapImpl_RemoveKey1(self, Key)
    }
    #[inline]
    pub unsafe fn init(&mut self, Size: ::std::os::raw::c_uint) {
        wpi_StringMapImpl_init(self, Size)
    }
    #[inline]
    pub unsafe fn new(InitSize: ::std::os::raw::c_uint, ItemSize: ::std::os::raw::c_uint) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        wpi_StringMapImpl_StringMapImpl(__bindgen_tmp.as_mut_ptr(), InitSize, ItemSize);
        __bindgen_tmp.assume_init()
    }
}
#[doc = " StringMap - This is an unconventional map that is specialized for handling\n keys that are \"strings\", which are basically ranges of bytes. This does some\n funky memory allocation and hashing things to make it extremely efficient,\n storing the string data *after* the value in the map."]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_StringMap<AllocatorTy> {
    pub _base: wpi_StringMapImpl,
    pub Allocator: AllocatorTy,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<AllocatorTy>>,
}
#[doc = " StringMapEntry - This is used to represent one value that is inserted into\n a StringMap.  It contains the Value itself and the key: the string length\n and data."]
pub type wpi_StringMap_MapEntryTy<ValueTy> = wpi_StringMapEntry<ValueTy>;
pub type wpi_StringMap_key_type = *const ::std::os::raw::c_char;
pub type wpi_StringMap_mapped_type<ValueTy> = ValueTy;
#[doc = " StringMapEntry - This is used to represent one value that is inserted into\n a StringMap.  It contains the Value itself and the key: the string length\n and data."]
pub type wpi_StringMap_value_type<ValueTy> = wpi_StringMapEntry<ValueTy>;
pub type wpi_StringMap_size_type = usize;
pub type wpi_StringMap_const_iterator = wpi_StringMapConstIterator;
pub type wpi_StringMap_iterator = wpi_StringMapIterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_StringMapIterBase {
    pub Ptr: *mut *mut wpi_StringMapEntryBase,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_StringMapConstIterator {
    pub _base: wpi_StringMapIterBase,
}
pub type wpi_StringMapConstIterator_base = wpi_StringMapIterBase;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_StringMapIterator {
    pub _base: wpi_StringMapIterBase,
}
pub type wpi_StringMapIterator_base = wpi_StringMapIterBase;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_raw_ostream {
    _unused: [u8; 0],
}
#[doc = " An information struct used to provide DenseMap with the various necessary\n components for a given value type `T`. `Enable` is an optional additional\n parameter that is used to support SFINAE (generally using std::enable_if_t)\n in derived DenseMapInfo specializations; in non-SFINAE use cases this should\n just be `void`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_DenseMapInfo {
    pub _address: u8,
}
#[doc = " A base class for data structure classes wishing to make iterators\n (\"handles\") pointing into themselves fail-fast.  When building without\n asserts, this class is empty and does nothing.\n\n DebugEpochBase does not by itself track handles pointing into itself.  The\n expectation is that routines touching the handles will poll on\n isHandleInSync at appropriate points to assert that the handle they're using\n is still valid.\n"]
#[repr(C)]
#[derive(Debug)]
pub struct wpi_DebugEpochBase {
    pub Epoch: u64,
}
#[doc = " A base class for iterator classes (\"handles\") that wish to poll for\n iterator invalidating modifications in the underlying data structure.\n When LLVM is built without asserts, this class is empty and does nothing.\n\n HandleBase does not track the parent data structure by itself.  It expects\n the routines modifying the data structure to call incrementEpoch when they\n make an iterator-invalidating modification.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_DebugEpochBase_HandleBase {
    pub EpochAddress: *const u64,
    pub EpochAtCreation: u64,
}
#[test]
fn bindgen_test_layout_wpi_DebugEpochBase_HandleBase() {
    const UNINIT: ::std::mem::MaybeUninit<wpi_DebugEpochBase_HandleBase> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpi_DebugEpochBase_HandleBase>(),
        16usize,
        concat!("Size of: ", stringify!(wpi_DebugEpochBase_HandleBase))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_DebugEpochBase_HandleBase>(),
        8usize,
        concat!("Alignment of ", stringify!(wpi_DebugEpochBase_HandleBase))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EpochAddress) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_DebugEpochBase_HandleBase),
            "::",
            stringify!(EpochAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EpochAtCreation) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_DebugEpochBase_HandleBase),
            "::",
            stringify!(EpochAtCreation)
        )
    );
}
#[test]
fn bindgen_test_layout_wpi_DebugEpochBase() {
    const UNINIT: ::std::mem::MaybeUninit<wpi_DebugEpochBase> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpi_DebugEpochBase>(),
        8usize,
        concat!("Size of: ", stringify!(wpi_DebugEpochBase))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_DebugEpochBase>(),
        8usize,
        concat!("Alignment of ", stringify!(wpi_DebugEpochBase))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Epoch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_DebugEpochBase),
            "::",
            stringify!(Epoch)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct wpi_DenseMapBase {
    pub _base: wpi_DebugEpochBase,
}
pub type wpi_DenseMapBase_const_arg_type_t = wpi_const_pointer_or_const_ref;
pub type wpi_DenseMapBase_size_type = ::std::os::raw::c_uint;
pub type wpi_DenseMapBase_key_type<KeyT> = KeyT;
pub type wpi_DenseMapBase_mapped_type<ValueT> = ValueT;
pub type wpi_DenseMapBase_value_type<BucketT> = BucketT;
pub type wpi_DenseMapBase_iterator = u8;
pub type wpi_DenseMapBase_const_iterator = u8;
#[repr(C)]
#[derive(Debug)]
pub struct wpi_DenseMap<BucketT> {
    pub _base: wpi_DenseMapBase,
    pub Buckets: *mut BucketT,
    pub NumEntries: ::std::os::raw::c_uint,
    pub NumTombstones: ::std::os::raw::c_uint,
    pub NumBuckets: ::std::os::raw::c_uint,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<BucketT>>,
}
pub type wpi_DenseMap_BaseT = wpi_DenseMapBase;
pub type wpi_DenseMapIterator_difference_type = isize;
pub type wpi_DenseMapIterator_value_type = u8;
pub type wpi_DenseMapIterator_pointer = *mut wpi_DenseMapIterator_value_type;
pub type wpi_DenseMapIterator_reference = *mut wpi_DenseMapIterator_value_type;
pub type wpi_DenseMapIterator_iterator_category = std_forward_iterator_tag;
#[doc = " This class is the same as std::priority_queue with two changes:\n\n 1. Adds a remove() function for removing all elements from the priority queue\n    that match the given value.\n 2. Replaces \"void pop()\" with \"T pop()\" so the element can be moved from the\n    queue directly instead of copied from top()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_priority_queue<Sequence, Compare> {
    pub c: Sequence,
    pub comp: Compare,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Sequence>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<Compare>>,
}
pub type wpi_priority_queue_value_type = [u8; 0usize];
pub type wpi_priority_queue_reference = [u8; 0usize];
pub type wpi_priority_queue_const_reference = [u8; 0usize];
pub type wpi_priority_queue_size_type = [u8; 0usize];
pub type wpi_priority_queue_container_type<Sequence> = Sequence;
pub type wpi_priority_queue_value_compare<Compare> = Compare;
#[doc = " unique_function is a type-erasing functor similar to std::function.\n\n It can hold move-only function objects, like lambdas capturing unique_ptrs.\n Accordingly, it is movable but not copyable.\n\n It supports const-qualification:\n - unique_function<int() const> has a const operator().\n   It can only hold functions which themselves have a const operator().\n - unique_function<int()> has a non-const operator().\n   It can hold functions with a non-const operator(), like mutable lambdas."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_unique_function {
    pub _address: u8,
}
#[repr(C)]
pub struct wpi_SendableBuilder__bindgen_vtable {
    pub wpi_SendableBuilder_SetSmartDashboardType:
        unsafe extern "C" fn(this: *mut wpi_SendableBuilder, type_: std_string_view),
    pub wpi_SendableBuilder_SetActuator:
        unsafe extern "C" fn(this: *mut wpi_SendableBuilder, value: bool),
    pub wpi_SendableBuilder_SetSafeState:
        unsafe extern "C" fn(this: *mut wpi_SendableBuilder, func: [u32; 4usize]),
    pub wpi_SendableBuilder_AddBooleanProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddIntegerProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddFloatProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddDoubleProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddStringProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddBooleanArrayProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddIntegerArrayProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddFloatArrayProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddDoubleArrayProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddStringArrayProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddRawProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        typeString: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddSmallStringProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddSmallBooleanArrayProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddSmallIntegerArrayProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddSmallFloatArrayProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddSmallDoubleArrayProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddSmallStringArrayProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_AddSmallRawProperty: unsafe extern "C" fn(
        this: *mut wpi_SendableBuilder,
        key: std_string_view,
        typeString: std_string_view,
        getter: u8,
        setter: u8,
    ),
    pub wpi_SendableBuilder_GetBackendKind:
        unsafe extern "C" fn(this: *const wpi_SendableBuilder) -> wpi_SendableBuilder_BackendKind,
    pub wpi_SendableBuilder_IsPublished:
        unsafe extern "C" fn(this: *const wpi_SendableBuilder) -> bool,
    pub wpi_SendableBuilder_Update: unsafe extern "C" fn(this: *mut wpi_SendableBuilder),
    pub wpi_SendableBuilder_ClearProperties: unsafe extern "C" fn(this: *mut wpi_SendableBuilder),
}
#[repr(C)]
#[derive(Debug)]
pub struct wpi_SendableBuilder {
    pub vtable_: *const wpi_SendableBuilder__bindgen_vtable,
}
pub const wpi_SendableBuilder_BackendKind_kUnknown: wpi_SendableBuilder_BackendKind = 0;
pub const wpi_SendableBuilder_BackendKind_kNetworkTables: wpi_SendableBuilder_BackendKind = 1;
#[doc = " The backend kinds used for the sendable builder."]
pub type wpi_SendableBuilder_BackendKind = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_wpi_SendableBuilder() {
    assert_eq!(
        ::std::mem::size_of::<wpi_SendableBuilder>(),
        4usize,
        concat!("Size of: ", stringify!(wpi_SendableBuilder))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_SendableBuilder>(),
        4usize,
        concat!("Alignment of ", stringify!(wpi_SendableBuilder))
    );
}
pub type wpi_SmallSetIterator_SetIterTy = u8;
pub type wpi_SmallSetIterator_VecIterTy = u8;
#[doc = " SmallSetIterator - This class implements a const_iterator for SmallSet by\n delegating to the underlying SmallVector or Set iterators."]
pub type wpi_SmallSetIterator_SelfTy = u8;
#[doc = " Iterators to the parts of the SmallSet containing the data. They are set\n depending on isSmall."]
#[repr(C)]
#[repr(align(1))]
pub struct wpi_SmallSetIterator__bindgen_ty_1 {
    pub SetIter: __BindgenUnionField<wpi_SmallSetIterator_SetIterTy>,
    pub VecIter: __BindgenUnionField<wpi_SmallSetIterator_VecIterTy>,
    pub bindgen_union_field: [u8; 0usize],
}
pub type wpi_SmallSet_VIterator = u8;
pub type wpi_SmallSet_mutable_iterator = u8;
pub type wpi_SmallSet_size_type = usize;
#[doc = " SmallSetIterator - This class implements a const_iterator for SmallSet by\n delegating to the underlying SmallVector or Set iterators."]
pub type wpi_SmallSet_const_iterator = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_raw_istream {
    _unused: [u8; 0],
}
#[doc = "@brief default JSONSerializer template argument\n\nThis serializer ignores the template arguments and uses ADL\n([argument-dependent lookup](http://en.cppreference.com/w/cpp/language/adl))\nfor serialization."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_adl_serializer {
    pub _address: u8,
}
#[doc = "@brief a class to store JSON values\n\n@requirement The class satisfies the following concept requirements:\n- Basic\n- [DefaultConstructible](http://en.cppreference.com/w/cpp/concept/DefaultConstructible):\nJSON values can be default constructed. The result will be a JSON null\nvalue.\n- [MoveConstructible](http://en.cppreference.com/w/cpp/concept/MoveConstructible):\nA JSON value can be constructed from an rvalue argument.\n- [CopyConstructible](http://en.cppreference.com/w/cpp/concept/CopyConstructible):\nA JSON value can be copy-constructed from an lvalue expression.\n- [MoveAssignable](http://en.cppreference.com/w/cpp/concept/MoveAssignable):\nA JSON value van be assigned from an rvalue argument.\n- [CopyAssignable](http://en.cppreference.com/w/cpp/concept/CopyAssignable):\nA JSON value can be copy-assigned from an lvalue expression.\n- [Destructible](http://en.cppreference.com/w/cpp/concept/Destructible):\nJSON values can be destructed.\n- Layout\n- [StandardLayoutType](http://en.cppreference.com/w/cpp/concept/StandardLayoutType):\nJSON values have\n[standard layout](http://en.cppreference.com/w/cpp/language/data_members#Standard_layout):\nAll non-static data members are private and standard layout types, the\nclass has no virtual functions or (virtual) base classes.\n- Library-wide\n- [EqualityComparable](http://en.cppreference.com/w/cpp/concept/EqualityComparable):\nJSON values can be compared with `==`, see @ref\noperator==(const_reference,const_reference).\n- [LessThanComparable](http://en.cppreference.com/w/cpp/concept/LessThanComparable):\nJSON values can be compared with `<`, see @ref\noperator<(const_reference,const_reference).\n- [Swappable](http://en.cppreference.com/w/cpp/concept/Swappable):\nAny JSON lvalue or rvalue of can be swapped with any lvalue or rvalue of\nother compatible types, using unqualified function call @ref swap().\n- [NullablePointer](http://en.cppreference.com/w/cpp/concept/NullablePointer):\nJSON values can be compared against `std::nullptr_t` objects which are used\nto model the `null` value.\n- Container\n- [Container](http://en.cppreference.com/w/cpp/concept/Container):\nJSON values can be used like STL containers and provide iterator access.\n- [ReversibleContainer](http://en.cppreference.com/w/cpp/concept/ReversibleContainer);\nJSON values can be used like STL containers and provide reverse iterator\naccess.\n\n@invariant The member variables @a m_value and @a m_type have the following\nrelationship:\n- If `m_type == value_t::object`, then `m_value.object != nullptr`.\n- If `m_type == value_t::array`, then `m_value.array != nullptr`.\n- If `m_type == value_t::string`, then `m_value.string != nullptr`.\nThe invariants are checked by member function assert_invariant().\n\n@internal\n@note ObjectType trick from http://stackoverflow.com/a/9860911\n@endinternal\n\n@see [RFC 7159: The JavaScript Object Notation (JSON) Data Interchange\nFormat](http://rfc7159.net/rfc7159)\n\n@since version 1.0.0\n\n@nosubgrouping"]
#[repr(C)]
pub struct wpi_json {
    #[doc = " the type of the current element"]
    pub m_type: wpi_json_value_t,
    #[doc = " the value of the current element"]
    pub m_value: wpi_json_json_value,
}
pub type wpi_json_primitive_iterator_t = wpi_detail_primitive_iterator_t;
pub type wpi_json_internal_iterator = wpi_detail_internal_iterator;
pub type wpi_json_iter_impl = wpi_detail_iter_impl;
pub type wpi_json_iteration_proxy = wpi_detail_iteration_proxy;
pub type wpi_json_json_reverse_iterator = wpi_detail_json_reverse_iterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_json_binary_reader {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_json_binary_writer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_json_lexer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_json_parser {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wpi_json_serializer {
    _unused: [u8; 0],
}
#[doc = "@brief the JSON type enumeration\n\nThis enumeration collects the different JSON types. It is internally used to\ndistinguish the stored values, and the functions @ref json::is_null(),\n@ref json::is_object(), @ref json::is_array(),\n@ref json::is_string(), @ref json::is_boolean(),\n@ref json::is_number() (with @ref json::is_number_integer(),\n@ref json::is_number_unsigned(), and @ref json::is_number_float()),\n@ref json::is_discarded(), @ref json::is_primitive(), and\n@ref json::is_structured() rely on it.\n\n@note There are three enumeration entries (number_integer, number_unsigned, and\nnumber_float), because the library distinguishes these three types for numbers:\nuint64_t is used for unsigned integers,\nint64_t is used for signed integers, and\ndouble is used for floating-point numbers or to\napproximate integers which do not fit in the limits of their respective type.\n\n@sa @ref json::json(const value_t value_type) -- create a JSON\nvalue with the default value for a given type\n\n@since version 1.0.0"]
pub use self::wpi_detail_value_t as wpi_json_value_t;
#[doc = "@brief JSON Pointer\n\nA JSON pointer defines a string syntax for identifying a specific value\nwithin a JSON document. It can be used with functions `at` and\n`operator[]`. Furthermore, JSON pointers are the base for JSON patches.\n\n@sa [RFC 6901](https://tools.ietf.org/html/rfc6901)\n\n@since version 2.0.0"]
pub type wpi_json_json_pointer = [u32; 3usize];
pub type wpi_json_json_serializer = wpi_adl_serializer;
#[doc = " helper type for initializer lists of json values"]
pub type wpi_json_initializer_list_t = [u32; 2usize];
#[doc = "@brief general exception of the @ref json class\n\nThis class is an extension of `std::exception` objects with a member @a id for\nexception ids. It is used as the base class for all exceptions thrown by the\n@ref json class. This class can hence be used as \"wildcard\" to catch\nexceptions.\n\nSubclasses:\n- @ref parse_error for exceptions indicating a parse error\n- @ref invalid_iterator for exceptions indicating errors with iterators\n- @ref type_error for exceptions indicating executing a member function with\na wrong type\n- @ref out_of_range for exceptions indicating access out of the defined range\n- @ref other_error for exceptions indicating other library errors\n\n@internal\n@note To have nothrow-copy-constructible exceptions, we internally use\n`std::runtime_error` which can cope with arbitrary-length error messages.\nIntermediate strings are built with static functions and then passed to\nthe actual constructor.\n@endinternal\n\n@liveexample{The following code shows how arbitrary library exceptions can be\ncaught.,exception}\n\n@since version 3.0.0"]
pub type wpi_json_exception = wpi_detail_exception;
#[doc = "@brief exception indicating a parse error\n\nThis exception is thrown by the library when a parse error occurs. Parse errors\ncan occur during the deserialization of JSON text, CBOR, MessagePack, as well\nas when using JSON Patch.\n\nMember @a byte holds the byte index of the last read character in the input\nfile.\n\nExceptions have ids 1xx.\n\nname / id                      | example message | description\n------------------------------ | --------------- | -------------------------\njson.exception.parse_error.101 | parse error at 2: unexpected end of input; expected string literal | This error indicates a syntax error while deserializing a JSON text. The error message describes that an unexpected token (character) was encountered, and the member @a byte indicates the error position.\njson.exception.parse_error.102 | parse error at 14: missing or wrong low surrogate | JSON uses the `\\uxxxx` format to describe Unicode characters. Code points above above 0xFFFF are split into two `\\uxxxx` entries (\"surrogate pairs\"). This error indicates that the surrogate pair is incomplete or contains an invalid code point.\njson.exception.parse_error.103 | parse error: code points above 0x10FFFF are invalid | Unicode supports code points up to 0x10FFFF. Code points above 0x10FFFF are invalid.\njson.exception.parse_error.104 | parse error: JSON patch must be an array of objects | [RFC 6902](https://tools.ietf.org/html/rfc6902) requires a JSON Patch document to be a JSON document that represents an array of objects.\njson.exception.parse_error.105 | parse error: operation must have string member 'op' | An operation of a JSON Patch document must contain exactly one \"op\" member, whose value indicates the operation to perform. Its value must be one of \"add\", \"remove\", \"replace\", \"move\", \"copy\", or \"test\"; other values are errors.\njson.exception.parse_error.106 | parse error: array index '01' must not begin with '0' | An array index in a JSON Pointer ([RFC 6901](https://tools.ietf.org/html/rfc6901)) may be `0` or any number without a leading `0`.\njson.exception.parse_error.107 | parse error: JSON pointer must be empty or begin with '/' - was: 'foo' | A JSON Pointer must be a Unicode string containing a sequence of zero or more reference tokens, each prefixed by a `/` character.\njson.exception.parse_error.108 | parse error: escape character '~' must be followed with '0' or '1' | In a JSON Pointer, only `~0` and `~1` are valid escape sequences.\njson.exception.parse_error.109 | parse error: array index 'one' is not a number | A JSON Pointer array index must be a number.\njson.exception.parse_error.110 | parse error at 1: cannot read 2 bytes from vector | When parsing CBOR or MessagePack, the byte vector ends before the complete value has been read.\njson.exception.parse_error.112 | parse error at 1: error reading CBOR; last byte: 0xF8 | Not all types of CBOR or MessagePack are supported. This exception occurs if an unsupported byte was read.\njson.exception.parse_error.113 | parse error at 2: expected a CBOR string; last byte: 0x98 | While parsing a map key, a value that is not a string has been read.\n\n@note For an input with n bytes, 1 is the index of the first character and n+1\nis the index of the terminating null byte or the end of file. This also\nholds true when reading a byte vector (CBOR or MessagePack).\n\n@liveexample{The following code shows how a `parse_error` exception can be\ncaught.,parse_error}\n\n@sa @ref exception for the base class of the library exceptions\n@sa @ref invalid_iterator for exceptions indicating errors with iterators\n@sa @ref type_error for exceptions indicating executing a member function with\na wrong type\n@sa @ref out_of_range for exceptions indicating access out of the defined range\n@sa @ref other_error for exceptions indicating other library errors\n\n@since version 3.0.0"]
pub type wpi_json_parse_error = wpi_detail_parse_error;
#[doc = "@brief exception indicating errors with iterators\n\nThis exception is thrown if iterators passed to a library function do not match\nthe expected semantics.\n\nExceptions have ids 2xx.\n\nname / id                           | example message | description\n----------------------------------- | --------------- | -------------------------\njson.exception.invalid_iterator.201 | iterators are not compatible | The iterators passed to constructor @ref json(InputIT first, InputIT last) are not compatible, meaning they do not belong to the same container. Therefore, the range (@a first, @a last) is invalid.\njson.exception.invalid_iterator.202 | iterator does not fit current value | In an erase or insert function, the passed iterator @a pos does not belong to the JSON value for which the function was called. It hence does not define a valid position for the deletion/insertion.\njson.exception.invalid_iterator.203 | iterators do not fit current value | Either iterator passed to function @ref erase(IteratorType first, IteratorType last) does not belong to the JSON value from which values shall be erased. It hence does not define a valid range to delete values from.\njson.exception.invalid_iterator.204 | iterators out of range | When an iterator range for a primitive type (number, boolean, or string) is passed to a constructor or an erase function, this range has to be exactly (@ref begin(), @ref end()), because this is the only way the single stored value is expressed. All other ranges are invalid.\njson.exception.invalid_iterator.205 | iterator out of range | When an iterator for a primitive type (number, boolean, or string) is passed to an erase function, the iterator has to be the @ref begin() iterator, because it is the only way to address the stored value. All other iterators are invalid.\njson.exception.invalid_iterator.206 | cannot construct with iterators from null | The iterators passed to constructor @ref json(InputIT first, InputIT last) belong to a JSON null value and hence to not define a valid range.\njson.exception.invalid_iterator.207 | cannot use key() for non-object iterators | The key() member function can only be used on iterators belonging to a JSON object, because other types do not have a concept of a key.\njson.exception.invalid_iterator.208 | cannot use operator[] for object iterators | The operator[] to specify a concrete offset cannot be used on iterators belonging to a JSON object, because JSON objects are unordered.\njson.exception.invalid_iterator.209 | cannot use offsets with object iterators | The offset operators (+, -, +=, -=) cannot be used on iterators belonging to a JSON object, because JSON objects are unordered.\njson.exception.invalid_iterator.210 | iterators do not fit | The iterator range passed to the insert function are not compatible, meaning they do not belong to the same container. Therefore, the range (@a first, @a last) is invalid.\njson.exception.invalid_iterator.211 | passed iterators may not belong to container | The iterator range passed to the insert function must not be a subrange of the container to insert to.\njson.exception.invalid_iterator.212 | cannot compare iterators of different containers | When two iterators are compared, they must belong to the same container.\njson.exception.invalid_iterator.213 | cannot compare order of object iterators | The order of object iterators cannot be compared, because JSON objects are unordered.\njson.exception.invalid_iterator.214 | cannot get value | Cannot get value for iterator: Either the iterator belongs to a null value or it is an iterator to a primitive type (number, boolean, or string), but the iterator is different to @ref begin().\n\n@liveexample{The following code shows how an `invalid_iterator` exception can be\ncaught.,invalid_iterator}\n\n@sa @ref exception for the base class of the library exceptions\n@sa @ref parse_error for exceptions indicating a parse error\n@sa @ref type_error for exceptions indicating executing a member function with\na wrong type\n@sa @ref out_of_range for exceptions indicating access out of the defined range\n@sa @ref other_error for exceptions indicating other library errors\n\n@since version 3.0.0"]
pub type wpi_json_invalid_iterator = wpi_detail_invalid_iterator;
#[doc = "@brief exception indicating executing a member function with a wrong type\n\nThis exception is thrown in case of a type error; that is, a library function is\nexecuted on a JSON value whose type does not match the expected semantics.\n\nExceptions have ids 3xx.\n\nname / id                     | example message | description\n----------------------------- | --------------- | -------------------------\njson.exception.type_error.301 | cannot create object from initializer list | To create an object from an initializer list, the initializer list must consist only of a list of pairs whose first element is a string. When this constraint is violated, an array is created instead.\njson.exception.type_error.302 | type must be object, but is array | During implicit or explicit value conversion, the JSON type must be compatible to the target type. For instance, a JSON string can only be converted into string types, but not into numbers or boolean types.\njson.exception.type_error.303 | incompatible ReferenceType for get_ref, actual type is object | To retrieve a reference to a value stored in a @ref json object with @ref get_ref, the type of the reference must match the value type. For instance, for a JSON array, the @a ReferenceType must be @ref array_t&.\njson.exception.type_error.304 | cannot use at() with string | The @ref at() member functions can only be executed for certain JSON types.\njson.exception.type_error.305 | cannot use operator[] with string | The @ref operator[] member functions can only be executed for certain JSON types.\njson.exception.type_error.306 | cannot use value() with string | The @ref value() member functions can only be executed for certain JSON types.\njson.exception.type_error.307 | cannot use erase() with string | The @ref erase() member functions can only be executed for certain JSON types.\njson.exception.type_error.308 | cannot use push_back() with string | The @ref push_back() and @ref operator+= member functions can only be executed for certain JSON types.\njson.exception.type_error.309 | cannot use insert() with | The @ref insert() member functions can only be executed for certain JSON types.\njson.exception.type_error.310 | cannot use swap() with number | The @ref swap() member functions can only be executed for certain JSON types.\njson.exception.type_error.311 | cannot use emplace_back() with string | The @ref emplace_back() member function can only be executed for certain JSON types.\njson.exception.type_error.312 | cannot use update() with string | The @ref update() member functions can only be executed for certain JSON types.\njson.exception.type_error.313 | invalid value to unflatten | The @ref unflatten function converts an object whose keys are JSON Pointers back into an arbitrary nested JSON value. The JSON Pointers must not overlap, because then the resulting value would not be well defined.\njson.exception.type_error.314 | only objects can be unflattened | The @ref unflatten function only works for an object whose keys are JSON Pointers.\njson.exception.type_error.315 | values in object must be primitive | The @ref unflatten function only works for an object whose keys are JSON Pointers and whose values are primitive.\njson.exception.type_error.316 | invalid UTF-8 byte at index 10: 0x7E | The @ref dump function only works with UTF-8 encoded strings; that is, if you assign a `std::string` to a JSON value, make sure it is UTF-8 encoded. |\n\n@liveexample{The following code shows how a `type_error` exception can be\ncaught.,type_error}\n\n@sa @ref exception for the base class of the library exceptions\n@sa @ref parse_error for exceptions indicating a parse error\n@sa @ref invalid_iterator for exceptions indicating errors with iterators\n@sa @ref out_of_range for exceptions indicating access out of the defined range\n@sa @ref other_error for exceptions indicating other library errors\n\n@since version 3.0.0"]
pub type wpi_json_type_error = wpi_detail_type_error;
#[doc = "@brief exception indicating access out of the defined range\n\nThis exception is thrown in case a library function is called on an input\nparameter that exceeds the expected range, for instance in case of array\nindices or nonexisting object keys.\n\nExceptions have ids 4xx.\n\nname / id                       | example message | description\n------------------------------- | --------------- | -------------------------\njson.exception.out_of_range.401 | array index 3 is out of range | The provided array index @a i is larger than @a size-1.\njson.exception.out_of_range.402 | array index '-' (3) is out of range | The special array index `-` in a JSON Pointer never describes a valid element of the array, but the index past the end. That is, it can only be used to add elements at this position, but not to read it.\njson.exception.out_of_range.403 | key 'foo' not found | The provided key was not found in the JSON object.\njson.exception.out_of_range.404 | unresolved reference token 'foo' | A reference token in a JSON Pointer could not be resolved.\njson.exception.out_of_range.405 | JSON pointer has no parent | The JSON Patch operations 'remove' and 'add' can not be applied to the root element of the JSON value.\njson.exception.out_of_range.406 | number overflow parsing '10E1000' | A parsed number could not be stored as without changing it to NaN or INF.\njson.exception.out_of_range.407 | number overflow serializing '9223372036854775808' | UBJSON only supports integers numbers up to 9223372036854775807. |\njson.exception.out_of_range.408 | excessive array size: 8658170730974374167 | The size (following `#`) of an UBJSON array or object exceeds the maximal capacity. |\n\n@liveexample{The following code shows how an `out_of_range` exception can be\ncaught.,out_of_range}\n\n@sa @ref exception for the base class of the library exceptions\n@sa @ref parse_error for exceptions indicating a parse error\n@sa @ref invalid_iterator for exceptions indicating errors with iterators\n@sa @ref type_error for exceptions indicating executing a member function with\na wrong type\n@sa @ref other_error for exceptions indicating other library errors\n\n@since version 3.0.0"]
pub type wpi_json_out_of_range = wpi_detail_out_of_range;
#[doc = "@brief exception indicating other library errors\n\nThis exception is thrown in case of errors that cannot be classified with the\nother exception types.\n\nExceptions have ids 5xx.\n\nname / id                      | example message | description\n------------------------------ | --------------- | -------------------------\njson.exception.other_error.501 | unsuccessful: {\"op\":\"test\",\"path\":\"/baz\", \"value\":\"bar\"} | A JSON Patch operation 'test' failed. The unsuccessful operation is also printed.\n\n@sa @ref exception for the base class of the library exceptions\n@sa @ref parse_error for exceptions indicating a parse error\n@sa @ref invalid_iterator for exceptions indicating errors with iterators\n@sa @ref type_error for exceptions indicating executing a member function with\na wrong type\n@sa @ref out_of_range for exceptions indicating access out of the defined range\n\n@liveexample{The following code shows how an `other_error` exception can be\ncaught.,other_error}\n\n@since version 3.0.0"]
pub type wpi_json_other_error = wpi_detail_other_error;
#[doc = " the type of an element reference"]
pub type wpi_json_reference = *mut value_type;
#[doc = " the type of an element const reference"]
pub type wpi_json_const_reference = *const value_type;
#[doc = " a type to represent differences between iterators"]
pub type wpi_json_difference_type = isize;
#[doc = " a type to represent container sizes"]
pub type wpi_json_size_type = usize;
#[doc = " the allocator type"]
pub type wpi_json_allocator_type = u8;
#[doc = " the type of an element pointer"]
pub type wpi_json_pointer = u32;
#[doc = " the type of an element const pointer"]
pub type wpi_json_const_pointer = *const wpi_json;
#[doc = "@brief a template for a bidirectional iterator for the @ref json class\n\nThis class implements a both iterators (iterator and const_iterator) for the\n@ref json class.\n\n@note An iterator is called *initialized* when a pointer to a JSON value has\nbeen set (e.g., by a constructor or a copy assignment). If the iterator is\ndefault-constructed, it is *uninitialized* and most methods are undefined.\nThe library uses assertions to detect calls on uninitialized iterators.**\n\n@requirement The class satisfies the following concept requirements:\n-\n[BidirectionalIterator](http://en.cppreference.com/w/cpp/concept/BidirectionalIterator):\nThe iterator that can be moved can be moved in both directions (i.e.\nincremented and decremented).\n\n@since version 1.0.0, simplified in version 2.0.9, change to bidirectional\niterators in version 3.0.0 (see https://github.com/nlohmann/json/issues/593)"]
pub type wpi_json_iterator = wpi_detail_iter_impl;
#[doc = "@brief a template for a bidirectional iterator for the @ref json class\n\nThis class implements a both iterators (iterator and const_iterator) for the\n@ref json class.\n\n@note An iterator is called *initialized* when a pointer to a JSON value has\nbeen set (e.g., by a constructor or a copy assignment). If the iterator is\ndefault-constructed, it is *uninitialized* and most methods are undefined.\nThe library uses assertions to detect calls on uninitialized iterators.**\n\n@requirement The class satisfies the following concept requirements:\n-\n[BidirectionalIterator](http://en.cppreference.com/w/cpp/concept/BidirectionalIterator):\nThe iterator that can be moved can be moved in both directions (i.e.\nincremented and decremented).\n\n@since version 1.0.0, simplified in version 2.0.9, change to bidirectional\niterators in version 3.0.0 (see https://github.com/nlohmann/json/issues/593)"]
pub type wpi_json_const_iterator = wpi_detail_iter_impl;
#[doc = "@brief a template for a reverse iterator class\n\n@tparam Base the base iterator type to reverse. Valid types are @ref\niterator (to create @ref reverse_iterator) and @ref const_iterator (to\ncreate @ref const_reverse_iterator).\n\n@requirement The class satisfies the following concept requirements:\n-\n[BidirectionalIterator](http://en.cppreference.com/w/cpp/concept/BidirectionalIterator):\nThe iterator that can be moved can be moved in both directions (i.e.\nincremented and decremented).\n- [OutputIterator](http://en.cppreference.com/w/cpp/concept/OutputIterator):\nIt is possible to write to the pointed-to element (only if @a Base is\n@ref iterator).\n\n@since version 1.0.0"]
pub type wpi_json_reverse_iterator = wpi_detail_json_reverse_iterator;
#[doc = "@brief a template for a reverse iterator class\n\n@tparam Base the base iterator type to reverse. Valid types are @ref\niterator (to create @ref reverse_iterator) and @ref const_iterator (to\ncreate @ref const_reverse_iterator).\n\n@requirement The class satisfies the following concept requirements:\n-\n[BidirectionalIterator](http://en.cppreference.com/w/cpp/concept/BidirectionalIterator):\nThe iterator that can be moved can be moved in both directions (i.e.\nincremented and decremented).\n- [OutputIterator](http://en.cppreference.com/w/cpp/concept/OutputIterator):\nIt is possible to write to the pointed-to element (only if @a Base is\n@ref iterator).\n\n@since version 1.0.0"]
pub type wpi_json_const_reverse_iterator = wpi_detail_json_reverse_iterator;
#[doc = " @name JSON value data types\n The data types to store a JSON value. These types are derived from\n the template arguments passed to class @ref json.\n @{"]
pub type wpi_json_object_comparator_t = u8;
#[doc = " StringMap - This is an unconventional map that is specialized for handling\n keys that are \"strings\", which are basically ranges of bytes. This does some\n funky memory allocation and hashing things to make it extremely efficient,\n storing the string data *after* the value in the map."]
pub type wpi_json_object_t = wpi_StringMap<wpi_MallocAllocator>;
#[doc = "@brief a type for an array\n\n[RFC 7159](http://rfc7159.net/rfc7159) describes JSON arrays as follows:\n> An array is an ordered sequence of zero or more values.\n\n#### Limits\n\n[RFC 7159](http://rfc7159.net/rfc7159) specifies:\n> An implementation may set limits on the maximum depth of nesting.\n\nIn this class, the array's limit of nesting is not explicitly constrained.\nHowever, a maximum depth of nesting may be introduced by the compiler or\nruntime environment. A theoretical limit can be queried by calling the\n@ref max_size function of a JSON array.\n\n#### Storage\n\nArrays are stored as pointers in a @ref json type. That is, for any\naccess to array values, a pointer of type `array_t*` must be dereferenced.\n\n@sa @ref object_t -- type for an object value\n\n@since version 1.0.0"]
pub type wpi_json_array_t = [u32; 3usize];
#[doc = "@brief a JSON value\n\nThe actual storage for a JSON value of the @ref json class. This\nunion combines the different storage types for the JSON value types\ndefined in @ref value_t.\n\nJSON type | value_t type    | used type\n--------- | --------------- | ------------------------\nobject    | object          | pointer to @ref object_t\narray     | array           | pointer to @ref array_t\nstring    | string          | pointer to std::string\nboolean   | boolean         | bool\nnumber    | number_integer  | int64_t\nnumber    | number_unsigned | uint64_t\nnumber    | number_float    | double\nnull      | null            | *no value is stored*\n\n@note Variable-length types (objects, arrays, and strings) are stored as\npointers. The size of the union should not exceed 64 bits if the default\nvalue types are used.\n\n@since version 1.0.0"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union wpi_json_json_value {
    #[doc = " object (stored with pointer to save storage)"]
    pub object: *mut wpi_json_object_t,
    #[doc = " array (stored with pointer to save storage)"]
    pub array: *mut wpi_json_array_t,
    #[doc = " string (stored with pointer to save storage)"]
    pub string: *mut std_string,
    #[doc = " boolean"]
    pub boolean: bool,
    #[doc = " number (integer)"]
    pub number_integer: i64,
    #[doc = " number (unsigned integer)"]
    pub number_unsigned: u64,
    #[doc = " number (floating-point)"]
    pub number_float: f64,
}
#[test]
fn bindgen_test_layout_wpi_json_json_value() {
    const UNINIT: ::std::mem::MaybeUninit<wpi_json_json_value> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpi_json_json_value>(),
        8usize,
        concat!("Size of: ", stringify!(wpi_json_json_value))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_json_json_value>(),
        8usize,
        concat!("Alignment of ", stringify!(wpi_json_json_value))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).object) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_json_json_value),
            "::",
            stringify!(object)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_json_json_value),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_json_json_value),
            "::",
            stringify!(string)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).boolean) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_json_json_value),
            "::",
            stringify!(boolean)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).number_integer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_json_json_value),
            "::",
            stringify!(number_integer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).number_unsigned) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_json_json_value),
            "::",
            stringify!(number_unsigned)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).number_float) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_json_json_value),
            "::",
            stringify!(number_float)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN3wpi4json10json_value7destroyENS_6detail7value_tE"]
    pub fn wpi_json_json_value_destroy(this: *mut wpi_json_json_value, t: wpi_json_value_t);
}
extern "C" {
    #[doc = " constructor for empty values of a given type"]
    #[link_name = "\u{1}_ZN3wpi4json10json_valueC1ENS_6detail7value_tE"]
    pub fn wpi_json_json_value_json_value(this: *mut wpi_json_json_value, t: wpi_json_value_t);
}
impl wpi_json_json_value {
    #[inline]
    pub unsafe fn destroy(&mut self, t: wpi_json_value_t) {
        wpi_json_json_value_destroy(self, t)
    }
    #[inline]
    pub unsafe fn new(t: wpi_json_value_t) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        wpi_json_json_value_json_value(__bindgen_tmp.as_mut_ptr(), t);
        __bindgen_tmp.assume_init()
    }
}
#[doc = " the parser read `{` and started to process a JSON object"]
pub const wpi_json_parse_event_t_object_start: wpi_json_parse_event_t = 0;
#[doc = " the parser read `}` and finished processing a JSON object"]
pub const wpi_json_parse_event_t_object_end: wpi_json_parse_event_t = 1;
#[doc = " the parser read `[` and started to process a JSON array"]
pub const wpi_json_parse_event_t_array_start: wpi_json_parse_event_t = 2;
#[doc = " the parser read `]` and finished processing a JSON array"]
pub const wpi_json_parse_event_t_array_end: wpi_json_parse_event_t = 3;
#[doc = " the parser read a key of a value in an object"]
pub const wpi_json_parse_event_t_key: wpi_json_parse_event_t = 4;
#[doc = " the parser finished reading a JSON value"]
pub const wpi_json_parse_event_t_value: wpi_json_parse_event_t = 5;
#[doc = "@brief parser event types\n\nThe parser callback distinguishes the following events:\n- `object_start`: the parser read `{` and started to process a JSON object\n- `key`: the parser read a key of a value in an object\n- `object_end`: the parser read `}` and finished processing a JSON object\n- `array_start`: the parser read `[` and started to process a JSON array\n- `array_end`: the parser read `]` and finished processing a JSON array\n- `value`: the parser finished reading a JSON value\n\n@image html callback_events.png \"Example when certain parse events are triggered\"\n\n@sa @ref parser_callback_t for more information and examples"]
pub type wpi_json_parse_event_t = u8;
#[doc = "@brief per-element parser callback type\n\nWith a parser callback function, the result of parsing a JSON text can be\ninfluenced. When passed to @ref parse, it is called on certain events\n(passed as @ref parse_event_t via parameter @a event) with a set recursion\ndepth @a depth and context JSON value @a parsed. The return value of the\ncallback function is a boolean indicating whether the element that emitted\nthe callback shall be kept or not.\n\nWe distinguish six scenarios (determined by the event type) in which the\ncallback function can be called. The following table describes the values\nof the parameters @a depth, @a event, and @a parsed.\n\nparameter @a event | description | parameter @a depth | parameter @a parsed\n------------------ | ----------- | ------------------ | -------------------\nparse_event_t::object_start | the parser read `{` and started to process a JSON object | depth of the parent of the JSON object | a JSON value with type discarded\nparse_event_t::key | the parser read a key of a value in an object | depth of the currently parsed JSON object | a JSON string containing the key\nparse_event_t::object_end | the parser read `}` and finished processing a JSON object | depth of the parent of the JSON object | the parsed JSON object\nparse_event_t::array_start | the parser read `[` and started to process a JSON array | depth of the parent of the JSON array | a JSON value with type discarded\nparse_event_t::array_end | the parser read `]` and finished processing a JSON array | depth of the parent of the JSON array | the parsed JSON array\nparse_event_t::value | the parser finished reading a JSON value | depth of the value | the parsed JSON value\n\n@image html callback_events.png \"Example when certain parse events are triggered\"\n\nDiscarding a value (i.e., returning `false`) has different effects\ndepending on the context in which function was called:\n\n- Discarded values in structured types are skipped. That is, the parser\nwill behave as if the discarded value was never read.\n- In case a value outside a structured type is skipped, it is replaced\nwith `null`. This case happens if the top-level element is skipped.\n\n@param[in] depth  the depth of the recursion during parsing\n\n@param[in] event  an event of type parse_event_t indicating the context in\nthe callback function has been called\n\n@param[in,out] parsed  the current intermediate parse result; note that\nwriting to this value has no effect for parse_event_t::key events\n\n@return Whether the JSON value which called the function during parsing\nshould be kept (`true`) or not (`false`). In the latter case, it is either\nskipped completely or replaced by an empty discarded object.\n\n@sa @ref parse for examples\n\n@since version 1.0.0"]
pub type wpi_json_parser_callback_t = [u32; 4usize];
#[test]
fn bindgen_test_layout_wpi_json() {
    const UNINIT: ::std::mem::MaybeUninit<wpi_json> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<wpi_json>(),
        16usize,
        concat!("Size of: ", stringify!(wpi_json))
    );
    assert_eq!(
        ::std::mem::align_of::<wpi_json>(),
        8usize,
        concat!("Alignment of ", stringify!(wpi_json))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_json),
            "::",
            stringify!(m_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wpi_json),
            "::",
            stringify!(m_value)
        )
    );
}
extern "C" {
    #[doc = "@brief returns version information on the library\n\nThis function returns a JSON object with information about the library,\nincluding the version number and information on the platform and compiler.\n\n@return JSON object holding version information\nkey         | description\n----------- | ---------------\n`compiler`  | Information on the used compiler. It is an object with the following keys: `c++` (the used C++ standard), `family` (the compiler family; possible values are `clang`, `icc`, `gcc`, `ilecpp`, `msvc`, `pgcpp`, `sunpro`, and `unknown`), and `version` (the compiler version).\n`copyright` | The copyright line for the library as string.\n`name`      | The name of the library as string.\n`platform`  | The used platform as string. Possible values are `win32`, `linux`, `apple`, `unix`, and `unknown`.\n`url`       | The URL of the project as string.\n`version`   | The version of the library. It is an object with the following keys: `major`, `minor`, and `patch` as defined by [Semantic Versioning](http://semver.org), and `string` (the version string).\n\n@liveexample{The following code shows an example output of the `meta()`\nfunction.,meta}\n\n@exceptionsafety Strong guarantee: if an exception is thrown, there are no\nchanges to any JSON value.\n\n@complexity Constant.\n\n@since 2.1.0"]
    #[link_name = "\u{1}_ZN3wpi4json4metaEv"]
    pub fn wpi_json_meta() -> wpi_json;
}
extern "C" {
    #[doc = "@brief serialization\n\nSerialization function for JSON values. The function tries to mimic\nPython's `json.dumps()` function, and currently supports its @a indent\nand @a ensure_ascii parameters.\n\n@param[in] indent If indent is nonnegative, then array elements and object\nmembers will be pretty-printed with that indent level. An indent level of\n`0` will only insert newlines. `-1` (the default) selects the most compact\nrepresentation.\n@param[in] indent_char The character to use for indentation if @a indent is\ngreater than `0`. The default is ` ` (space).\n@param[in] ensure_ascii If @a ensure_ascii is true, all non-ASCII characters\nin the output are escaped with `\\uXXXX` sequences, and the result consists\nof ASCII characters only.\n\n@return string containing the serialization of the JSON value\n\n@throw type_error.316 if a string stored inside the JSON value is not\nUTF-8 encoded\n\n@complexity Linear.\n\n@exceptionsafety Strong guarantee: if an exception is thrown, there are no\nchanges in the JSON value.\n\n@liveexample{The following example shows the effect of different @a indent\\,\n@a indent_char\\, and @a ensure_ascii parameters to the result of the\nserialization.,dump}\n\n@see https://docs.python.org/2/library/json.html#json.dump\n\n@since version 1.0.0; indentation character @a indent_char, option\n@a ensure_ascii and exceptions added in version 3.0.0"]
    #[link_name = "\u{1}_ZNK3wpi4json4dumpB5cxx11Eicb"]
    pub fn wpi_json_dump(
        this: *const wpi_json,
        indent: ::std::os::raw::c_int,
        indent_char: ::std::os::raw::c_char,
        ensure_ascii: bool,
    ) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}_ZNK3wpi4json4dumpERNS_11raw_ostreamEicb"]
    pub fn wpi_json_dump1(
        this: *const wpi_json,
        os: *mut wpi_raw_ostream,
        indent: ::std::os::raw::c_int,
        indent_char: ::std::os::raw::c_char,
        ensure_ascii: bool,
    );
}
extern "C" {
    #[doc = "@brief access specified array element with bounds checking\n\nReturns a reference to the element at specified location @a idx, with\nbounds checking.\n\n@param[in] idx  index of the element to access\n\n@return reference to the element at index @a idx\n\n@throw type_error.304 if the JSON value is not an array; in this case,\ncalling `at` with an index makes no sense. See example below.\n@throw out_of_range.401 if the index @a idx is out of range of the array;\nthat is, `idx >= size()`. See example below.\n\n@exceptionsafety Strong guarantee: if an exception is thrown, there are no\nchanges in the JSON value.\n\n@complexity Constant.\n\n@since version 1.0.0\n\n@liveexample{The example below shows how array elements can be read and\nwritten using `at()`. It also demonstrates the different exceptions that\ncan be thrown.,at__size_type}"]
    #[link_name = "\u{1}_ZN3wpi4json2atEj"]
    pub fn wpi_json_at(this: *mut wpi_json, idx: wpi_json_size_type) -> wpi_json_reference;
}
extern "C" {
    #[doc = "@brief access specified array element with bounds checking\n\nReturns a const reference to the element at specified location @a idx,\nwith bounds checking.\n\n@param[in] idx  index of the element to access\n\n@return const reference to the element at index @a idx\n\n@throw type_error.304 if the JSON value is not an array; in this case,\ncalling `at` with an index makes no sense. See example below.\n@throw out_of_range.401 if the index @a idx is out of range of the array;\nthat is, `idx >= size()`. See example below.\n\n@exceptionsafety Strong guarantee: if an exception is thrown, there are no\nchanges in the JSON value.\n\n@complexity Constant.\n\n@since version 1.0.0\n\n@liveexample{The example below shows how array elements can be read using\n`at()`. It also demonstrates the different exceptions that can be thrown.,\nat__size_type_const}"]
    #[link_name = "\u{1}_ZNK3wpi4json2atEj"]
    pub fn wpi_json_at1(this: *const wpi_json, idx: wpi_json_size_type)
        -> wpi_json_const_reference;
}
extern "C" {
